{
  "filename": "1-s2.0-S2352152X26003178-main.pdf",
  "chunks": [
    {
      "text": "[Journal of Energy Storage 152 (2026) 120653](https://doi.org/10.1016/j.est.2026.120653) Contents lists available at ScienceDirect",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 39
    },
    {
      "text": "[journal homepage: www.elsevier.com/locate/est](https://www.elsevier.com/locate/est) Research papers",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "Journal of Energy Storage",
      "token_count": 28
    },
    {
      "text": "G. Sordi [a][,][b][,][c][,][*], G.M. Trippetta [a][,][d], D. Luder [b][,][c], S. Berg [c][,][e], W. Li [b][,][c],\nE. Figgemeier [b][,][c][,][e], D.U. Sauer [b][,][c][,][e], A. Casalegno [a], C. Rabissi [a][,][**] a _Politecnico di Milano, Department of Energy, via Lambruschini 4, 20156, Milano, Italy_\nb _Institute for Power Electronics and Electrical Drives (ISEA), RWTH Aachen University, 52074, Aachen, Germany_\nc _Center for Ageing, Reliability and Lifetime Prediction of Electrochemical and Power Electronic Systems (CARL), RWTH Aachen University, 52074, Aachen, Germany_\nd _Applied Electrochemistry, Department of Chemical Engineering, KTH Royal Institute of Technology, SE-100 44, Stockholm, Sweden_\ne _Helmholtz Institute Münster (HI MS), Forschungszentrum Jülich, Jülich, Germany_ A R T I C L E I N F O _Keywords:_\nLithium-ion battery\nLFP\nDegradation\nDiagnostics\nReal-world\nHeterogeneity **1. Introduction** A B S T R A C T",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "Degradation of LiFePO4 batteries after a real hybrid-bus extended application: Investigation of ageing phenomena and heterogeneity of performance",
      "token_count": 324
    },
    {
      "text": "A B S T R A C T Li-ion battery rapidly emerged as a key enabling technology towards the widespread adoption of low and zeroemissions vehicles. However, the understanding of long-term degradation still requires consolidation due to the\ncomplex interplay of several ageing mechanisms. Furthermore, it is widely reported in the literature that major\ndifferences could occur between laboratory-induced and real-world degradation. Hence, this work analyses a\nbatch of 24 LFP cells aged in a hybrid-bus application for up to 8 years. The combined use of a selection of\nexperimental measurements, ex-situ investigations and physical model simulations is the proposed tool to\nquantify the performance decay, identify the most important degradation mechanism, assess the heterogeneity\namong cells and relate it with the operating conditions. The characterisation showed significant heterogeneity in\nresidual capacity (from 80% down to 55% with respect to BoL) and impedance, suggesting an uneven module\ncooling effectiveness. Electrolyte degradation, generating together with Solid-electrolyte interface (SEI) growth a\npassivation and precipitation layer on the negative electrode surface, is identified as the dominant degradation\nmechanism, leading to a large loss of both lithium inventory and electrolyte conductivity, as suggested by\nmodelling analyses and confirmed with ex-situ investigations. This work provides novel insights into the state of\nhealth of a spent lithium-ion battery from the field as preliminary activity towards battery second life. Li-ion battery technology features an unmatched combination of\nhigh energy and power density at a reasonably low cost, making it the\ntechnology of choice for portable electronics, power tools, and hybrid/\nfull electric vehicles [1–3]. As a result, Li-ion batteries are of prior in­\nterest from both industry and government funding agencies, and\nresearch in this field has abounded in recent years [4,5]. However, several aspects are still to be improved to further increase\ntechnology competitiveness. One of them is ageing, occurring with the\noperation. Such degradation is the complex result of the interplay of\nseveral physicochemical mechanisms, which affect all the different components of the cells, including electrodes, electrolytes, separators,\nand current collectors [6,7]. The consolidation of physical and chemical\nmechanisms interplaying behind cell degradation is still an open issue\nfor both research and the industrial world, as well as their identifiability [8,9]. One relevant consequence is the complex evaluation of the suit­\nability of spent batteries to the so-called “second-life”, namely its uti­\nlisation in a different sector, like energy storage, after the “first life”, like\nthe usage in the automotive sector.",
      "page_num": 2,
      "chunk_index": 3,
      "section_name": "Degradation of LiFePO4 batteries after a real hybrid-bus extended application: Investigation of ageing phenomena and heterogeneity of performance",
      "token_count": 554
    },
    {
      "text": "[8,9]. One relevant consequence is the complex evaluation of the suit­\nability of spent batteries to the so-called “second-life”, namely its uti­\nlisation in a different sector, like energy storage, after the “first life”, like\nthe usage in the automotive sector. Among several chemistries available, Lithium-iron phosphate (LFP)\nis a very popular one adopted at positive electrode, thanks to the high\nthermal stability and power capabilities. Their main drawback is asso­\nciated with the limited energy density since LFP shows a lower electric - Corresponding author at: Politecnico di Milano, Department of Energy, via Lambruschini 4, 20156, Milano, Italy.\n** Corresponding author. _E-mail addresses:_ [gabriele.sordi@polimi.it (G. Sordi), claudio.rabissi@polimi.it (C. Rabissi).](mailto:gabriele.sordi@polimi.it) [https://doi.org/10.1016/j.est.2026.120653](https://doi.org/10.1016/j.est.2026.120653)\nReceived 9 June 2025; Received in revised form 5 December 2025; Accepted 15 January 2026 Available online 29 January 2026\n[2352-152X/© 2026 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ ).](http://creativecommons.org/licenses/by/4.0/)",
      "page_num": 2,
      "chunk_index": 4,
      "section_name": "Degradation of LiFePO4 batteries after a real hybrid-bus extended application: Investigation of ageing phenomena and heterogeneity of performance",
      "token_count": 340
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ potential compared to layered oxide materials [3]. Accordingly, several\nworks have investigated its characteristics. Among them, degradation\nand durability are important topics to widen their application. For\ninstance, Li et al. [10] studied the behaviour of LFP batteries during\nstorage at 20 [◦] C, 40 [◦] C and 60 [◦] C for more than 7000 h. They noticed a\nsignificant lithium loss that was associated with SEI formation/growth.\nHowever, at elevated temperatures, iron ions from the LFP structure\nmight dissolve, migrate in the electrolyte and precipitate on the surface\nof the negative electrode. Such an effect can cause an increase in SEI\ngrowth since conductive iron favours electron transport and blockage of\nactive sites of graphite, thus inhibiting the lithiation of the electrode. In\na subsequent work [11], they cycled some cells at the same temperatures\nto understand the additional loss of performance due to the usage. In this\ncase, they identified a loss of usable active material on the graphite\nelectrode, promoted by high temperatures and currents. Groot et al. [12] cycled LFP cells in 34 different combinations of\noperating conditions, exploiting constant-current cycles. They observed\nhow the degradation of asymmetrical cycles is different from symmet­\nrical ones, and, in particular, they underlined the role of rest phases at\nhigh and low SoC and the detrimental combination of fast charging\nprofiles with slow discharges. Sarasketa-Zabala et al. [13] investigated\ndegradation on LFP batteries undergoing deep discharge with constant\ncurrent at 30 [◦] C for thousands of cycles. They observed a two-stage\nbehaviour, with a change of slope of the capacity loss and the internal\nresistance, suggesting a change in the dominant ageing mechanism. The\ngrowth of the high-frequency intercept of the impedance was related to\nthe decomposition of the electrolyte. They identified a first linear trend\nwith the loss of lithium inventory (LLI) effect as a major effect and then a\nparabolic one with a combination of LLI and loss of active material on\nthe negative electrode (LAMNE). After cell opening, they found lithium\ndeposits on very aged samples, which were absent at the beginning and\nat an intermediate stage of the campaign. Therefore, they related the\nfirst stage to a SEI-dominated stage and the second to a lithium-platingdominated one, where both mechanisms were assumed to be pure LLIrelated.",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 567
    },
    {
      "text": "Different diagnostic techniques are employed in the scientific liter­\nature. For instance, quasi-equilibrium analysis is often performed to\nestimate the amount of lithium and active electrode losses. Dubarry and\nLiaw developed and extensively applied incremental capacity analysis to\nLFP cells to describe degradation [14,15]. Notably, LFP shows a peculiar\nopen-circuit potential (OCP) curve, with a single plateau around 3.45 V,\nwhich lasts until the very extreme lithiation levels [3,16]. Li et al. [17]\nthe differential voltage (DV) analysis on LFP, associating the decrease of\nthe charge exchange of the first plateau of graphite to LLI and the\ncontraction of the second plateau to the loss of active graphite sites.\nSarasketa-Zabala et al. [13] exploited different techniques as periodic\ncharacterisation tests during their cyclic ageing campaign. They tracked\nthe evolution of residual capacity through constant current charge and\ndischarge of LLI and LAMNE through C/5 cycles, the internal resistance\nduring a pulse and impedance by means of electrochemical impedance\nspectroscopy. Lastly, Groot et al. [12] monitored the trend of residual\ncapacity, measured through a 1C discharge, and of the impedance by\nway of electrochemical impedance spectroscopy (EIS). Post-mortem techniques validate degradation understanding. Li\net al. [10] confirmed the presence of iron on graphite due to dissolution\nwith X-ray photoelectron spectroscopy (XPS) analysis and later applied\nRaman spectroscopy to verify the existence of defects in the graphite\nstructure of cycled electrodes [11]. At the end of the campaign,\nSarasketa-Zabala et al. [13] conducted post-mortem analyses exploiting\nfield emission gun-scanning electron microscopy with Energy Dispersive\nX-ray Spectroscopy (EDS), low C-rate cycling of harvested material in\ncoin cell configuration with lithium counter electrode and X-ray\ndiffraction. Modelling techniques are typically used to predict capacity loss or\nresistance increase. Schimpe et al. [18] performed a wide experimental\ncampaign to parametrise a semi-empirical degradation model to predict the capacity loss during storage and cycling at various operating con­\nditions. They identified a squared-root dependency over time for cal­\nendar ageing, with an Arrhenius relation with storage temperature and a\nTafel equation to take the state of charge into account. They also\nmodelled cycle ageing as the superposition of four terms, namely cal­\nendar ageing, cycle ageing at low temperature, cycle ageing at high\ntemperature and cycle ageing at high temperature and high SoC. Lastly,\nthey validated the model against real data from a residential storage\napplication.",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 576
    },
    {
      "text": "As in these works, it is very common to induce degradation in the\nlaboratory, exploiting constant-current cycles due to the large amount of\ninformation and the complexity of collecting spent batteries from the\nfield. The same procedure was exploited also in [11,12]. Nevertheless, it\nhas been demonstrated that significant differences can occur between\nlaboratory-induced and real-world degradation [19]. Ramirez-Meyers\net al. [20] reported the analysis of used batteries from a hybrid bus\napplication. They evaluated the state of health of the pack by testing\ndifferent cells by position and measured a wide heterogeneity of per­\nformance both as residual capacity and impedance. However, their in­\nterest was devoted to the reusability in second-life applications\nconsidering the heterogeneity of performance, and they did not perform\nany degradation analysis. According to the literature review, comprehensive degradation\nanalysis of real-world LFP battery samples is not commonly available.\nThis study proposes an extensive characterisation of LFP batteries\nsourced from the field, integrating discharge curve analysis and\nimpedance tests with a suite of ex-situ measurements, such as half-cell\ncycling, EIS, and advanced imaging techniques. Furthermore, building\non previous work by the same authors on a different cell type [21,22],\nphysical models are utilised to simulate the operation of the samples.\nThis involves varying degradation-relevant physical parameters be­\ntween fresh and aged states to account for the degradation effects on\nperformance. By combining full-cell tests, ex-situ measurements, and\nmodelling simulations, this approach aims to elucidate the mechanisms\nof performance degradation. Such a combination of long-term field-aged\nsamples and multi-scale experimental and modelling diagnostic tech­\nniques has not, to the best of our knowledge, been previously reported\nfor LFP batteries, and it proves essential in this work for quantitatively\ndecoupling degradation mechanisms and explaining the pronounced\nheterogeneity observed in the field. It provides a detailed interpretation of ageing by identifying the most\nlikely degradation phenomena, thereby offering a comprehensive un­\nderstanding of the factors affecting the longevity and efficiency of LFP\nbatteries in real-world applications. **2. Experimental** _2.1. Description of the battery samples_ The characteristics of the tested samples are listed in Table 1. They\nhave been provided by IVECO Bus with the purpose of assessing the\ntechnical feasibility of a second-life utilisation in a privately funded\nproject. It is worth mentioning that the cells belong to two different cell\ntype releases: very aged cells are coded as “M1A”, while fresh or little\naged cells are coded as “M1B”. The differences between them are **Table 1**\nCharacteristics of the experimental samples [23,24]. Manufacturer A123 A123",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 587
    },
    {
      "text": "Manufacturer A123 A123 Model ANR26650M1A ANR26650M1B\nNominal capacity 2.3 Ah 2.5 Ah\nOperating window 2 V–3.6 V 2 V–3.6 V\nElectrode materials LFP|Graphite LFP|Graphite\nRecommended fast charge [A] 10 10\nContinuous max discharge [A] 70 50\nInternal impedance @1 kHz [mΩ] 8 6 2",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 106
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ provided in the table. This information is relevant since it limits the\ncomparability of performance between a fresh M1B cell and an aged\nM1A one. Since M1A is not available on the market anymore, type M1B\nare considered as a benchmark of performance for M1A. It is worth stressing that ex-situ inspection of selected M1A and M1B\ncells (not reported here for brevity) indicates that the main design dif­\nferences between the two revisions concern the positive electrode namely a slightly thinner LFP coating and a longer jelly-roll -, features\nthat are consistent with the change in specifications reported in Table 1.\nBy contrast, the negative electrode architecture appears essentially un­\nchanged, and -considering that ageing in these samples predominantly\naffects the negative electrode as will be confirmed in the results section this supports the use of M1B as a suitable pristine reference without\nsignificantly affecting the validity of the ageing analysis. A total of 15 aged modules were available, coming from three hybrid\nbuses of the same type. Due to module replacements, modules were\nmanufactured in different years and, therefore, experienced different\noperational life on the bus. All three buses worked in France in the\npublic transportation sector. _2.2. Battery pack design_ The battery pack is described here to understand the conditions in\nwhich the cells operate. In each bus, the battery pack is made of 16\nseries-connected modules. Each module is constituted by 12 seriesconnected strings, while each string is a parallel of 8 parallelconnected single cells. Cells are soldered between two aluminium\nsheets. The pack is air-cooled with ambient air. As described in Fig. 1a, the\nair is forced to flow below the modules, passes through and is ejected\nfrom the top. Two temperature sensors are placed attached to two cells\nper module (Fig. 1b). The first measures the surface temperature of one\ncell positioned in the lower ranks of the module, while the second is\npositioned in the higher ranks. Air can be heated by means of an elec­\ntrical resistance if the system works in heating mode. _2.3. Single cell samples selection_ In this work, 40 single cells were selected and extracted from their\nmodules. The choice aims to investigate: - different ages (manufactured in 2013 or 2016) - different position inside the string - different amount of warning counts, which are explained in Section\n2.5.",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 558
    },
    {
      "text": "- different amount of warning counts, which are explained in Section\n2.5. Two strings with the same characteristics are evaluated for the\npurpose of generalizability of the results. The details of these charac­\nteristics are provided in Table 2. With respect to the position of the cells\ninside the string, the colour coding and numbering shown in Fig. 1c are\napplied to all the cells. Thus, cells with numbers 1 and 2 are located at\nthe outlet section of the cooling air, while 7 and 8 are in the lower ranks\nof the module, at the inlet of the cooling stream. _2.4. Diagnostic tools and testing equipment_ The fresh cells are firstly investigated by performing full discharges,\nEIS and pulses at various combinations of C-rate, temperature and state\nof charge. At least two cells underwent the same test for reproducibility\npurposes, and results show very little variance. Aged cells underwent a\nselection of tests, as follows: - one full discharge at C/10, 25 [◦] C - one full discharge at 1C, 25 [◦] C - one EIS at 50% SoC, 25 [◦] C (galvanostatic, _<_ 10 mV peak-peak, 40\nlogarithmically-spaced frequencies from 4 kHz to 10mHz). **Fig. 1.** (a) Scheme of the cooling system. (b) Detail of the air flow passing\nthrough one module. One string and the position of the thermistors are high­\nlighted. (c) Colour coding and numbering for cells inside each string. **Table 2**\nCharacteristics of the tested samples. Code Module String Tested\ncells Manufacturing\nyear Warning\ncount From 1 to Extremely\nA0811 8 11 2013\n8 high From 1 to\nA0812 8 12 2013 High\n8 From 1 to\nA0802 8 2 2013 Low\n8 A0605 6 5 1-3-5-7 2013 High\nA0602 6 2 1-3-5-7 2013 Low\nB0101 1 1 1-3-5-7 2016 0\nB0112 1 12 1-3-5-7 2016 0 - Discharges and EIS are performed with a custom-developed experi­",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 533
    },
    {
      "text": "- Discharges and EIS are performed with a custom-developed experi­ mental testbench [25] testing station, including one power supply\nand two five-channel electronic loads, resulting in eight independent\ntesting channels, each capable of up to 80 A dynamic chargedischarge testing with EIS capability. All tests are performed in a\nBinder MKF 720 Eucar VI climatic chamber, with test temperature\nalways referring to the setpoint of the climatic chamber. Sample\nsurface temperature is monitored through type K thermocouples. 3",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 112
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ _2.5. On-board data_ The first step of the analysis involves the data collected by the battery\nmanagement system (BMS) of the vehicles, which were made available.\nIn particular, the distribution of pack current, string and module volt­\nages and temperature were provided. A few insights on the current\ndistribution are reported in S1 of the Supplementary Materials enclosed\nin this publication. Temperature is measured as a number of sampled events, discretised\ninto 5 [◦] C bands, for each module. The most frequent measurements of\nsensor T1 report values in the order of 25 [◦] C to 35 [◦] C. Differences be­\ntween modules are present, but these modules have different ages due to\nmodule replacements along the vehicle lifetime. Thus, it may affect this\nanalysis. More extreme temperatures are seldom recorded but almost\nnever out of the [5 [◦] C; 45 [◦] C] interval. Differently, T2 always records\nhigher temperatures with respect to T1, in the interval 35 [◦] C–40 [◦] C.\nTherefore, an average difference of 5 [◦] C or larger is estimated between\ninlet and outlet sections. This persistent gradient, observed over the\nentire operational life, suggests a systematic difference in long-term\nthermal exposure across the vertical direction of the module. The tem­\nperature measurements for one pack are shown in S2 as heatmaps of\nboth sensors together with the detail of one module. Lastly, the BMS provides the number of events when the voltage of\nthe strings overcame the voltage cut-offs during operation. This indi­\ncator, in the following labelled as “warnings count”, is considered in the\nselection of the cells for the experimental campaign as an early indicator\nof the state of health. _2.6. Modelling tools_",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 434
    },
    {
      "text": "_2.6. Modelling tools_ The interpretation of degradation is supported by the use of two\nphysical models to reproduce the operation of the cells under different\nconditions. First, one equilibrium model is exploited to simulate closeto-equilibrium discharge curves to identify the loss of lithium in­\nventory (LLI) and the loss of active electrodes material (LAMNE, LAMPE).\nThis model, described in supplementary materials, works in a Matlab\nenvironment and it is freely available. In the present work, a C/10 full\ndischarge at 25 [◦] C is exploited to approximate equilibrium conditions.\nParameters are identified through a Particle Swarm Optimisation (PSO)\nalgorithm, targeting the best fit of the experimental differential voltage\ncurve. The model uses the open-circuit potential (OCP) curves of the\nelectrodes, provided as look-up tables, as input data. Overpotentials are\nrepresented by a single, lumped resistance. The stoichiometric operating\nboundaries of the electrodes are determined using half-cell C/50 cycles\nin a coin cell configuration for a fresh sample. For aged cells, these\nboundaries are adapted on the values of LLI and LAMs. A non-linear\nsolver is utilised to align the OCP curves for aged cells, factoring in\nthe LAM values (acting as contraction factors for the curves and\nimplemented as purely delithiated) and the charge balance, which is\ninfluenced by LLI. Operating boundaries are later defined as the unique\nconditions of matching between the OCP curves providing the required\nvoltage cut-offs (upper and lower). For more information on the model\ndescription and parameter identification method, the reader is referred\nto [26]. The pseudo-two-dimensional (P2D) model is later utilised to simu­\nlate high C-rate discharge and EIS. The results for the fresh cells are\nreported in Section 3.3, while the selection of the fitting parameters for\naged cells is discussed in Section 3.6. This model is coupled with a\nthermal model, described in [27], to account for the effects of selfheating. The properties of electrodes and electrolytes are explicitly\ndependent on temperature. Overall, LLI and LAM parameters are taken from the q-OCP analysis;\nthe P2D model is calibrated only on a limited set of kinetic and\nelectrolyte-transport parameters required to reproduce high-rate\ndischarge and impedance behaviour. _2.7. Post-mortem analyses_",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 526
    },
    {
      "text": "_2.7. Post-mortem analyses_ One fresh and one strongly-aged sample is opened in the glovebox to\nundergo ex-situ investigations. Coin cells are fabricated with harvested\nmaterial from various positions of the jelly roll, with lithium chips as\ncounter-electrode and abundant amount of fresh electrolyte (90 μL).\nThey are cycled to perform quasi-open circuit potential measurements\n(q-OCP) at C/50 and 21 [◦] C, exploiting a Neware BTS4000-5V10mA\nbattery testing system, quantifying the residual performance and\npossible heterogeneities. The voltage cut-offs are selected depending on\nthe material as follows: - Graphite: between 0.01 V and 1.6 V - LFP: between 2.8 V and 3.75 V EIS at 25 [◦] C and different SoCs are also performed. They are per­\nformed either by means of a Gamry Reference 3000 or Gamry Interface\n5000E potentiostats. All cells are positioned in a thermal chamber\n(Binder MK 53) and left at rest until thermal equilibrium at 25 [◦] C is\nreached. Then, they undergo a charge (delithiation) phase up to the\nmaximum voltage selected for the Q-OCP measurements. After 5 h of\nrest, the following sequence is conducted: - OCV is measured for 30 s. - Galvanostatic EIS is performed. - OCV is measured for 30 s. - A C/10 discharge (lithiation) is performed for the desired DoD. - The cell remains at rest for 5 h, to ensure the equilibrium condition\nfor the following EIS. - The sequence is interrupted when either the cell reaches the mini­ mum voltage threshold during discharge or the expected number of\nrepetitions is achieved. Depth of discharge and C-rate are scaled to\nthe C/50 capacity measured in the Q-OCP estimation. EIS is per­\nformed at 5% or 10% SoC intervals. Preliminary tests are performed\nto determine a suitable current amplitude. The frequency range\nspans from 20 kHz to 10mHz, with 20 points per decade. 3 sines are\nperformed for every frequency Lastly, the morphology of the electrodes is investigated through\nScanning Electron Microscopy (SEM) images at different magnifications,\nand EDS is exploited to perform chemical composition analysis. For\nmore information, the reader can consult [28]. **3. Results and discussion** _3.1. Fresh cell - testing_ _3.1.1. Discharge test_",
      "page_num": 5,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 564
    },
    {
      "text": "_3.1.1. Discharge test_ Fresh cells are investigated to have a benchmark of performance. Full\ndischarges at different temperatures and C-rates are shown in Fig. 2a–b.\nThe cells show very good rate capabilities, releasing more than 96% of\nthe nominal capacity even at 10C, 10 [◦] C. At low rate, the typical shape of\nLFP|Graphite discharge curve is evident, with the staging behaviour of\ngraphite showing three clear voltage plateaus. These features are lost at\nhigh rates, where losses add on top. Surface temperature is measured\nalong the tests. No significant temperature rise is measured at C/10,\nwhile an increase within 5 [◦] C can be recorded at the end of discharge at\n1C, corresponding to irreversibility of the graphite intercalation reac­\ntion. Heat generation becomes non-negligible at 10C, at all tempera­\ntures, with an almost linear trend along the discharge. _3.1.2. EIS_ EIS at different temperatures and SoCs is also performed and re­\nported in Fig. 2c–f. It shows the usual inductive loop at very high fre­\nquencies. Around 1 kHz, the spectrum crosses the x-axis, thus providing\nthe purely resistive response of the device. Between 1 kHz and 10 Hz, the 4",
      "page_num": 5,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 303
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ **Fig. 2.** (a) Full discharges at various temperatures and C-rates for fresh cells. (b) Corresponding temperature rise, measured on the surface of the cells. (c) Nyquist\nplot and (d) Bode representation of the imaginary part of the EIS of a fresh cell at varying states of charge. (e) Nyquist plot of EIS at different temperatures and (f)\ncorresponding Bode plot of the imaginary component. spectrum exhibits an elongated semicircle, while at lower frequencies, a\nlinear branch is evident. Variations due to SoC [13] are relatively\nlimited, with the growth of the low-frequency tail at 100% SoC as the\nmost evident effect. On the contrary, temperature affects the size of the impedance greatly. The larger the temperature, the smaller the imped­\nance, especially in the charge-transfer area. Little difference in HFR is\ndetected, while the diffusion tail varies in magnitude but preserves the\nsame slope in the Nyquist plot. No major differences in frequencies are 5",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 259
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ present. _3.2. Fresh cell_ - _ex-situ analysis_ _3.2.1. Half-cell Q-OCP_ One fresh cell was opened in the glovebox with the procedure\ndescribed in Section 2.7. q-OCP measurements are reported in Fig. 3,\nwhile EIS measurements are presented in Fig. S4 of the Supplementary\nMaterials attached to this manuscript. In Fig. 3a, the charge (delithiation, blue) and discharge (lithiation,\nred) curves of one LFP half-cell at C/50 are shown. LFP shows a very flat profile, as known in the literature [3,16]. There is a mismatch as charge\ncount between charge and discharge, probably due to a small selfdischarge rate. Moreover, there is a slight hysteresis at the edges,\nwhere voltage variations are more or less steep, depending on the phase.\nFurthermore, between lithiation and delithiation phases, there is a\nvoltage difference, which is mostly associated with the thick separator.\nTherefore, OCP (green) is computed as the lithiation phase with the\naddition of half of this voltage difference. The curve is very close to the\naverage between the two phases (yellow), apart from the extremes,\nwhere some hysteresis occurs. This test was conducted on 13 cells,\nshowing little variabilities, as described in Section S3 of the **Fig. 3.** Lithiation, delithiation, average and derived OCP of one cell for (a) LFP and (b) graphite materials. (c) Discharge curve with electrodes OCP matching. (d)\nDifferential voltage with single electrode contributions. “Recombination” for the difference between positive and negative curves. DV contributions are taken as\nabsolute values to ease the comparison. 6",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 416
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ Supplementary Materials. Fig. 3b displays the same curves for the negative electrode half-cell.\nGraphite shows the usual three plateaus, as observed in the full cell\ndischarge. Slight hysteresis is detected also here, especially at high\nvoltage. No significant difference in capacity is recorded between the\ntwo phases, probably because of the low voltage of Graphite|Li half cells,\nwhich do not trigger significant self-discharges. The OCP of graphite is\nderived (green curve) as for LFP. The variability among graphite halfcells is discussed in Section S3 of the Supplementary Materials. _3.2.2. OCP matching_ Electrodes OCP are matched to better reproduce the full cell\ndischarge. The result is provided in Fig. 3c. From this activity, the\nlithiation degree of both materials at 100% and 0% SoC are estimated\nand fed to the models. These data are reported in Table 3, together with\nall the model parameters. Layers thickness and cross-sectional area are\nmeasured during the cell opening while the electrode solid volume\nfractions are fitted. The comparison between the experimental (black\ncurve) and modelled (green) C/10 25 [◦] C discharges is showed Fig. 3c–d\nin terms of discharge curve and differential voltage. The agreement is **Table 3**\nList of physical model parameters with estimation method and literature references. Estimation method: Lit. = obtained from literature, Meas. = experimentally\nmeasured, Ass. = assumption based, Fit. = model calibration on experimental measurement. Parameter Symbol Negative electrode Electrolyte/cell Positive electrode Estimation method Ref. Cross section [m [2] ] _Ac_ - 0.1886 - Meas Layer thickness [μm] _Li_ 45 25 70 Meas Solid volume fraction [− ] _εs,i_ 0.4775 - 0.378 Fit [31,33–35] Liquid volume fraction [− ] _εl,i_ 0.33 0.54 0.332 Lit [29–31,35] Inactive material volume fraction [− ] _εi,i_ 0.2225 0.46 0.29 Fit Maximum lithium concentration [mol m [−] [3] ] _cs,max,i_ 31,000 - 22,806 Lit [29,31,35,36] Stoichiometry at SoC 100% [− ] _x_ 100% 0.7446 - 0.0147 Fit [36]",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 585
    },
    {
      "text": "Stoichiometry at SoC 100% [− ] _x_ 100% 0.7446 - 0.0147 Fit [36] Stoichiometry at SoC 0% [− ] _x_ 0% 0.005 - 0.7246 Fit [36] Current collector resistance [mΩ] _Rcic_ - 3.25 - Fit Kinetic rate constants [m s [−] [1] ] _k_ 0 1.82e− 09 - 3.67e− 11 Fit [33,37] Double layer specific capacitance [F m [−] [2] ] _Cdl_ 0.021 - 1.560 Fit [38,39] Solid-state lithium diffusivity constant [m [2 ] s [−] [1] ] _Ds,_ 0 1.48e− 15 - 1.22e-16 Fit [40–43] Electrolyte conductivity factor [− ] _condel_ - 0.2672 - Fit [40,44,45] Activation energy for kinetic constant [J mol [−] [1 ] K [−] [1] ] _EAk_ 20,000 - 30,000 Lit [33,37,38] Activation energy for diffusion constant [J mol [−] [1 ] K [−] [1] ] _EAD_ 38,600 - 40,000 Lit [33,37,38] Particle radius [μm] _rp_ 1.1 - 0.076 Lit [29,31,35] Electronic conductivity [S m [−] [1] ] _σs_ 100 - 0.5 Lit [40,46,47] Lithium transference number [− ] _t_ 0 [+] - 0.3753 - Lit [40,44,45] Cathodic transfer coefficient [− ] _αc_ 0.5 - 0.5 Ass Anodic transfer coefficient [− ] _αa_ 0.5 - 0.5 Ass Reference temperature [ [◦] C] _T_ 0 25 - 25 Ass Active material specific heat [J kg [−] [1 ] K [−] [1] ] _Cam_ - 1100 - Lit [36] Active material density [kg m [−] [3] ] _ρam_ - 2047 - Lit [36] Active material radial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,rad,am_ - 52.35 - Lit [29–31,35]",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 578
    },
    {
      "text": "[29–31,35] Active material axial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,ax,am_ - 1.04 - Lit [48] Chamber convective heat transfer coefficient [W m [−] [2 ] K [−] [1] ] _hconv_ - 15 - Ass Mandrel radius [mm] _rmn_ - 2 - Lit [48] Active material thickness [mm] _ram_ - 10 - Lit [48] Steel case thickness [m] _rsc_ - 1 - Lit [48] Cell radius [mm] _rb_ - 1.3 - Meas Cell height [mm] _H_ - 6.5 - Meas Mandrel specific heat [J kg [−] [1 ] K [−] [1] ] _Cmn_ - 1700 - Lit [48] Mandrel density [kg m [−] [3] ] _ρmn_ - 1150 - Lit [48] Mandrel radial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,rad,mn_ - 0.26 - Lit [48] Mandrel axial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,ax,mn_ - 0.26 - Lit [48] Steel case specific heat [J kg [−] [1 ] K [−] [1] ] _Csc_ - 475 - Lit [48] Steel case density [kg m [−] [3] ] _ρsc_ - 7850 - Lit [48] Case radial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,rad,sc_ - 44.5 - Lit [48] Case axial thermal conductivity [W m [−] [1 ] K [−] [1] ] _kT,ax,sc_ - 44.5 - Lit [48] 7",
      "page_num": 8,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 446
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ satisfactory. _3.3. Fresh cell - model_ The parameters for a fresh cell are identified and the corresponding\nsimulations of discharges and EIS at different operating conditions are reported in Fig. 4, while the parameters value is reported in. Some discharges at C/10, 1C and 10C are shown at 10 [◦] C, 25 [◦] C and\n40 [◦] C in Fig. 4a, b, and c, respectively. The model (dark lines) reproduces\nthe major trends with temperature and C-rate. The results are satisfac­\ntory even at 10C. One limitation arises at a low C-rate, where the 1C\ndischarges show the staging behaviour of graphite clearly while they are **Fig. 4.** Model simulations compared to experimental curves for a fresh cell of discharges at (a) 10 [◦] C, (b) 25 [◦] C and (c) 40 [◦] C at different C-rates, (d) Nyquist plot of\nEIS and (e) Bode plot of imaginary component of the impedance at 25 [◦] C and various SoC, (f) Nyquist plot of EIS and (g) Bode plot of imaginary component of the\nimpedance at SoC 50% and various temperatures. 8",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 332
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ already blurred in the experimental curves. On the other hand, larger\nlosses at this rate would imply too large losses at 10C. These results are\nin line with the best available in the scientific literature [29–33] on\nsimilar cells, considering the wide range of operating conditions. EIS is investigated at varying SoC at 25 [◦] C (Fig. 4d) and at varying\ntemperatures at 50% SoC (Fig. 4f). The model captures the main phe­\nnomena and trends reasonably. Due to the small particle radius, the LFP\nimpedance is almost negligible in the full cell spectrum. At 100% SoC,\nthe model reproduces the diffusive branch properly, while it un­\nderestimates at all the other SoCs. The kinetic loop and high-frequency\nresistance are in line with the experiments, as depicted in the insets. The\nfrequency of the peak is well reproduced, too. Regarding the tempera­\nture effect, the model slightly overestimates the HFR variation and the\npeak frequency reduction at decreasing temperatures while it slightly\nunderestimates the variability of the loop size. At low frequencies, the\nsame underestimation of the diffusive branch is evident. Again, the re­\nsults are considered satisfactory. _3.4. Aged cells - testing_ _3.4.1. Residual capacity_ Approaching the aged samples, residual capacity is selected as an\nindicator to provide an overview of the situation. The value of all the\ntested cells, measured through C/10 discharge, is reported in Table 4. It is possible to notice that: - The first string shows residual capacities lower than 10% for all the\ncells. - There is a large spread of the results within the string, where the\nresidual capacity is higher for cells located at the inlet section of the\ncooling stream (numbers 5 to 8). This result, though unexpected,\nagrees with the work of Katrina Ramirez-Meyers et al. [20] on the\nsame cells and battery pack type. - Strings with similar warning counts (e.g. A0802 vs A0602 and A0812\nvs A0605) show similar residual capacities. - Cells numbered 5-6-7-8 show similar values both for high and low\nwarning counts. - Cells manufactured in 2016 (type B) still exhibit very large values,\nover 95%.",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 557
    },
    {
      "text": "- Cells manufactured in 2016 (type B) still exhibit very large values,\nover 95%. These observations are now discussed in detail with an extensive set\nof measurements. Before that, the first string is regarded as a failed case,\nand it is neglected in the next analyses. Fig. S5 in the Supplementary\nMaterials shows one damaged cell as an example. _3.4.2. EIS_ The strong heterogeneity inside the strings was not expected. Thus, it\nis firstly verified with EIS. Table 5 reports the distribution of highfrequency resistance (HFR) and charge transfer resistance (RCT) for all\nthe cells of strings A0802 and A0812, as an example. The full EIS spectra\nare available in FIG. S6 of the Supplementary Materials. The same het­\nerogeneity is displayed in the impedance, with lower HFR associated\nwith cells that exhibit higher residual capacities. Another big difference\nlies at intermediate frequencies, where the most aged cells show a bigger\nRCT with a lower characteristic frequency. Comparing strings A0802\nand A0812, cells 7 and 8 show similar results, while cells 1 and 2 have\ndifferent resistances, as already observed in the residual capacity anal­\nysis. Lastly, the impedance of strings with similar warning counts (e.g.\nA0802 vs A0602 and A0812 vs A0605) show similar trends in agreement\nwith the capacity measurements. For clarity, plots of residual capacity,\nHFR and RCT as a function of cell position within each string have been\nadded to the Supplementary Materials (Fig. S10), highlighting the\nconsistent positional trend observed across all 2013 samples. Both techniques identified a strong heterogeneity. Post-mortem an­\nalyses and model simulations are then applied to understand the\ndegradation that these cells underwent. The analysis is then focused on\nthese samples since cell B seems very close to a fresh state and this early\nconsideration is verified with differential voltage analysis and EIS. _3.5. Aged cells_ - _post-mortem analysis_ _3.5.1. Visual inspection_ One very aged cell is opened in an inert environment with the pro­\ncedure described in Section 2.7, namely cell A08122. Some pictures of\nthe electrodes are reported in S7 of the Supplementary Materials. The\nroll is visibly wet thus, a large quantity of electrolyte is still present in\nthe cell. LFP looks undamaged and glossy, like fresh. It only shows\nvertical pressure lines due to the usage in a cylindrical cell. Graphite is\nmore brittle and not uniformly coloured. It is blue in the middle and\nbrownish at the edges, with some white layers. _3.5.2. Half-cell Q-OCP_",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 587
    },
    {
      "text": "_3.5.2. Half-cell Q-OCP_ 10 working LFP/Li cells and 16 Graphite/Li cells are built with\nharvested material, punched from different positions of the roll. Fig. 5a reports the DV curve of charge and discharge phases of all the\ngraphite half-cells, which shows how the test is strongly repeatable. The\ncell-to-cell variability of capacity is within 3.5% for both phases, with\nneither great differences due to self-discharge nor variations due to the\nposition in the roll. An average decrease of capacity in the order of\n⁓10% is measured, which is an indicator of LAMNE. Also, a comparison\nof the DV of fresh and aged graphite against lithiation level is shown in **Table 4**\nResidual capacity in absolute and relative terms. Cells B are referred to as M1B nominal capacity. String A0811 A0802 A0602 A0812 A0605 B0101 B0112 Cell [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%]",
      "page_num": 10,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 250
    },
    {
      "text": "Cell [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] [mAh] [%] **1** 21 0.9 1584 68.9 1530 66.5 1272 55.3 1214 52.8 2428 97.1 2399 96.0\n**2** 137 6.0 1589 69.1 1332 57.9\n**3** 157 6.8 1631 70.9 1640 71.3 1360 59.1 1360 59.1 2392 95.7 2392 95.7\n**4** 144 6.3 1542 67.0 1284 55.8\n**5** 178 7.7 1807 78.6 1876 81.6 1537 66.8 1614 70.2 2430 97.2 2408 96.3\n**6** 187 8.1 1772 77.0 1582 68.8\n**7** 212 9.2 1841 80.0 1882 81.8 1800 78.3 1778 77.3 2467 98.7 2457 98.3\n**8** 138 6.0 1808 78.6 1730 75.2\n**1** 21 0.9 1584 68.9 1530 66.5 1272 55.3 1214 52.8 2428 97.1 2399 96.0\n**2** 137 6.0 1589 69.1 1332 57.9\n**3** 157 6.8 1631 70.9 1640 71.3 1360 59.1 1360 59.1 2392 95.7 2392 95.7\n**4** 144 6.3 1542 67.0 1284 55.8\n**5** 178 7.7 1807 78.6 1876 81.6 1537 66.8 1614 70.2 2430 97.2 2408 96.3\n**6** 187 8.1 1772 77.0 1582 68.8\n**7** 212 9.2 1841 80.0 1882 81.8 1800 78.3 1778 77.3 2467 98.7 2457 98.3\n**8** 138 6.0 1808 78.6 1730 75.2",
      "page_num": 10,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 643
    },
    {
      "text": "9",
      "page_num": 10,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 1
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ **Table 5**\nHigh-frequency resistance (HFR) and charge transfer resistance (RCT) values from EIS at 50% SOC in [mΩ]. BoL reference values are HFR = 5.1 mΩ and RCT = 1.6 mΩ.\nMore details on how these values have been measured are in Supplementary Materials S6. String A0802 A0602 A0812 A0605 B0101 B0112 Cell HFR CTR HFR CTR HFR CTR HFR CTR HFR CTR HFR CTR 1 9.47 5.93 10.61 9.29 10.91 9.49 11.21 11.29 6.06 2.44 5.90 2.90\n2 9.88 6.32 10.85 10.95\n3 10.04 5.76 10.42 8.18 10.31 10.99 11.54 10.26 5.51 2.49 5.42 2.58\n4 9.75 6.65 10.50 12.30\n5 9.24 4.76 9.18 5.02 10.27 6.93 10.17 6.83 5.72 2.28 5.79 3.21\n6 9.25 4.45 10.13 6.77\n7 8.44 3.96 8.62 5.28 8.95 4.65 9.06 5.44 5.55 2.45 5.21 2.99\n8 8.73 3.47 9.52 5.48 **Fig. 5.** GRAPHITE: (a) DV of C/50 de/lithiation cycles of 16 aged half-cells, together with (b) comparison of lithiation of fresh (blue) and aged (orange) electrodes.\nLFP: (d) OCP of C/50 de/lithiation cycles of 10 aged half-cells. (For interpretation of the references to colour in this figure legend, the reader is referred to the web\nversion of this article.) Fig. 5b. It corresponds to the comparison between M1B and M1A.\nDespite they are little, few differences arise, which can lead to misin­\nterpretation of the degradation effects.",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 572
    },
    {
      "text": "Fig. 5b. It corresponds to the comparison between M1B and M1A.\nDespite they are little, few differences arise, which can lead to misin­\nterpretation of the degradation effects. Fig. 5d shows the C/50 cycles of the LFP half-cells. The variability of\ncapacity retention of LFP is less than 9% and 3.5% in the discharge and\ncharge phases, respectively. The value of capacity retention is in line\nwith that of the fresh material and no major variation of the OCP curve is\ndetected. From these early observations, half-cell cycling confirms the\nsmall degree of degradation of the material, as in the visual inspection. Comparison between EIS Nyquist plot at several SoCs of fresh and\naged (e) LFP and (e) graphite half-cells. Blue shades for fresh materials,\norange shades for aged ones. _3.5.3. Half-cell EIS_ EIS of half-cells is performed, as specified in Section 2.7, on two aged\ncells for each type as well as on two fresh samples. Fig. 5c and e report\nthe comparison of fresh and aged Nyquist plots for three SoCs, while the\nfull description of EIS variations at varying SoCs is provided in FIG. S8 of 10",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 282
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ the Supplementary Materials. LFP EIS shows a limited variability with SoC in the aged sample\ncompared to the fresh one. In both cases, the kinetic loop increases with\nincreasing SOC but with clearly different magnitudes (Fig. 5d). Overall,\nthe different behaviour may be related to the improved cell design from\nM1A to M1B, and no major differences are evident as signs of\ndegradation. A good repeatability, both qualitatively and quantitatively, is\nobserved for the graphite EIS of the two tested cells. As in the fresh case,\nit shows a linear tail at high frequency, followed by a kinetic loop and a\ndiffusion branch. Comparing the spectra at corresponding SoCs (Fig. 5c),\nthe aged cell shows a larger imaginary component of the impedance,\naround 1.5 times. Overall, the variations in the semicircle magnitude\nand frequency seem to be the most relevant differences. Though part of\nthe differences might be related to the improved cell design M1A-M1B, a\nlarge share is likely to be associated with degradation, indicating a\nsignificant worsening of the reaction kinetics. Based on this analysis, the\nmodel calibration is performed. _3.5.4. Imaging and EDS_ Laser microscopies and SEM are reported for fresh and aged elec­\ntrodes in Fig. 6, enabling the comparison between different degradation\nstates. Concerning the fresh samples, LFP appears very homogeneous and\nflat in Fig. 6a. However, Fig. 6c reveals a flake-like structure in the\nmicron-scale despite the expected nano-structure. The chemical **Table 6**\nChemical composition by atomic mass of fresh and aged electrodes. Values are\naverage. NB: S, V, Co, Ni, Zr and Hf are not reported being equal to 0. Electrode Element atomic fraction [%] C O F Al P Fe Cu Positive (fresh) 29.2 43.37 4.47 0.47 11.11 10.93 0\nNegative (fresh) 90.94 5.74 2.97 0 0.14 0 0.2\nPositive (aged) 31.1 42.7 7.53 0.1 9.6 9.01 0\nNegative (aged) 47 42.3 8.66 0.1 1.5 0.17 0.3",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 565
    },
    {
      "text": "**Fig. 6.** Microscopies of a fresh and aged electrodes. Laser microscopies of (a) fresh LFP and (b) fresh graphite at 150×. SEM images of (c) fresh LFP at 20,000×, (d)\nfresh graphite at 5000×, (e) aged LFP at 20,000× and (g) aged graphite at 5000×. Optical microscopy of aged graphite at 20× magnification with (h) height analysis. 11",
      "page_num": 12,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 109
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ composition (Table 6, first line) is consistent with the LFP chemistry,\nwith additional conductive carbon to improve the low electronic con­\nductivity of the material. The microscopy of graphite in Fig. 6b reveals a\nflake structure consistent with the power-oriented design of the cell. On\ntop, some filaments are present, which may be conductive elements to\nfurther improve the performance. From Fig. 6d, the size of the flakes is\nestimated to be around 8 μm. The composition is carbon-based, with\nsome oxygen, fluorine and phosphorus, which can be associated with the\nbinder, the initial SEI and salt precipitates from electrolyte. Regarding aged sample, optical and laser microscopies of the aged\nLFP are omitted due to the limited amount of information. The SEM\nimage (Fig. 6e) shows a uniform and flat surface, with flake-type microstructures which resemble the figures of the fresh material (Fig. 6c).\nRegarding the chemical composition (Table 6), it is similar to the outline\nof the fresh cell. However, it is impossible to assign these slight differ­\nences to degradation rather than a different cell design. These final\nmeasurements further support the limited degradation level of this\nmaterial. On the other hand, optical microscopy of the surface of the\nnegative electrode shows the deposition of white components on top\n(Fig. 6f). Laser-microscopy height analysis (Fig. 6g) confirms that these\nsurface deposits form a continuous passivation layer located above the\ngraphite particles, reaching thickness values up to ~11 μm in the most\naffected regions. The underlying, uncovered areas maintain a\nmorphology similar to the fresh electrode, with flake-like graphite\nparticles of comparable size and preserved conductive filaments. The\nparticles are covered with a uniform semi-transparent layer, also\nshowing many cracks. EDS (Table 6) revealed that the carbon share is\nhalf of the value of the fresh cell, while oxygen and fluorine are much\nlarger. Both the visual appearance and the chemical composition suggest\nthat this layer is constituted by SEI and general residues from electrolyte\ndecomposition and salt precipitation. Still considering limited quanti­\ntative reliability of EDS measurements, low iron content is estimated,\nindicating no crossover consistently with the relatively low temperature\nof operation. It is worth to stress that, in subsequent activities, analogous\nanalyses have been performed on harvested materials from other single _3.6.1. DVA_",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "_3.6.1. DVA_ Differential voltage analysis is performed. The equilibrium model is\napplied to estimate quasi-equilibrium capacity losses. The lumped\nresistance is equal to 22 mΩ and 30 mΩ for fresh and aged cells,\nrespectively. Moreover, consistently with LFP being known as very\nstable against degradation [13], its LAM is firstly assumed to be negli­\ngible with respect to other contributions. Then, such assumption is later\nverified with cycling of harvested LFP material in half-cell configuration\n(Section 3.5). It is worth to stress the impact of OCP curves on such simulations.\nThey were initially derived from the literature, from which a wide\nvariability in the graphite curves appeared, that affected the reliability\nof the simulations, significantly affecting the results of the analysis. A\nsecond attempt was performed with the OCP curves of a fresh M1B cell,\nbut this solution showed non-negligible differences between the OCP\ncurve of M1A and M1B graphite, as reported before by comparing the\nDV of graphite half-cells. Therefore, the analysis is performed by\nexploiting the OCP curve of the aged cell. This choice is supported by the\nsimulations of C/50 discharges, where the characteristic peaks and\nvalleys of the DV plot are further magnified. Some cases are depicted in\nFig. 7a,b,c. Three cells with different degradation extents are provided,\ntogether with the model simulations. The shape of the graphite curve is\nthe same and resembles the shape of the M1A graphite curve, dis­\nregarding the degradation level. Hence, to further minimise the impact\nof M1A–M1B design differences on the ageing analysis, the q-OCP fitting\nis performed using the experimentally measured graphite OCP from an\nM1A cell, so that the identification of LLI and LAMNE relies on the exact\nchemistry representative of the aged samples. cell samples with miscellaneous ageing of the same population, hereby\nnot reported because out of the scope, and identified to have a lower\ndevelopment of such layer, which then consistently appears as related to\nbattery ageing state. _3.6. Aged cells_ - _model_ **Fig. 7.** Experimental (orange curve) and modelled (blue) differential voltage curves of cells (a) A06205, (b) A08126 and (c) A08124 at C/50 25 [◦] C. (For inter­\npretation of the references to colour in this figure legend, the reader is referred to the web version of this article.) 12",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 562
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ _3.6.2. Quasi-equilibrium ageing parameters evolution_ Model simulations, executed as described in Section 2.6, are in very\ngood agreement with the experiments. The values of LLI and LAMNE for\nthese simulations are reported in Table 7. As expected, LLI grows with\nlower residual capacity, since LAMNE is considered purely delithiated, so\nLLI is the only source of lithium loss. It is worth to stress that, following\nsuch assumption, losses cannot be expected in summing up resulting in\nlost capacity value, because a possible share of lithiated LAMNE would\nalso contribute to LLI. It is confirmed by the shape of the DV curve,\nwhere the first peak, corresponding to the transition between the first\nand second graphite plateaus, is missing in Fig. 7b–c, therefore, graphite\nis poorly lithiated at cell SoC 100%. The disappearance of the graphite\nstage I–II transition peak in highly aged cells indicates that the negative\nelectrode no longer reaches the high-lithiation compositions required\nfor this transition. This behaviour is reproduced by the q-OCP model\nthrough LLI variations only and is consistent with the sensitivity analysis\non identifiability characteristics performed over quasi-equilibrium DV\nanalysis discussed in [26], where LLI remains well identifiable while the\nidentifiability of LAMNE decreases as graphite staging features fade. In\nthis perspective, the absence of a clear trend in the estimated LAMNE\nvalues is coherent with its inherently limited identifiability under such\nextremely aged conditions. _3.6.3. Focus on LAMNE_ To deepen the understanding of this feature, a dedicated sensitivity\nanalysis is provided in Fig. 8 to highlight the effect of LAMNE on two\ndifferently-aged cells. “Model best fit” (black curve in Fig. 8a–d) is the\nsolution provided by the algorithm, which minimises the cost function.\nTwo further simulations are added: in the green case, LLI and LAMNE\nobtained by the algorithm are raised by 1% and 6%, respectively. In the\nblue case, both terms are decreased by the same amount. LLI is varied to\nmatch the last valley of the DV to ease the comparison among the curves.",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 521
    },
    {
      "text": "In Fig. 8a–b, this analysis is performed on a little-aged cell. In this\ncase, it is possible to visualise that there is a clear best-fit case. Indeed, in\nboth the green and the blue cases, it is easy to identify an over/underestimation of LAMNE, respectively, because the peak at 0.4 Ah is sensi­\ntive to LAMNE, with a very good fit only for the “Model best fit” case. Differently, Fig. 8c shows the same sensitivity analysis performed on\na severely aged sample. It appears that the green case underestimates the\nresidual capacity, thus introducing more losses than their proper\nmagnitude. However, the DV results (Fig. 8d) are close to the experi­\nments, both in magnitude and in position of the main characteristics. On\nthe contrary, the blue curve better approximates the residual capacity,\nproviding slightly worse results on the DV around 0.5 Ah. Between green\nand blue cases, LLI varies within 2%; thus, its value is very stable.\nDifferently, LAMNE varies by 12%, raising some questions on the reli­\nability of the estimation. The lack of the phase transition peak at high\nSOC in the DV curve clearly results in a loss of identifiability of LAMNE. As a result of the analysis, the simulation of the less-aged cell looks\nmore reliable, while for very-aged cells, further verifications are\nperformed. _3.6.4. Charge-based estimation of LAMNE_ To overcome these limitations, a charge-based method is developed.\nAs a common practice in literature [11], LAMNE of LFP|Graphite cells\ncan be estimated by comparing the distance between two relevant peaks\nof the graphite OCP. The usual approach involves the distance between _3.6.4. Charge-based estimation of LAMNE_ **Table 7**\nQuasi-equilibrium ageing parameters estimated for three cells at C/50 25 [◦] C\ndischarge. Cell Residual capacity LLI LAMNE A06025 81.6% 20.9% 19.7%\nA08126 68.8% 32.0% 9.1%\nA08124 55.8% 45.3% 11.0% the high SoC peak, that is, the transition between the first and second\nplateau, and the peak corresponding to the transition between the sec­\nond and third plateau [17]. Here, the method is extended, looking for a\ndifferent feature to be compared between fresh and aged cells in order to\nbe applied to all the tested cells. In particular, 4 couples of relevant\npoints are proposed. With reference to Fig. 8e,",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 598
    },
    {
      "text": "the high SoC peak, that is, the transition between the first and second\nplateau, and the peak corresponding to the transition between the sec­\nond and third plateau [17]. Here, the method is extended, looking for a\ndifferent feature to be compared between fresh and aged cells in order to\nbe applied to all the tested cells. In particular, 4 couples of relevant\npoints are proposed. With reference to Fig. 8e, - Point A: the position where DV achieves 0.1 V/Ah - Point B: the flattening due to the 2 L to 3 L transition of graphite [49] - Point C: the largest peak of the DV - Point D: the minimum, last flat voltage plateau before the end of\ndischarge - Point E: end of discharge. The difference in exchanged charge between these points is exploited\nas an indicator of LAMNE for all the 2013 samples. The results collected\nover C/10 discharges are shown in Fig. 8f, together with the estimation\nof the usual method, labelled “Voltage-based”. It is evident how all the\nmethods provide quite different results. The green method exploits a\nsmall charge difference. It is possible to assume that it is the least reliable\nsince measurement uncertainty and repeatability might affect the results\nin a non-negligible way. Other than this, all charge-based methods agree\nto identify more than 15% of LAMNE. Yellow and red approaches are\nsimilar and seldom agree with the voltage-based method. The blue\nmethod estimates more than 20% LAMNE. In summary, different chargebased methods are applied, but it is not possible to identify a proper\nvalue of LAMNE. Most of the methods agree in 15% or more LAMNE,\nsimilar to the reliable results collected with the voltage-based method on\nlittle-aged cells at C/50 discharge. Moreover, all methods show a little\ndependency on the residual capacity. Therefore, it is reasonable to as­\nsume LAMNE in the order of 20%. LLI remains the dominant effect. _3.6.5. Kinetics and mass transport_ The model is applied to simulate the 1C 25 [◦] C discharge and 100%\nSoC 25 [◦] C EIS after the identification of the quasi-equilibrium condi­\ntions. Differently from the main case study, in this case, the choice of the\nfree parameters is derived from the results of the post-mortem analysis\nto compensate for the absence of a reliable BoL sample of the same type,\nsimplifying the analysis. Therefore, the following decisions are made: - **HFR** : the difference between fresh and aged HFR is taken into ac­ count in two ways:",
      "page_num": 14,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 587
    },
    {
      "text": "count in two ways: - The current collector term is raised by 2 mΩ with respect to the BoL\ncalibration, considering the different impedance at 1 kHz stated in\nthe respective datasheets of model M1A and M1B. - The remaining differences can be associated with a limited degra­ dation of the electrolyte, either due to the electrolyte itself or to the\ngrowth of the SEI. Therefore, electrolyte conductivity and diffusivity\nare fitting parameters. - **Kinetics** : there is a growing kinetic loop on aged cells. The more\ndegraded the cell, the bigger the loop. According to the graphite halfcell, a worsening of the reaction is likely to have occurred. Thus, the\nnegative electrode kinetic rate constant is considered as a fitting\nparameter. - **Diffusion properties** : according to the BoL parameters, it is hard to\ndefine the properties such that both C/10, 1C and 10C discharges are\nproperly reproduced. In the absence of evidence of degradation of\nthese properties, they are assumed to be constant because their value\ncannot be identified reliably. The values of the parameters are provided in Table 8 as a multipli­\ncation factor related to the BoL value, while the curves are provided in\nFig. 9 for the cells belonging to string A0812 as an example. The peak\nfrequency is similar among the cells, and the double-layer capacitance\ndoes not show major differences. Between the least and the most\ndegraded cells, the kinetic rate constant can vary with a factor ⁓3, 13",
      "page_num": 14,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 338
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ **Fig. 8.** Deepening on the sensitivity of the quasi-equilibrium analysis on the value of LAMNE. (a) Discharge curve and (b) DV of cell A06025. (c) Discharge curve and\n(d) DV of cell A08124. Colour coding in the legend of subfigures (a) and (c). (e) Selection of the relevant points for the charge-based LAMNE estimation. (f) Results\nwith all the methods for all the C/10 discharges of 2013 samples. **Table 8**\nParameters value for string A0812. Cell Residual\ncapacity [%] Electrolyte\nconductivity\nfactor [− ] Kinetic rate\nfactor [− ] Double layer\ncapacitance factor [− ] reflecting the different sizes of the kinetic loop. Lastly, the HFR varies\nsignificantly, inducing a significant reduction of the electrolyte con­\nductivity, up to 50% for the most aged cells. Overall, there is a good\nagreement with aged cells exploiting only three fitting parameters. Discharges at 1C and different temperatures are reported in\nFig. 9e–g. Only the electrolyte diffusivity is reduced by 50% to account\nfor larger losses. It is in line with the electrolyte conductivity reduction.\nAt 40 [◦] C, the model simulations are quite in line with the experiments.\nMoving towards lower temperatures, higher losses arise, which are\nunderestimated by the model, as for the fresh case, in order to enable\n10C discharges. Differently from the fresh case, capacity varies sensibly\nwith temperature. The model follows this trend with a slight underes­\ntimation. Overall, the results are considered satisfactory. A08121 55.3 0.5 0.17 0.40\nA08122 57.9 0.5 0.17 0.40\nA08123 59.1 0.7 0.12 0.35\nA08124 55.8 0.5 0.12 0.40\nA08125 66.8 0.6 0.23 0.37\nA08126 68.8 0.7 0.21 0.37\nA08127 78.3 1.0 0.30 0.30\nA08128 75.2 0.8 0.28 0.30 14",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 566
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ **Fig. 9.** Experimental and simulated EIS and discharge for cells of string A0812. (a) Nyquist and (b) Bode of the imaginary component of cells 1-3-5-7, (c) Nyquist and\n(d) Bode of the imaginary component of cells 2-4-6-8. (e) 25 [◦] C, (f) 10 [◦] C and (g) 40 [◦] C 1C discharge of cells of the whole string A0812. _3.7. Aged cells_ - _origin and interpretation of degradation_ The analysis identified the following main observations - Residual performances are largely heterogeneous, also within the\nsame string, both in terms of capacity and impedance. - DVA highlighted a significant lithium inventory loss as the dominant\ndegradation mechanism. With different attempts, the most reason­\nable value of LAMNE is estimated in the order of 20%. There is no\nevidence of a distribution of LAMNE between cells of the same string,\nwhile LLI is strongly heterogeneous. 15",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 268
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ - The positive electrode does not show signs of degradation either in a\nvisual inspection, microscopies at various scales, chemical compo­\nsition and capacity retention with respect to the fresh cell. - Graphite EIS shows an increase of magnitude by 50% at all SoCs and\na shift to the lower frequency of its charge-transfer reaction. - Graphite microstructure does not seem to vary due to ageing, but\nmicroscopies clearly illustrate its covering by a thick white layer,\nlikely originated from electrolyte passivation and decomposition. - The model is applied to reproduce the behaviour of aged cells in 1C\n25 [◦] C discharge and 100% SoC 25 [◦] C impedance, explaining the\nmajor trends of losses exploiting the kinetic properties of the nega­\ntive electrode and the conductivity of the electrolyte. All the results lead to the conclusion that the LFP electrode is unaf­\nfected by ageing and that the most important degradation mechanism is\nrelated to SEI growth. This mechanism is in agreement with the reduc­\ntion of electrolyte conductivity and loss of lithium and is suggested by\nSEM images and chemical composition. The dominant role of SEI and\nelectrolyte degradation is further supported by the quantitative sepa­\nration of LLI and LAMNE obtained from q-OCP modelling and by the\nsubstantial reduction in electrolyte conductivity captured by P2D sim­\nulations. Consistently, post-mortem SEM/EDS reveals a thick surface\nlayer on graphite, whereas the LFP electrode remains structurally\nrobust. Together, these findings corroborate that ageing pathways pre­\ndominantly affect the negative electrode and the electrolyte, rather than\nthe LFP active material.",
      "page_num": 17,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 401
    },
    {
      "text": "Considering the available information regarding the operation of the\nbatteries on the vehicle, the origin of the heterogeneous behaviour is\nidentified as a temperature effect. Indeed, the cells are assumed to be\nvery similar in performance at a fresh state, as observed for the fresh\ncells tested in this campaign. They operate in parallel configuration, and\nno unbalancing is expected due to the external connections. The only\nanisotropy in the system is induced by the heating/cooling system.\n5–10 [◦] C average temperature difference, continued over 8 years, is likely\nto induce such a difference. A persistent inlet–outlet temperature dif­\nference of this magnitude can plausibly lead to ageing-rate accelerations\nof approximately 1.3–2× for a 5 [◦] C increase and 2–4× for a 10 [◦] C in­\ncrease, fully in line with typical Arrhenius-type behaviour and consistent\nwith the positional trends observed in residual capacity, HFR and RCT\n(see Fig. S10). This gradient of performance was evident in all the tested\nstrings, including samples manufactured in 2016, though to a small\nextent. Moreover, internal temperature differences might have been\neven larger. Consistently, the directional pattern of ageing observed in\nall strings mirrors the long-term inlet–outlet temperature difference\nmeasured by the BMS; this trend is also clearly visible in the positional\nplots included in the Supplementary Materials—where residual capac­\nity, HFR and RCT progressively improve from outlet-facing to inletfacing cell positions—and is fully consistent with the spatial SoH dis­\ntribution reported in [20], supporting uneven cooling as a plausible\ncontributor to the observed heterogeneity. Furthermore, this mechanism can feed on itself. Warm cells have a\nlow resistance. In a parallel connection, the voltage of all the cells has to\nbe the same. Thus, larger C-rates are expected for less resistive cells.\nLarger C-rates are likely to induce larger degradation, thus higher ca­\npacity loss and resistance increase, which, in turn, enhance the selfheating of the cell and, finally, its temperature. Lastly, a temperature\ngradient is consistent with a larger SEI growth since side-reactions ki­\nnetics is promoted at higher temperatures. **4. Conclusions** This work reports the state of health analysis of a batch of 24 end-oflife cells from a hybrid bus application, addressing the notable gap in\nextensive investigations of real-world samples in the literature. Fresh\ncells served as a performance benchmark and enabled the parameteri­\nzation of a physical P2D model. These cells demonstrated very high rate",
      "page_num": 17,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 572
    },
    {
      "text": "This work reports the state of health analysis of a batch of 24 end-oflife cells from a hybrid bus application, addressing the notable gap in\nextensive investigations of real-world samples in the literature. Fresh\ncells served as a performance benchmark and enabled the parameteri­\nzation of a physical P2D model. These cells demonstrated very high rate capabilities and low impedance, suitable for high-power applications.\nThe P2D model effectively replicated the discharge profiles and\nimpedance of the fresh cells. However, applying these results to aged\ncells was limited by differences in cell releases, internal geometries, and\ngraphite OCP. The characterisation of aged cells revealed significant\nheterogeneity in residual capacity (ranging from 80% to 55% of the BoL\ncapacity) and impedance. This variability is crucial for managing\nsecond-life batteries and is likely related to the cells' positions within\nstrings, influenced by uneven cooling effectiveness, as corroborated by\nthermal measurements from the BMS. To investigate the origins of\ndegradation and heterogeneity, this study combined cell testing data,\npost-mortem analyses of a very aged sample, and physical modelling.\nThe main findings include: - **Loss of Lithium Inventory:** The q-OCV model indicated that LLI is\nthe primary degradation mode. Estimating the loss of active material\non the negative electrode (LAMNE) was challenging due to the\ndisappearance of graphite stage I-II transition peaks in the DV\nanalysis of very aged cells. Alternative strategies validated against\nhalf-cell capacity measurements showed no more than 20% LAMNE,\nconfirming LLI as the dominant effect. - **P2D Model Application** : The model was applied to aged cells to\nreplicate behaviour during 1C 25 [◦] C discharge and 100% SoC 25 [◦] C\nimpedance tests. It explained major loss trends by considering the\nkinetic properties of the negative electrode and the conductivity of\nthe electrolyte. - **Graphite Material Analysis** : SEM and EDS revealed a thick surface\nlayer with significant oxygen and fluorine content, indicative of a\nelectrolyte-decomposition products related layer. This finding aligns\nwith the large LLI suggested by DV analysis and the decreased\nelectrolyte conductivity, which accounts for increased overpotentials\nduring discharge and the higher HFR in EIS. - **LFP Material Robustness** : Various measurements confirmed that\nLFP material exhibited superior robustness against degradation.",
      "page_num": 17,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 527
    },
    {
      "text": "- **LFP Material Robustness** : Various measurements confirmed that\nLFP material exhibited superior robustness against degradation. In conclusion, decomposition and passivation of electrolyte, together\nwith SEI growth, emerged as the dominant degradation mechanism,\ndriven by charge-discharge cycles during bus operation and parking\nphases at warm temperature, leading to LLI. The heterogeneity is\nattributed to the thermal gradients experienced by each string due to\nanisotropic cooling with ambient air. Prolonged temperature differences\nlikely led to varying SEI growth rates and residual performance\ndiscrepancies. These findings also suggest practical implications for second-life\napplications. Given the strong intra-module heterogeneity observed,\nany meaningful screening must be performed at cell level, since packlevel data and the parallel electrical configuration do not allow the\nageing contribution of individual cells to be resolved. Once modules are\ndisassembled, simple impedance-based triage at cell level (e.g., HFR and\nRCT at 50% SoC), combined with disassembly strategies that account for\ncell position, may help mitigate variability. Furthermore, the substantial\nloss of extractable capacity limits reuse in energy-oriented applications,\nwhereas the comparatively preserved impedance and high-rate behav­\niour indicate that repurposing in power-intensive second-life applica­\ntions may remain viable. Overall, this study provides an integrated and quantitative assess­\nment of long-term, real-world LFP ageing, combining complementary\nelectrochemical, modelling and post-mortem evidence, highlighting the\npractical challenges of performance heterogeneity within battery\nmodules. **List of acronyms** ~~**Acronym**~~ ~~**Description**~~\nBOL Begin of life ( _continued on next page_ ) 16",
      "page_num": 17,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 365
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ ( _continued_ ) CTR Charge Transfer Resistance\nDV Differential Voltage\nEDS Energy Dispersive X-ray Spectroscopy\nEIS Electrochemical Impedance Spectroscopy\nHFR High-Frequency Resistance\nLAM Loss of Active electrode Material\nLLI Loss of Lithium Inventory\nLFP Lithium-iron-phosphate battery\nOCP Open-Circuit Potential\nP2D Pseudo-two dimensional\nPSO Particle Swarm Optimisation\nSEI Solid electrolyte interphase\nSEM Scanning Electron Microscope\nSoC State of charge\nXPS X-ray photoelectron spectroscopy **CRediT authorship contribution statement** **G. Sordi:** Writing  - review & editing, Writing  - original draft,\nVisualization, Validation, Methodology, Investigation, Formal analysis,\nData curation, Conceptualization. **G.M. Trippetta:** Writing – review &\nediting, Writing - original draft, Visualization, Investigation, Formal\nanalysis, Conceptualization. **D. Luder:** Writing - review & editing,\nMethodology, Investigation. **S. Berg:** Methodology, Investigation. **W. Li:**\nWriting – review & editing, Supervision. **E. Figgemeier:** Supervision. **D.**\n**U. Sauer:** Supervision. **A. Casalegno:** Writing – review & editing, Su­\npervision, Project administration, Funding acquisition. **C. Rabissi:**\nWriting – review & editing, Supervision, Project administration, Fund­\ning acquisition, Conceptualization. **Declaration of competing interest** The authors declare that they have no known competing financial\ninterests or personal relationships that could have appeared to influence\nthe work reported in this paper. **Acknowledgements** The authors would like to acknowledge IVECO Bus SpA for sup­\nporting this research, providing the samples and BMS data and pursuing\nscientific dissemination by sharing the results of the activity in this\npublication. The work is also partially supported by the European\nUnion's Horizon Europe program [Grant Agreement No. 101138532,\nproject “AutoMat - Compliant and fully AUToMATed circular solutions\nfor multiple battery and battery embedded device enhanced by digital\nsolutions”]. The authors would like to acknowledge also Ludovica\nRovatti and Rasheed Michael Ishola for their help in performing SEM\nanalysis. Moreover, G.S. would like to acknowledge the IDEA League for\nfunding his research exchange at CARL, RWTH Aachen University,\nGermany. **Appendix A. Supplementary data**",
      "page_num": 18,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 565
    },
    {
      "text": "**Appendix A. Supplementary data** [Supplementary data to this article can be found online at https://doi.](https://doi.org/10.1016/j.est.2026.120653)\n[org/10.1016/j.est.2026.120653.](https://doi.org/10.1016/j.est.2026.120653) **Data availability** The dataset of the results described in this work is reported on\nZenodo. **References** [1] D. Stampatori, P.P. Raimondi, M. Noussan, Li-ion batteries: a review of a key\n[technology for transport decarbonization, Energies (Basel) 13 (2020), https://doi.](https://doi.org/10.3390/en13102638)\n[org/10.3390/en13102638.](https://doi.org/10.3390/en13102638) [2] G. Zubi, R. Dufo-Lopez, M. Carvalho, G. Pasaoglu, The lithium-ion battery: state of ´\nthe art and future perspectives, Renew. Sustain. Energy Rev. 89 (2018) 292–308,\n[https://doi.org/10.1016/j.rser.2018.03.002.](https://doi.org/10.1016/j.rser.2018.03.002) [3] N. Nitta, F. Wu, J.T. Lee, G. Yushin, Li-ion battery materials: present and future,\n[Mater. Today 18 (2015) 252–264, https://doi.org/10.1016/j.mattod.2014.10.040.](https://doi.org/10.1016/j.mattod.2014.10.040) [4] J. Jyoti, B.P. Singh, S.K. Tripathi, Recent advancements in development of different\ncathode materials for rechargeable lithium ion batteries, J. Energy Storage 43\n[(2021), https://doi.org/10.1016/j.est.2021.103112.](https://doi.org/10.1016/j.est.2021.103112) [5] M. Kotal, S. Jakhar, S. Roy, H.K. Sharma, Cathode materials for rechargeable\nlithium batteries: recent progress and future prospects, J. Energy Storage 47\n[(2022), https://doi.org/10.1016/j.est.2021.103534.](https://doi.org/10.1016/j.est.2021.103534)",
      "page_num": 18,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "[5] M. Kotal, S. Jakhar, S. Roy, H.K. Sharma, Cathode materials for rechargeable\nlithium batteries: recent progress and future prospects, J. Energy Storage 47\n[(2022), https://doi.org/10.1016/j.est.2021.103534.](https://doi.org/10.1016/j.est.2021.103534) [6] A. Barr´e, B. Deguilhem, S. Grolleau, M. G´erard, F. Suard, D. Riu, A review on\nlithium-ion battery ageing mechanisms and estimations for automotive\n[applications, J. Power Sources 241 (2013) 680–689, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2013.05.040)\n[jpowsour.2013.05.040.](https://doi.org/10.1016/j.jpowsour.2013.05.040) [7] C.R. Birkl, M.R. Roberts, E. McTurk, P.G. Bruce, D.A. Howey, Degradation\n[diagnostics for lithium ion cells, J. Power Sources 341 (2017) 373–386, https://](https://doi.org/10.1016/j.jpowsour.2016.12.011)\n[doi.org/10.1016/j.jpowsour.2016.12.011.](https://doi.org/10.1016/j.jpowsour.2016.12.011) [8] M. Zhang, Y. Liu, D. Li, X. Cui, L. Wang, L. Li, K. Wang, Electrochemical impedance\nspectroscopy: a new chapter in the fast and accurate estimation of the state of\n[health for lithium-ion batteries, Energies (Basel) 16 (2023), https://doi.org/](https://doi.org/10.3390/en16041599)\n[10.3390/en16041599.](https://doi.org/10.3390/en16041599) [9] D. Li, D. Yang, L. Li, L. Wang, K. Wang, Electrochemical impedance spectroscopy\nbased on the state of health estimation for lithium-ion batteries, Energies (Basel) 15\n[(2022), https://doi.org/10.3390/en15186665.](https://doi.org/10.3390/en15186665)",
      "page_num": 18,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 554
    },
    {
      "text": "[9] D. Li, D. Yang, L. Li, L. Wang, K. Wang, Electrochemical impedance spectroscopy\nbased on the state of health estimation for lithium-ion batteries, Energies (Basel) 15\n[(2022), https://doi.org/10.3390/en15186665.](https://doi.org/10.3390/en15186665) [10] D. Li, D.L. Danilov, J. Xie, L. Raijmakers, L. Gao, Y. Yang, P.H.L. Notten,\nDegradation mechanisms of C6/LiFePO4 batteries: experimental analyses of\n[calendar aging, Electrochim. Acta 190 (2016) 1124–1133, https://doi.org/](https://doi.org/10.1016/j.electacta.2015.12.161)\n[10.1016/j.electacta.2015.12.161.](https://doi.org/10.1016/j.electacta.2015.12.161) [11] D. Li, D. Danilov, L. Gao, Y. Yang, P.H.L. Notten, Degradation mechanisms of C6/\nLiFePO4 batteries: experimental analyses of cycling-induced aging, Electrochim.\n[Acta 210 (2016) 445–455, https://doi.org/10.1016/j.electacta.2016.05.091.](https://doi.org/10.1016/j.electacta.2016.05.091) [12] J. Groot, M. Swierczynski, A.I. Stan, S.K. Kær, On the complex ageing\ncharacteristics of high-power LiFePO4/graphite battery cells cycled with high\n[charge and discharge currents, J. Power Sources 286 (2015) 475–487, https://doi.](https://doi.org/10.1016/j.jpowsour.2015.04.001)\n[org/10.1016/j.jpowsour.2015.04.001.](https://doi.org/10.1016/j.jpowsour.2015.04.001)",
      "page_num": 18,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 485
    },
    {
      "text": "[13] E. Sarasketa-Zabala, F. Aguesse, I. Villarreal, L.M. Rodriguez-Martinez, C.M. Lopez, ´\nP. Kubiak, Understanding lithium inventory loss and sudden performance fade in\ncylindrical cells during cycling with deep-discharge steps, J. Phys. Chem. C 119\n[(2015) 896–906, https://doi.org/10.1021/jp510071d.](https://doi.org/10.1021/jp510071d) [14] M. Dubarry, C. Truchot, B.Y. Liaw, Synthesize battery degradation modes via a\n[diagnostic and prognostic model, J. Power Sources 219 (2012) 204–216, https://](https://doi.org/10.1016/j.jpowsour.2012.07.016)\n[doi.org/10.1016/j.jpowsour.2012.07.016.](https://doi.org/10.1016/j.jpowsour.2012.07.016) [15] M. Dubarry, B.Y. Liaw, Identify capacity fading mechanism in a commercial\n[LiFePO4 cell, J. Power Sources 194 (2009) 541–549, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2009.05.036)\n[jpowsour.2009.05.036.](https://doi.org/10.1016/j.jpowsour.2009.05.036) [16] A.K. Padhi, K.S. Nanjundaswamy, J.B. Goodenough, Phospho-olivines as positiveelectrode materials for rechargeable lithium batteries, J. Electrochem. Soc. 144\n[(1997) 1188–1194, https://doi.org/10.1149/1.1837571.](https://doi.org/10.1149/1.1837571) [17] D. Li, D.L. Danilov, L. Gao, Y. Yang, P.H.L. Notten, Degradation mechanisms of the\ngraphite electrode in C 6 /LiFePO 4 batteries unraveled by a non-destructive\n[approach, J. Electrochem. Soc. 163 (2016) A3016–A3021, https://doi.org/](https://doi.org/10.1149/2.0821614jes)\n[10.1149/2.0821614jes.](https://doi.org/10.1149/2.0821614jes)",
      "page_num": 18,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 583
    },
    {
      "text": "[18] M. Schimpe, M.E. von Kuepach, M. Naumann, H.C. Hesse, K. Smith, A. Jossen,\nComprehensive modeling of temperature-dependent degradation mechanisms in\nlithium iron phosphate batteries, J. Electrochem. Soc. 165 (2018) A181–A193,\n[https://doi.org/10.1149/2.1181714jes.](https://doi.org/10.1149/2.1181714jes) [19] A. Barr´e, F. Suard, M. G´erard, M. Montaru, D. Riu, Statistical analysis for\nunderstanding and predicting battery degradations in real-life electric vehicle use,\n[J. Power Sources 245 (2014) 846–856, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2013.07.052)\n[jpowsour.2013.07.052.](https://doi.org/10.1016/j.jpowsour.2013.07.052) [20] K. Ramirez-Meyers, B. Rawn, J.F. Whitacre, A statistical assessment of the state-ofhealth of LiFePO4 cells harvested from a hybrid-electric vehicle battery pack,\n[J. Energy Storage 59 (2023), https://doi.org/10.1016/j.est.2022.106472.](https://doi.org/10.1016/j.est.2022.106472) [21] G. Sordi, A. Rondi, D. Conti, A. Casalegno, C. Rabissi, Degradation of lithium-ion\nbatteries under automotive-like conditions: aging tests, capacity loss and q-OCP\n[interpretation, Future Batteries 3 (2024) 100005, https://doi.org/10.1016/J.](https://doi.org/10.1016/J.FUB.2024.100005)\n[FUB.2024.100005.](https://doi.org/10.1016/J.FUB.2024.100005) [22] G. Sordi, A. Stecchini, R. Evangelista, D. Luder, W. Li, D.U. Sauer, A. Casalegno,\nC. Rabissi, Degradation of lithium-ion batteries under automotive-like conditions:\nP2D model-based understanding and ex-situ validation, ETransportation 24 (2025)\n[100410, https://doi.org/10.1016/j.etran.2025.100410.](https://doi.org/10.1016/j.etran.2025.100410)",
      "page_num": 18,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 595
    },
    {
      "text": "[23] A123 Systems, Nanophosphate® High Power Lithium Ion Cell ANR26650M1-A. [www.a123systems.com, 2011.](http://www.a123systems.com) [24] A123 Systems, Nanophosphate® High Power Lithium Ion Cell ANR26650M1-B. [www.a123systems.com, 2012.](http://www.a123systems.com) [25] C. Rabissi, G. Sordi, A. Innocenti, A. Casalegno, Fast and reliable calibration of\nthermal-physical model of lithium-ion battery: a sensitivity-based method,\n[J. Energy Storage 59 (2023) 106435, https://doi.org/10.1016/J.](https://doi.org/10.1016/J.EST.2022.106435)\n[EST.2022.106435.](https://doi.org/10.1016/J.EST.2022.106435) [26] G. Sordi, M. Sedzik, A. Casalegno, C. Rabissi, Diagnosis of lithium-ion batteries\ndegradation with P2D model parameters identification: a case study on low\n[temperature charging, Future Batteries 4 (2024) 100006, https://doi.org/10.1016/](https://doi.org/10.1016/J.FUB.2024.100006)\n[J.FUB.2024.100006.](https://doi.org/10.1016/J.FUB.2024.100006) 17",
      "page_num": 18,
      "chunk_index": 6,
      "section_name": "Content",
      "token_count": 338
    },
    {
      "text": "_G. Sordi et al.                                                                                                                  Journal_ _of_ _Energy_ _Storage_ _152_ _(2026)_ _120653_ [27] C. Rabissi, G. Sordi, A. Innocenti, A. Casalegno, Fast and reliable calibration of\nthermal-physical model of lithium-ion battery: a sensitivity-based method,\n[J. Energy Storage 59 (2023), https://doi.org/10.1016/j.est.2022.106435.](https://doi.org/10.1016/j.est.2022.106435) [28] G. Sordi, D. Luder, W. Li, D.U. Sauer, A. Casalegno, C. Rabissi, Investigation of\ncalendar ageing of lithium-ion battery through physical models with ex-situ\n[validation, J. Power Sources 615 (2024) 235076, https://doi.org/10.1016/J.](https://doi.org/10.1016/J.JPOWSOUR.2024.235076)\n[JPOWSOUR.2024.235076.](https://doi.org/10.1016/J.JPOWSOUR.2024.235076) [29] J. Chiew, C.S. Chin, W.D. Toh, Z. Gao, J. Jia, C.Z. Zhang, A pseudo threedimensional electrochemical-thermal model of a cylindrical LiFePO4/graphite\n[battery, Appl. Therm. Eng. 147 (2019) 450–463, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.applthermaleng.2018.10.108)\n[applthermaleng.2018.10.108.](https://doi.org/10.1016/j.applthermaleng.2018.10.108) [30] Y. Huang, H. Lai, Effects of discharge rate on electrochemical and thermal\ncharacteristics of LiFePO4/graphite battery, Appl. Therm. Eng. 157 (2019),\n[https://doi.org/10.1016/j.applthermaleng.2019.113744.](https://doi.org/10.1016/j.applthermaleng.2019.113744)",
      "page_num": 19,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 495
    },
    {
      "text": "[30] Y. Huang, H. Lai, Effects of discharge rate on electrochemical and thermal\ncharacteristics of LiFePO4/graphite battery, Appl. Therm. Eng. 157 (2019),\n[https://doi.org/10.1016/j.applthermaleng.2019.113744.](https://doi.org/10.1016/j.applthermaleng.2019.113744) [31] J. Li, Y. Cheng, M. Jia, Y. Tang, Y. Lin, Z. Zhang, Y. Liu, An electrochemicalthermal model based on dynamic responses for lithium iron phosphate battery,\n[J. Power Sources 255 (2014) 130–143, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2014.01.007)\n[jpowsour.2014.01.007.](https://doi.org/10.1016/j.jpowsour.2014.01.007) [32] J. Liang, Y. Gan, M. Yao, Y. Li, Numerical analysis of capacity fading for a LiFePO4\nbattery under different current rates and ambient temperatures✰, Int. J. Heat Mass\n[Transf. 165 (2021) https://doi.org/10.1016/j.ijheatmasstransfer.2020.120615.](https://doi.org/10.1016/j.ijheatmasstransfer.2020.120615) [33] L. Zhang, C. Lyu, G. Hinds, L. Wang, W. Luo, J. Zheng, K. Ma, Parameter sensitivity\nanalysis of cylindrical LiFePO 4 battery performance using multi-physics modeling,\n[J. Electrochem. Soc. 161 (2014) A762–A776, https://doi.org/10.1149/](https://doi.org/10.1149/2.048405jes)\n[2.048405jes.](https://doi.org/10.1149/2.048405jes) [34] Y. Huang, H. Lai, Effects of discharge rate on electrochemical and thermal\ncharacteristics of LiFePO4/graphite battery, Appl. Therm. Eng. 157 (2019)\n[113744, https://doi.org/10.1016/J.APPLTHERMALENG.2019.113744.](https://doi.org/10.1016/J.APPLTHERMALENG.2019.113744)",
      "page_num": 19,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 548
    },
    {
      "text": "[34] Y. Huang, H. Lai, Effects of discharge rate on electrochemical and thermal\ncharacteristics of LiFePO4/graphite battery, Appl. Therm. Eng. 157 (2019)\n[113744, https://doi.org/10.1016/J.APPLTHERMALENG.2019.113744.](https://doi.org/10.1016/J.APPLTHERMALENG.2019.113744) [35] Y. Ye, Y. Shi, A.A.O. Tay, Electro-thermal cycle life model for lithium iron\n[phosphate battery, J. Power Sources 217 (2012) 509–518, https://doi.org/](https://doi.org/10.1016/j.jpowsour.2012.06.055)\n[10.1016/j.jpowsour.2012.06.055.](https://doi.org/10.1016/j.jpowsour.2012.06.055) [36] E. Prada, D. Di Domenico, Y. Creff, J. Bernard, V. Sauvant-Moynot, F. Huet,\nSimplified electrochemical and thermal model of LiFePO 4 -graphite Li-ion\nbatteries for fast charge applications, J. Electrochem. Soc. 159 (2012)\n[A1508–A1519, https://doi.org/10.1149/2.064209JES/XML.](https://doi.org/10.1149/2.064209JES/XML) [37] C. Edouard, M. Petit, C. Forgez, J. Bernard, R. Revel, Parameter sensitivity analysis\nof a simplified electrochemical and thermal model for Li-ion batteries aging, [J. Power Sources 325 (2016) 482–494, https://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2016.06.030)\n[jpowsour.2016.06.030.](https://doi.org/10.1016/j.jpowsour.2016.06.030) [38] J. Schmalstieg, C. Rahe, M. Ecker, D.U. Sauer, Full cell parameterization of a highpower lithium-ion battery for a physico-chemical model: part I. Physical and\nelectrochemical parameters, J. Electrochem. Soc. 165 (2018) A3799–A3810,\n[https://doi.org/10.1149/2.0321816jes.](https://doi.org/10.1149/2.0321816jes)",
      "page_num": 19,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 573
    },
    {
      "text": "[[39] J. Ong, J. Newman, Double-layer capacitance in a dual lithium ion insertion cell,](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0195)\n[J. Electrochem. Soc. 146 (1999) 4360.](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0195) [40] M. Park, X. Zhang, M. Chung, G.B. Less, A.M. Sastry, A review of conduction\n[phenomena in Li-ion batteries, J. Power Sources 195 (2010) 7904–7929, https://](https://doi.org/10.1016/j.jpowsour.2010.06.060)\n[doi.org/10.1016/j.jpowsour.2010.06.060.](https://doi.org/10.1016/j.jpowsour.2010.06.060) [[41] N. Suzuki, Y. Yamashita-Tsukada, N. Hirose, al, N. Wang, Y. Pan, A. Funabiki,](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0205)\n[M. Lnaba, Z. Ogumi, S. Yuasa, J. Otsuli, A. Tasaka, Impedance Study on the](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0205)\n[Electrochemical Lithium Intercalation into Natural Graphite Powder, 1998.](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0205) [42] D. Carlier, M. M´en´etrier, C. Delmas, 7Li MAS NMR study of electrochemically\ndeintercalated LixNi0.30Co0.70O2 phases: evidence of electronic and ionic\n[mobility, and redox processes, J. Mater. Chem. 11 (2001) 594–603, https://doi.](https://doi.org/10.1039/b006179o)\n[org/10.1039/b006179o.](https://doi.org/10.1039/b006179o)",
      "page_num": 19,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 521
    },
    {
      "text": "[43] J. Marzec, J.P. Przewoz’nik, J. Molenda, D.R. Simon, E.M. Kelder, J. Schoonman,\nConduction mechanism in operating a LiMn_2O_4 cathode, Solid State Ion. 146\n[(2002) 225–237. www.elsevier.com/locate/ssi.](http://www.elsevier.com/locate/ssi) [44] L.O. Valøen, J.N. Reimers, Transport properties of LiPF[sub 6]-based Li-ion battery\n[electrolytes, J. Electrochem. Soc. 152 (2005) A882, https://doi.org/10.1149/](https://doi.org/10.1149/1.1872737)\n[1.1872737.](https://doi.org/10.1149/1.1872737) [[45] S.W. Han, Transport and Kinetic Phenomena Linked to Power Performance of](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0225)\n[Lithium-Ion Batteries, University of Michigan, 2014.](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0225) [46] Y.-H. Chen, C.-W. Wang, G. Liu, X.-Y. Song, V.S. Battaglia, A.M. Sastry, Selection of\nconductive additives in Li-ion battery cathodes, J. Electrochem. Soc. 154 (2007)\n[A978, https://doi.org/10.1149/1.2767839.](https://doi.org/10.1149/1.2767839) [[47] Ajit Kumar Dutta, Electrical conductivity of single crystals of graphite, Phys. Rev.](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0235)\n[90 (1952).](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0235) [[48] Comsol, Thermal Modeling of a Cylindrical Lithium-Ion Battery in 2D. www.comso](http://www.comsol.com/trademarks)\n[l.com/trademarks, 2021.](http://www.comsol.com/trademarks)",
      "page_num": 19,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 528
    },
    {
      "text": "[[48] Comsol, Thermal Modeling of a Cylindrical Lithium-Ion Battery in 2D. www.comso](http://www.comsol.com/trademarks)\n[l.com/trademarks, 2021.](http://www.comsol.com/trademarks) [[49] Michael Heβ, Kinetics and Stage Transitions of Graphite for lithium-Ion Batteries,](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0245)\n[ETH Zurich, 2013.](http://refhub.elsevier.com/S2352-152X(26)00317-8/rf0245) 18",
      "page_num": 19,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 144
    }
  ],
  "total_chunks": 56,
  "created_at": "2026-02-04 14:04:56"
}