{
  "filename": "1-s2.0-S2666546825002010-main.pdf",
  "chunks": [
    {
      "text": "[Energy and AI 24 (2026) 100669](https://doi.org/10.1016/j.egyai.2025.100669) Contents lists available at [ScienceDirect](https://www.elsevier.com/locate/egyai)",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 57
    },
    {
      "text": "journal homepage: [www.elsevier.com/locate/egyai](https://www.elsevier.com/locate/egyai)",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "Energy and AI",
      "token_count": 30
    },
    {
      "text": "Robin Saam [a][,][b], [∗], Ludwig Hagen Letzig a, Jens Grabow a, Ralf Benger b,c, Ines Hauer b,c a _Volkswagen_ _AG, Gifhorner_ _Straße_ _180, Brunswick, 38112, Lower_ _Saxony, Germany_\nb _Clausthal_ _University_ _of_ _Technology,_ _Institute_ _of_ _Electrical_ _Power_ _Engineering_ _and_ _Energy_ _Systems, Leibnizstraße_ _28, Clausthal-Zellerfeld, 38678, Lower_\n_Saxony, Germany_\nc _Clausthal_ _University_ _of_ _Technology,_ _Research_ _Center_ _Energy_ _Storage_ _Technologies, Am_ _Stollen_ _19A, Goslar, 38640, Lower_ _Saxony, Germany_ H I G H L I G H T S - Regional usage differences significantly\nimpact battery state of health loss. - Predict vehicle battery age and mileage\nat regulatory compliance boundaries. - Integrated data-driven framework links\nbattery aging to real-world usage patterns. - Clustering identifies vehicle groups with\ndistinct battery degradation behaviors. A R T I C L E I N F O _Keywords:_\nLithium-ion batteries\nService life\nData analytics\nMachine learning\nFleet data\nElectric vehicle G R A P H I C A L A B S T R A C T A B S T R A C T _Battery_ _Electric_ _Vehicle_ s (BEVs) face stringent regulatory requirements for battery durability, with Euro 7 and\n_Advanced_ _Clean_ _Cars_ _II_ (ACCII) regulations mandating _State_ _of_ _Health_ (SoH) thresholds of 70 % after 8 years or\n160 _,_ 000 km and 10 years or 240 _,_ 000 km, respectively. Current testing protocols rely on homogeneous profiles\nthat inadequately represent real-world usage variability, creating recall and over-engineering risks. This paper\naddresses this gap by proposing a data-driven framework linking usage behavior patterns with battery aging\ndynamics to identify representative test profiles. The framework consists of three integrated steps: (1) predicting battery age and usage at regulatory\nboundaries through mathematical formulation, (2) estimating SoH using machine learning models including\nensemble methods and statistical approaches, and (3) clustering vehicles into groups with homogeneous aging\nbehavior. Unlike existing approaches, it accounts for real-world heterogeneity across diverse usage patterns\nwithout assuming predefined load profiles.",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "Battery aging and behavioral pattern identification: A fleet analytics framework for regulatory compliance testing",
      "token_count": 552
    },
    {
      "text": "The framework consists of three integrated steps: (1) predicting battery age and usage at regulatory\nboundaries through mathematical formulation, (2) estimating SoH using machine learning models including\nensemble methods and statistical approaches, and (3) clustering vehicles into groups with homogeneous aging\nbehavior. Unlike existing approaches, it accounts for real-world heterogeneity across diverse usage patterns\nwithout assuming predefined load profiles. Validation used a large-scale Volkswagen AG fleet of roughly 850,000 vehicles across five countries (China,\nGermany, Italy, Norway, United States). Analysis across regions demonstrates how usage behavior diversity\nimpacts battery aging, validating the need for behavioral pattern-aware methodologies. The framework was ∗ Corresponding author at: Volkswagen AG, Gifhorner Straße 180, Brunswick, 38112, Lower Saxony, Germany. _E-mail_ _address:_ [robin.saam@volkswagen.de](mailto:robin.saam@volkswagen.de) (R. Saam). [https://doi.org/10.1016/j.egyai.2025.100669](https://doi.org/10.1016/j.egyai.2025.100669)\nReceived 12 September 2025; Received in revised form 25 November 2025; Accepted 12 December 2025 Available online 22 December 2025\n[2666-5468/© 2026 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY license ( http://creativecommons.org/licenses/by/4.0/ ).](http://creativecommons.org/licenses/by/4.0/)",
      "page_num": 2,
      "chunk_index": 3,
      "section_name": "Battery aging and behavioral pattern identification: A fleet analytics framework for regulatory compliance testing",
      "token_count": 335
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ **1.** **Introduction** _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ complemented by _Center_ _for_ _Advanced_ _Life_ _Cycle_ _Engineering_ (CALCE) battery cycling validation (192 cells, 24\ntest groups), achieving Homogeneity 0.9157 and Completeness 0.9509. The modular design enables future enhancements including multi-view clustering and advanced SoH\nprediction models. This framework provides manufacturers a systematic approach to regulatory compliance\nwhile reducing unnecessary testing and mitigating over-engineering risk. Batteries have become indispensable in modern life, as highlighted\nby Iser and Schadwinkel [1]. They power everyday handheld devices\nsuch as smartphones, enable the integration of renewable energy into\npower grids [2], and serve as the core energy source for BEVs [3]. Recent studies by Fichtner et al. [3] and Passerini et al. [4] emphasize that\nfuture battery development must address multiple challenges, including\nimprovements in ‘‘ _energy_ _density[...][,_ _R.S.]_ _fast_ _charging_ _[capabilities,_\n_R.S.][...]_ _sustainability_ _of_ _resources,_ _the_ _recyclability_ _of_ _components,_ _cycle-_\n_and_ _calendar_ _lifetime_ _of_ _the_ _system,_ _safety_ _and_ _costs_ ’’ [3, p. 4]. These requirements are particularly critical for automotive applications, where\ndiverse usage patterns and environmental conditions influence battery\nperformance. The global demand for batteries is projected to rise significantly\nin terms of overall battery capacity, driven by the electrification of\ntransport and renewable integration. According to Passerini et al. [4]\nthe annual growth rate for batteries since 2010 is 30 % with smaller\nannual growth rates to be estimated by 2030 onward. Fichtner et al. [3] highlight the role of automotive applications and upcoming battery\nchemistries where a shift to post lihtium-ion batteries is expected.\nAdditionally, the International Energy Agency forecasts an ongoing\nincrease in BEVs in the upcoming years [5]. This growing diversity\nin battery chemistries combined with an increase in demand complicates product comparison for consumers and motivates legislators to\nestablish harmonized standards.",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 514
    },
    {
      "text": "[3] highlight the role of automotive applications and upcoming battery\nchemistries where a shift to post lihtium-ion batteries is expected.\nAdditionally, the International Energy Agency forecasts an ongoing\nincrease in BEVs in the upcoming years [5]. This growing diversity\nin battery chemistries combined with an increase in demand complicates product comparison for consumers and motivates legislators to\nestablish harmonized standards. In the automotive sector, two major regulatory frameworks are\nshaping battery lifetime requirements: the Euro 7 regulation by the European Commission [6] in the European Union and the ACCII regulation by the _California_ _Air_ _Resources_ _Board_ (CARB) [7] in the United\nStates. Both aim to ensure durability and reliability of traction batteries\nin BEVs, setting minimum thresholds for the remaining service life,\ncommonly expressed as SoH. Inside this paper, the capacity-based\ndefinition of SoH will be used, as recommended by the United Nations [8], to ensure consistency with international standards and regulatory frameworks. Furthermore, the capacity-based SoH will simply\nbe referred to as SoH throughout this paper. The ACCII regulation will apply from model year 2026, as outlined\nin the official CARB documentation [7], with detailed compliance\nrequirements specified in the technical guidelines [9]. Despite similar\nminimum SoH requirements (70 %), the regulations differ in their durability targets: Euro 7 mandates compliance after 8 years or 160 _,_ 000 km,\nwhereas ACCII requires 10 years or 240 _,_ 000 km. These thresholds will\nbe further referred to as _regulatory_ _boundaries_ . Furthermore, by 2030,\nACCII will tighten its requirement to 80 % SoH. Non-compliance can\ntrigger recalls if more than 10 % of a fleet fails to meet these limits,\nas stated in CARB’s enforcement policy [10] and confirmed by international regulatory guidelines [8]. Consequently, SoH requirements are\nclosely linked to the _End_ _of_ _Warranty_ (EoW) criteria defined by manufacturers (e.g., Volkswagen AG [11] or Tesla, Inc. [12]), which often\nalign with regulatory thresholds. For instance, Volkswagen specifies an\nEoW capacity of 70 % [11]. To the best of current knowledge, existing\nregulations do not provide exemptions for specific usage patterns, such\nas frequent fast charging. However, the SoH is influenced by both the age of the battery and its\nusage patterns, which are directly linked to vehicle operation, making\ncompliance under all circumstances challenging for manufacturers. Previous studies have examined the relationship between usage and\nbattery aging from different perspectives. Broussely et al. [13] provided",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 572
    },
    {
      "text": "Previous studies have examined the relationship between usage and\nbattery aging from different perspectives. Broussely et al. [13] provided foundational insights into electrochemical degradation mechanisms,\nwhile Keil et al. [14] focused on aging differences caused by temperature and cell chemistry. In contrast, Vermeer et al. [15] offered a\ncomprehensive review of how usage parameters impact battery aging\nand interact with each other. More recently, von Bülow [16] analyzed\nthe variability of aging in real-world BEV fleet conditions over full\nequivalent cycles. Many of these insights, however, were obtained\nunder controlled laboratory conditions. To mitigate the risk of recalls despite the large variety of influencing factors, batteries must undergo rigorous testing. Current testing\nprotocols typically rely on homogeneous profiles that fail to represent\nreal-world variability [17]. For example, Schreiber et al. [18] expanded\non these findings by detailing aging mechanisms occurring under standardized profiles, while Geslin et al. [19] emphasized that such profiles\nhinder accurate lifetime predictions. Furthermore, Saam et al. [20]\ndemonstrated that real-world usage profiles differ substantially across\nuser percentiles, highlighting the need for more representative testing\napproaches. Nazari et al. [21] provided an overview of conducted research using\ndifferent clustering algorithms for across use cases to separate BEVs in\ngroups. Forte et al. [22] additional provides an overview of real-world\ncharging datasets. Nevertheless, to the best of current knowledge, no\nexisting methodology aims to reduce the overall variability of usage\nbehaviors and prioritize testing on key groups based on predictions at\nregulatory boundaries. To address this gap, a workflow is introduced\nthat divides usage behaviors into subgroups according to their influence\non battery aging. This enables engineers to select representative behaviors from relevant user groups to ensure compliance with automotive\nregulations. Depending on the application, these groups may represent\neither critical usage patterns or the majority of typical users. To the best\nof current knowledge, no comparable regulations have been established\nfor other battery applications [23], although implicit requirements\npersist through existing quality standards. Consequently, the proposed\nworkflow can be meaningfully applied to other battery domains. In general, the workflow consists of three main steps:",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 470
    },
    {
      "text": "In general, the workflow consists of three main steps: This study introduces a data-driven framework that predicts intersections with regulatory boundaries without relying on predefined\nhistorical load profiles. It compares multiple SoH estimation methods,\nsuch as RFR and nonlinear optimization, for diverse usage scenarios. KMeans clustering then categorizes vehicles into distinct aging groups,\nwith clustering performance rigorously evaluated. The goal is not to\nclaim superiority of each step but to demonstrate how integrating these\ncomponents extracts actionable insights and derives representative test\nparameters. While based on established techniques, the novelty lies in\nsystematically integrating regulatory boundary prediction, SoH estimation, and behavioral clustering into a modular, scalable pipeline. This\nunified workflow enables continuous data flow, cross-validation, and\ninterpretability, directly connecting operational behaviors with battery\naging and regulatory compliance. Integration enhances robustness and\nprovides flexibility to adapt to evolving data and regulatory demands,\ndistinguishing this method from standalone approaches. This work\nfocuses on the methodological integration of established techniques\nrather than providing a fully implemented software framework. 1. Predicting _battery_ _age_ _𝑡_ and _cumulative_ _usage_ _𝑢_ (e.g., mileage or cycles) at the intersection with regulatory boundaries.\n2. Estimating SoH at the intersection point.\n3. Clustering this information to identify representative user groups with similar aging behavior. 2",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 286
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ Regarding the structure of the paper, Section 2 provides an overview\nof relevant literature, covering approaches for predicting intersections\nwith regulatory boundaries, clustering of BEV usage data, and SoH\nestimation methods. Section 3 introduces the fleet dataset on which the\nproposed framework was developed and tested, and illustrates usage\ndifferences across five countries: China, Germany, Italy, Norway, and\nthe United States. Additionally, the openly available battery dataset\nprovided by CALCE [24] is presented. This dataset is used as a complementary source for steps where fleet data cannot be disclosed due\nto confidentiality constraints. It was selected for its variety of test\ncases [24], which resemble diverse real-world usage behaviors, and\nits strong representation in the scientific community, as highlighted in\nliterature reviews by Hasib et al. [25], dos Reis et al. [26], and Tan\net al. [27]. Section 4 elaborates on how usage behavioral patterns impact aging,\nspecifically showcasing SoH-loss differences across the five countries\nintroduced in Section 3. Section 5 details the proposed framework,\nincluding the estimation of intersections with regulatory boundaries,\ncalculation of SoH at these boundaries, and identification of representative usage groups. Each step of the framework is illustrated and\nvalidated using both the fleet dataset and the CALCE dataset. Section 6 discusses current limitations and emphasizes the modular design of the framework, which allows individual steps to be replaced\nby improved methods without altering the overall structure. Finally,\nSection 7 provides a summary and conclusion. **2.** **Related** **work** This section reviews existing research relevant to the proposed\nframework. It is organized into three areas: approaches for predicting\nbattery age and cumulative usage at regulatory boundaries, clustering\ntechniques applied to BEV usage data, and methods for estimating\nbattery SoH. _2.1._ _Predicting_ _intersection_ _with_ _regulatory_ _boundaries_",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 417
    },
    {
      "text": "_2.1._ _Predicting_ _intersection_ _with_ _regulatory_ _boundaries_ Predicting battery age _𝑡_ and cumulative usage _𝑢_ at regulatory boundaries has been addressed through various statistical and machine learning approaches. Geisser [28] introduced baseline statistical methods for\nforecasting problems with repeated observations, which can be adapted\nto vehicle lifetime prediction. These approaches typically assume a\ncommon mechanism underlying user behavior, such as an average daily\nmileage with deviations for holidays or day-dependent circumstances.\nWhile such assumptions simplify modeling, they may not fully capture\nreal-world variability. Similarly, linear regression offers an alternative\nfor estimating the intersection point. However, such models primarily\nrely on historical averages and long-term trends, making them insensitive to changes in driving behavior. For example, if the owner begins\ndriving substantially more kilometers per day than before, the regression model will fail to adequately adjust to this shift, as it interprets\nrecent deviations as random noise rather than a structural change in\nusage patterns. _2.2._ _Clustering_ _BEV_ _usage_ _behavioral_ _data_ Clustering is a widely used technique for grouping entities based\non similarity [29]. Algorithms can be categorized into partitioning,\nhierarchical, density-based, and other types, as discussed in the comprehensive survey by Xu and Tian [30], which lists a variety of clustering\nalgorithms and their use cases. A more recent review by Yin et al. [31] provides a concise overview of different clustering topics and\nconfirms these categorizations. Among these, K-Means [32] and Fuzzy\nC-Means [33], as originally proposed in their respective works, are\nwidely recognized clustering methods and are frequently applied in\nelectric vehicle contexts. _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Charging** **Behavior** **and** **Infrastructure** **Planning:** Clustering has\nbeen widely applied to analyze charging patterns and optimize infrastructure planning. For instance, Xiong et al. [34] combined clustering\nwith machine learning to predict day-ahead parking and charging of\nBEVs, enabling improved load forecasting. Similarly, Märtz et al. [35]\nidentified user groups with similar charging behavior using K-Means,\nwhile Yang et al. [36] introduced a Fuzzy C-Means approach to handle\nuncertainty in charging patterns. Forte et al. [37] demonstrated how\nclustering charging data can optimize planning for charge point operators and energy distribution system operators. Infrastructure-related\nstudies include Bui et al. [38], who applied clustering to reduce energy\nimports during high-price periods via vehicle-to-vehicle load balancing,\nand Abdullahi et al. [39], who used clustering to determine optimal\nlocations for new charging stations.",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "**Driving** **Profiles** **and** **Behavioral** **Analysis:** Driving profile clustering has also been explored: Fotouhi and Montazeri-Gh [40] derived\nmicro-trip-based test profiles for cars, and Yuhui et al. [41] extended\nthis approach to buses. Balaram et al. [42] focused on clustering\nprofiles to identify similarities in stay-at-home time, _Depth_ _of_ _Discharge_\n(DoD), and daily mileage. **Battery** **State** **and** **Second-Life** **Applications:** Clustering plays a\ncritical role in battery state estimation and second-life applications. Li\net al. [43] grouped cells into homogeneous modules based on performance, Ran et al. [44] clustered batteries for second-life applications, Zhang et al. [45] used _Electrochemical_ _Impedance_ _Spectroscopy_\n(EIS) features to classify performance, and Wang et al. [46] applied\nclustering to detect abnormal degradation for safe operation. Recent\nwork has extended clustering to data enrichment and second-life applications. For example, Zafar et al. [47] identified similar groups across\ntwo BEV charging datasets, one data-rich and one data-sparse, and then\napplied transfer learning to improve forecasting accuracy for the sparse\ndataset. Likewise, Liu et al. [48] proposed a framework for grouping batteries for second-life applications by using EIS and _Incremental_\n_Capacity_ _Analysis_ (ICA) to form homogeneous clusters. Comprehensive\nreviews of clustering algorithms and their applications in EV contexts\nare provided by Nazari et al. [21] and Forte et al. [22]. **Validation** **of** **Clustering** **Results:** Evaluating clustering performance is essential to ensure meaningful groupings. Two main validation approaches are commonly distinguished: _internal_ _validation_ and\n_external_ _validation_ [49]. Internal validation relies on metrics derived\nfrom the clustering inputs, such as cohesion and separation, whereas\nexternal validation compares clustering results against independent\nground truth labels. In practice, ground truth labels are often unavailable in large-scale fleet datasets, which limits the applicability of\nexternal validation and makes internal validation the default choice in\nmany studies. Liu et al. [50] provides an overview of eleven internal\nvalidation metrics, including the Calinski-Harabasz index, Silhouette\nindex, and Davies–Bouldin index, while Yin et al. [31] summarizes\ncommonly used external validation metrics. It should be noted that\nthe terms _index_ and _score_ are sometimes used interchangeably in the\nliterature. _2.3._ _State_ _of_ _health_ _estimation_ _approaches_",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 580
    },
    {
      "text": "_2.3._ _State_ _of_ _health_ _estimation_ _approaches_ Battery SoH estimation is critical for predicting performance and\nlifetime. Early approaches relied on physics-based models and statistical methods. For example, Li et al. [51] proposed a framework capable\nof predicting capacity and internal resistance trajectories from early-life\ndata, while O’Kane et al. [52] demonstrated the use of _Python_ _Battery_\n_Mathematical_ _Modelling_ (PyBaMM) for degradation modeling. **Machine** **Learning** **and** **Deep** **Learning** **Models:** Recent reviews [53] summarize common machine learning approaches such as linear\nregression, support vector regression, _Multilayer_ _Perceptron_ s (MLPs),\nand recurrent architectures like _Long_ _Short_ _Term_ _Memory_ (LSTM). The\nconcept of _Recurrent_ _Neural_ _Network_ s (RNNs) was first introduced\nby Rumelhart et al. [54], forming the basis for sequence modeling. 3",
      "page_num": 4,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 230
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ Building on this, Hochreiter and Schmidhuber [55] proposed the LSTM\narchitecture to address the vanishing gradient problem inherent in\ntraditional RNNs. Later, Cho et al. [56] introduced _Gated_ _Recurrent_ _Unit_\n(GRU) as a simplified alternative to LSTMs, reducing computational\ncomplexity while maintaining performance. Recent advancements have focused on improving these architectures for battery applications. For example, Arbaoui et al. [57] enhanced LSTM models for SoH prediction, achieving mean squared\nerrors of approximately 0.2 to 0.4 on high-frequency datasets. Similarly, Lee et al. [58] introduced a framework that extracts features from\ntime-series data or ICA to train machine learning architectures such as\nLSTM and Transformer models for remaining useful life prediction. **Feature** **Engineering** **and** **Hybrid** **Approaches:** In addition, Li\net al. [59] proposed a method based on features derived from ICA,\nvoltage discharge curves, and capacity degradation curves to estimate\nSoH, followed by an LSTM model for remaining useful life prediction.\nBeyond prediction, Zou et al. [60] applied machine learning to classify\ncells after production based on quality and used formation data for\nlifetime prediction. **Alternative** **and** **Non-Parametric** **Methods:** An alternative approach involves constructing a reference aging surface across a threedimensional space defined by battery age _𝑡_, cumulative usage _𝑢_, and\nSoH. While such surfaces are typically derived from laboratory measurements, they can also be estimated from fleet data when lab data\nis unavailable. Fleet-derived surfaces capture the variability necessary\nto represent real-world usage behaviors. To achieve this, RFRs can\nbe trained, combining multiple regression trees for high-dimensional\nregression tasks [61]. Random Forests have been successfully applied\nin domains such as household price prediction [62] and macroeconomic forecasting [63]. For a detailed introduction, see Breiman [61]. Alternatively, custom parameterized functions can be fitted using\nstandard non-linear optimization algorithms for constrained problems,\nas introduced by Byrd et al. [64]. _2.4._ _Motivation_ _for_ _the_ _proposed_ _framework_ While these studies provide valuable insights, they often assume\nhomogeneous usage patterns or rely on laboratory data with specialized measurements, which limits their applicability to large-scale, realworld fleets. Addressing these gaps motivates the data-driven framework introduced in this paper. By systematically integrating regulatory\nboundary prediction, SoH estimation, and behavioral clustering into\na modular, scalable pipeline, the proposed workflow connects operational behaviors with battery aging and regulatory compliance,\nenabling the derivation of test parameters and the identification of\ncritical usage patterns.",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 591
    },
    {
      "text": "**3.** **Description** **of** **the** **dataset** The dataset on which the methodology is tested later on is the\nanonymized fleet data of BEVs produced by Volkswagen AG. It is\nprovided by the vehicle manufacturer and consists of electric vehicles\nthat are based on the _Modularer_ _E-Antriebs_ _Baukasten_ (MEB) vehicle architecture, which has been in production since late 2019 [65]. The fleet\nitself comprises more than one million vehicles worldwide, including\nvarious types ranging from hatchbacks like the _ID.3_ to sedans like the\n_ID.7_ and minibuses/vans like the _ID._ _Buzz_ . However, the original dataset does not include all vehicles from\nthe fleet due to data availability constraints. After applying the preprocessing steps described in Section 5, which involve filtering out\ncontextual anomalies and ensuring data consistency, approximately\n850,000 vehicles remain for analysis. This processed dataset will be\nfurther referenced as  . Details on the fleet composition by vehicle type and year of production/sale can be found in the Volkswagen AG’s annual reports (Annual\nreport 2020: [66], 2021: [67], 2022: [68], 2023: [69]). Unfortunately, _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Table** **1**\nExemplary aggregated data matrix representing the retention period (in days)\nwithin unique combinations of SoC and temperature intervals. Each vehicle\ngenerates multiple such matrices during runtime, differing in their row and\ncolumn labels as well as the type of data stored in each cell. For instance, other\nmatrices may capture the frequency of specific Start and End SoC combinations\nduring charging events (see Table 8 in the Appendix), or the distribution of SoC\nchanges ( _𝛥_ SoC) during continuous charge/discharge processes while driving\n(see Table 9 in the Appendix). Retention period days SoC in % _<_ 10 10–50 50–90 _>_ 90 Temperature in [◦] C _<_ −10 _𝐴𝑖_ =0 _,𝑗_ =0 ... ... _𝐴𝑖_ =0 _,𝑗_ =3\n−10–20 ⋮ ⋮ ⋮ ⋮\n20–40 ⋮ ⋮ ⋮ ⋮ _>_ 40 _𝐴𝑖_ =3 _,𝑗_ =0 ... ... _𝐴𝑖_ =3 _,𝑗_ =3",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "_>_ 40 _𝐴𝑖_ =3 _,𝑗_ =0 ... ... _𝐴𝑖_ =3 _,𝑗_ =3 the 2024 report [70] does not provide a detailed breakdown by propulsion and vehicle type, and the 2025 report has not yet been released.\nIn general, vehicles in the fleet have been sold to over 50 countries\nworldwide, resulting in diverse usage patterns across regions. To illustrate these differences, Fig. 1 highlights operating variations\namong five representative countries: China, Germany, Italy, Norway,\nand the United States for the 75th-percentile of all customers within\neach respective country. Notable regional variations in usage include,\nfor example, an average C-rate of 0 _._ 6 C in China compared to 0 _._ 3 C in\nGermany. Similar disparities occur in other parameters, such as DC\ncharging frequency (62 % for Chinese users versus 20 % for German\nusers) and daily mileage (66 km∕d versus 48 km∕d). Additional information on the fleet dataset is provided by Saam\net al. [20], including vehicle type composition, customer-selected battery sizes, and country representation. That work also reports operating differences across the same five countries for the 25th- and\n50th-percentiles. These regional differences in usage behavior, such as daily mileage\nand charging preferences, underscore the value of vehicle-generated\ndata for understanding real-world operational patterns. In this work,\n_usage_ _behavior_ refers to operational practices and conditions, including\ncharging habits, SoC ranges, and temperature exposure, among other\nfactors. A detailed discussion of behavioral patterns and their influence\non aging is provided in Section 4. To manage local storage constraints and enable meaningful analysis,\nVolkswagen aggregates raw vehicle data into standardized matrices\nduring runtime. The fleet dataset  consists of _𝑁_ vehicles, each generating multiple aggregated matrices with different formats. Each matrix\ntypically represents either a single parameter or a pair of parameters,\nallowing for efficient analysis of vehicle usage patterns. The most relevant parameters included are charge/discharge current, temperature,\nand SoC. Each matrix has a fixed shape of _𝐼_ × _𝐽_ bins across all vehicles.\nIn this work, a single matrix type is considered across all _𝑁_ vehicles,\nresulting in a three-dimensional tensor:  ∈ R _[𝐼]_ [×] _[𝐽]_ [×] _[𝑁]_",
      "page_num": 5,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 542
    },
    {
      "text": " ∈ R _[𝐼]_ [×] _[𝐽]_ [×] _[𝑁]_ where _𝐼_ and _𝐽_ denote the number of bins for the two selected parameters. This structure enables efficient fleet-wide analysis while preserving per-vehicle granularity. One example of such a matrix, and the one\nused in this paper, is shown in Table 1. In this case, one parameter\n(e.g., SoC) defines the columns and another (e.g., temperature) defines\nthe rows. These axes are divided into value ranges, and each cell\n_𝐴𝑖,𝑗_ contains the retention period in days for the corresponding SoC\nand temperature range. Alongside the matrix data, each protocol also\ncaptures key metadata, most notably the vehicle’s age and total mileage\nat the time of data retrieval. Data for each vehicle is retrieved manually during workshop visits,\nwhich occur at least every 741 days in 99 % of cases, close to the recommended maximum interval between check-ups of 730 days [71]. The 4",
      "page_num": 5,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 236
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **1.** Differences in the 75th-percentile of customer usage patterns across China, Germany, Italy, Norway and the United States, based on fleet data from\nVolkswagen AG. data retrieved during one visit is referred to as a _protocol_ . Due to this\nmanual retrieval process, no fixed sampling rate is applied, resulting\nin inhomogeneous time intervals both within individual vehicles and\nacross the fleet. Due to the sensitivity of the fleet dataset, some steps of the methodology are evaluated using an additional, openly available battery lifetime dataset from CALCE [24]. This dataset contains accelerated cycle\nlife testing data for 192 different _𝐿𝑖𝐶𝑜𝑂_ 2-graphite pouch cells with a\ncapacity of 3 _._ 36 Ah. The cells were divided into 24 distinct groups, each\nwith different test parameters, and each group consists of eight newly\nmanufactured unique cells. Various ambient temperatures ranging from\n10 °C to 60 °C were applied. Discharge C-rates varied between 0 _._ 7 C and\n2 C, while constant current charging was typically performed at 1 _._ 5 C\nacross most of the SoC range. The charge process was terminated in\nthe constant voltage phase once the current dropped to either _𝐶_ ∕5 or\n_𝐶_ ∕40. In 99 % of cases, the sampling interval is below 29 min. In contrast to the Volkswagen AG dataset, the CALCE dataset is\nprovided in a time-series format, including parameters such as test\ntime, applied current, charged and discharged capacity, and a cycle\ncounter. The dataset is split into multiple individual files spanning\nacross different DUTs and test cycles. Each DUT is assigned a unique\nID composed of the test group and the cell number: DUT ID ∶ test group − cell number For further details on the dataset and the experimental design,\nplease refer to Pecht and Osterman [24]. In the following sections, this\ndataset will be referred to as  and serves as a benchmark for validating\nthe proposed methodology under controlled aging conditions. While\nboth datasets,  and , are used to evaluate the proposed methodology,\nthe interpretation and application of battery age _𝑡_ and cumulative usage\n_𝑢_ differ depending on the dataset context. Table 2 summarizes these\ndifferences. **Table** **2**\nOverview of the differences in the usage of the battery age _𝑡_ and the cumulative\nusage _𝑢_ depending on the dataset.",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "**Table** **2**\nOverview of the differences in the usage of the battery age _𝑡_ and the cumulative\nusage _𝑢_ depending on the dataset. Volkswagen AG CALCE dataset \nfleet dataset  **4.** **Influence** **of** **usage** **behavior** **on** **battery** **aging** Battery aging is strongly influenced by usage behavior, as demonstrated in various studies. For instance, von Bülow [16] provides an\noverview of stressors, defined as combinations of operational conditions that induce or accelerate aging. Vermeer et al. [15] offers\na comprehensive review of aging causes, mechanisms, degradation\nmodes, effects, and their interdependencies. Keil et al. [14] conducted\ncalendar aging tests at temperatures ranging from 10 °C to 55 °C and\nacross different SoCs, demonstrating that high storage temperatures\nsignificantly accelerate aging. Broussely et al. [13] contributed foundational insights into the distinction between cyclic and calendar aging\nmechanisms. Schreiber et al. [18] explored the impact of different\ndriving profiles, such as highway versus commuter scenarios, on longterm battery health, showing that highway profiles with higher C-rates\ncan lead to up to four times faster degradation. Additionally, Geslin\net al. [19] highlighted increased longevity when dynamic cycling is\napplied compared to constant current profiles. Fig. 2 illustrates several\nusage-specific parameters and their connection to internal battery aging\nphenomena. The aging causes shown in Fig. 2 affect battery degradation in\ndifferent ways. It is important to note that aging processes are also\ninfluenced by cell chemistry and geometry. For example, Szczuka et al. CALCE dataset  Battery age _𝑡_ Years Days\nCumulative usage _𝑢_ Mileage in km Cycles 5",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 405
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **2.** Overview of usage specific parameters and their influence on battery aging causes based on Vermeer et al. [15]. [72] demonstrated how different cell chemistries and vendors impact\ndegradation, while Dubarry et al. [73] analyzed the influence of chemistry on calendar aging. Arunachala [74] investigated cell geometry\nand sizing, showing that larger cells accelerate aging. However, these\naspects are not further explored in this work, as they are not directly\ninfluenced by customer usage behavior. Independent of chemistry and\ngeometry, battery aging can be broadly categorized into two types:\ncalendar aging, which occurs over time (e.g., when the vehicle is\nparked), and cyclic aging, which results from active usage. Calendar\naging typically dominates due to long idle periods, as Nobis and Kuhnimhof [75] reported an average daily driving distance of only 40 km per\nvehicle in Germany. Saam et al. [20] found that among five countries,\nChinese customers in the 75th-percentile drive the most (66 km∕d),\nwhile German customers drive the least (48 km∕d). In contrast, cyclic\naging is heavily influenced by driving behavior. Schreiber et al. [18]\ndemonstrated this by comparing six distinct driving profiles, showing\nthat highway scenarios with higher C-rates lead to significantly faster\ndegradation. Additionally, Guo and Chen [76] showed that the DoD\nplays a critical role in battery longevity, with higher DoDs leading to\nshorter service life. Building on these observations, usage behavior emerges as a key\ndriver of aging variability. In real-world applications, a wide variety of\nusage behaviors, or behavioral patterns, exists, each influencing battery\ndegradation in distinct ways. In the context of this work, behavioral\npatterns refer to specific operational practices and conditions under\nwhich a vehicle is used. These include, for example, DoD, ambient\ntemperature exposure, and charging habits (e.g., fast vs. slow charging).\nEach of these parameters contributes to the rate and nature of battery\ndegradation, particularly in terms of capacity fade over time. The combination of these parameters constitutes a unique behavioral pattern.\nFig. 3 illustrates the impact of usage differences (as shown in Fig. 1) on\nbattery aging. It can be observed that vehicles in China exhibit slower\ndegradation compared to the overall fleet, whereas vehicles in Italy and\nthe United States experience an accelerated decline in SoH.",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 558
    },
    {
      "text": "Given that capacity fade is a key indicator of battery aging, these\nusage-specific parameters are critical in determining whether a vehicle\nremains within the SoH thresholds mandated by regulatory authorities.\nAccordingly, behavioral patterns can be broadly categorized into two\ngroups: those that are relevant for a recall and those that are not.\nPatterns relevant for a recall are typically associated with accelerated\naging, potentially causing a vehicle to exceed SoH thresholds before\nreaching its expected service life or mileage. The following condition outlines the scenarios in which a vehicle either complies with or\nviolates the regulatory requirements: ComplyRegulation =Indicates if a single vehicle has any relevance for a recall\nSoHRegulation =SoH threshold given by the respective regulation which is currently at 70 % for the Euro\n7 and the ACCII\nSoHVehicle =SoH of vehicle _n_\nMileageVehicle =Traveled mileage of vehicle _n_\nMileageRegulation =Threshold mileage by the respective regulation (e.g. 160 _,_ 000 km for Euro 7 and\n240 _,_ 000 km for ACCII)\nAgeVehicle =Age of vehicle _n_\nAgeRegulation =Threshold age by the respective regulation\n(e.g. 8 years for Euro 7 and 10 years for ACCII) To reduce the likelihood of a fleet-wide recall, vehicle manufacturers must design battery testing procedures that accurately reflect\nreal-world usage. Currently, the standard approach involves applying\nfast charging and discharging profiles, commonly referred to as the\n‘‘highway scenario’’ by Lienkamp [17] and Schreiber et al. [18]. This\nmethod is the fastest way to simulate the energy throughput required\nto meet regulatory mileage targets while still adhering to the technical\nlimitations of the battery cells. However, this approach has limitations.\nIn real-world conditions, such as those represented by the ‘‘commuter\nscenario’’ in the same studies, the service life of batteries is significantly\noverachieved. According to Lienkamp [17] and Schreiber et al. [18],\nthe difference in degradation rates between these scenarios can exceed\na factor of four. In their experiments, batteries reached a SoH of 70 %\nafter 375 _,_ 000 km in the highway scenario, whereas linear extrapolation\npredicts the same SoH threshold would only be reached after approximately 1.58 million km in the commuter scenario. Similar findings\nwere reported by Geslin et al. [19], who observed up to a 38 % difference in degradation between constant current profiles and so-called if SoHVehicle _<_ SoHRegulation **∧** MileageVehicle ≤ MileageRegulation **∧** ComplyRegulation = where: ⎧\n⎪\n⎪\n⎨\n⎪\n⎪⎩ no",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 599
    },
    {
      "text": "no AgeVehicle ≤ AgeRegulation\nyes if otherwise 6",
      "page_num": 7,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 12
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **3.** Impact of regional usage patterns on battery aging across China, Germany, Italy, Norway, and the United States, based on fleet data from Volkswagen\nAG. _dynamic_ _cycling_ . This corresponds to a mileage difference of roughly\n314 _,_ 000 km. Their study recommends adapting test profiles to better\nreflect real-world conditions by incorporating _dynamic_ _cycling_ . These\nmileage figures contrast sharply with the average lifetime mileage of\nvehicles in Germany, which is approximately 169 _,_ 000 km, based on\ndata from Bundesamt [77] reporting an average annual mileage of\n12 _,_ 309 km and Oguchi and Fuse [78] indicating an average vehicle age\nof 13 _._ 7 years. On one hand, designing batteries to meet SoH thresholds under\nhighway testing conditions is not financially sustainable for manufacturers, as it requires higher-quality components that increase retail\nprices and may deter customers. On the other hand, it is environmentally unsustainable because many batteries are recycled prematurely\ndue to vehicle scrapping, even though they have not reached the end\nof their service life. Therefore, a new testing methodology is needed,\none that more accurately reflects real-world driving scenarios. In this\nwork, a framework is introduced that enables manufacturers to identify critical usage behaviors that significantly accelerate aging. This\napproach provides a foundation for developing test cases that better\nrepresent real-world conditions and ensure compliance with regulatory\nrequirements across the relevant portion of the vehicle fleet. **5.** **Methodology** The motivation for identifying key usage patterns arises from observed regional differences in vehicle operation, as illustrated in Fig.\n1, and their impact on aging shown in Fig. 3. Further details on these\nregional differences are provided by Saam et al. [20]. Such differences\nand their influence on aging highlight the need for a framework that\ncan isolate usage patterns contributing to battery degradation, independent of geographic or operational context. Unlike most existing studies,\na data-driven approach is adopted that does not rely on historical\nload profiles. This choice reflects a different objective: using SoH\nestimates to identify similar usage groups and, consequently, derive\nrepresentative load profiles. While this manuscript focuses on developing such a framework, the empirical basis for regional variability\nis well established in prior work; see the sources in Section 4. The\npresent implementation uses comparatively simple, well-established\nmethods as illustrative building blocks. These are not proposed as\noptimal algorithms but as exchangeable components within a modular\nworkflow that can be upgraded with more sophisticated techniques in\nfuture work.",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "The matrices introduced in Section 3 alone cannot determine\nwhether the values within them are responsible for aging behavior that\ncomplies with regulatory requirements. This limitation arises because\nthey do not account for the presence of faulty cells in the battery\nor aging phenomena that cause capacity and power fade. Therefore,\na comparison with matrices of the same type from other vehicles is necessary to isolate vehicle-specific aging effects and identify outliers\nor anomalies. This comparison is performed using the framework illustrated in\nFig. 4, which identifies usage behaviors based on available fleet data\nthat lead to similar battery aging. The framework consists of multiple\nsteps. Before identifying these usage behaviors, preliminary actions\nmust be taken to ensure a reliable data basis for the algorithms. These\nactions include minimizing corrupted data and outliers, reducing noise,\nand ensuring a homogeneous data format. These steps are represented\nby _Data_ _Cleansing_ and _Feature_ _Engineering_ . For the Volkswagen AG\ndataset , the following steps were performed: For the CALCE dataset , a different set of steps was required due\nto its structure and characteristics. These steps are as follows: - Combining individual files per DUT/subcycles into a single file spanning the entire DUT test duration. - Converting raw data into an aggregated matrix format to establish a similar data structure compared to the Volkswagen AG dataset\n . - Calculating SoH degradation using: CapacityDischargeCycle= _𝑖_\nSoHCycle= _𝑖_ = CapacityDischargeCycle=0 ⋅ 100 _._ - Filtering out SoH outliers (SoH ≤ 0 %). Further details are omitted due to their application-specific nature and the absence of a standardized process applicable to other\nuse cases [79]. For guidance in selecting suitable algorithms for a\ngiven dataset, the surveys by Hodge and Austin [79] and Souiden\net al. [80] offer comprehensive overviews of techniques and example\nalgorithms. Hodge and Austin [79] discusses approaches such as statistical methods, neural networks, machine learning techniques, and\nhybrid systems that combine at least two of these methods. In contrast, Souiden et al. [80] provides a literature review focused on\nanomaly detection in high-dimensional datasets and identifies current\nlimitations in this area. Subsequently, Section 5.1 introduces an approach for predicting the\nbattery age _𝑡_ and cumulative usage _𝑢_ at which the vehicle intersects the\nregulatory boundaries. This is visualized in the _Predicting_ _Intersection_ - Filtering out contextual anomalies such as mileages ≤0 km. - Removing protocol dates that precede the vehicle production date. - Filtering out outliers indicating sensor or calculation errors, such as SoH ≤40 %. - Removing incorrectly initialized battery capacities that distort the SoH calculation. 7",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **4.** Overview of the proposed framework, presented as a simplified visualization of its main steps. _Boundaries_ step. Additionally, the _Estimating_ _SoH_ step, which estimates\nthe SoH at the regulatory boundary, is introduced in Section 5.2. Section 5.3 explains how the results of _Predicting_ _Intersection_ _Boundaries_ and\n_Estimating_ _SoH_ are combined and used as input for _Clustering_ vehicles\naccording to usage and battery aging. Finally, the steps _Combining_\n_Usage_ _Profile_ _Groups_ and _Visualizing_ _Usage_ _Profile_ _Groups_ conclude the\nframework and are outlined in Section 5.4. _5.1._ _Method_ _for_ _predicting_ _intersections_ _with_ _regulatory_ _boundaries_ The SoH represents a snapshot of battery aging at a specific point\nin time, where the vehicle has a battery age _𝑡_ and cumulative usage _𝑢_ .\nThis snapshot provides only limited information regarding compliance\nwith regulatory requirements. For example, a vehicle with an SoH of\n71 % after five years and 100 _,_ 000 km would currently comply with all\nregulations. However, it is likely to fall below the SoH threshold of 70 %\nbefore reaching eight years or 160 _,_ 000 km, as required by the European\nCommission under the Euro 7 regulation [6]. Therefore, a new parameter is needed to represent compliance at the regulatory targets. This\ncan be achieved by leveraging the existing protocol metadata for each\nvehicle. From these protocols, the intersection between the regulatory\nboundaries and the vehicle’s progression in terms of mileage and age\nis extrapolated. To begin, the daily mileage must be calculated. Given\na set of protocol entries { _𝑃𝑖_ } _[𝑛]_ _𝑖_ =0 _[⊂]_ [R][2] [comprising] [coordinates] [(] _[𝑡][𝑖][, 𝑢][𝑖]_ [)][,]\nwhere each point _𝑃𝑖_ = ( _𝑡𝑖, 𝑢𝑖_ ) satisfies _𝑡𝑖_ _>_ 0 and _𝑢𝑖_ _>_ 0 for all _𝑖_, the\nvectors _⃗𝑣𝑖_ are defined as: estimated direction vector _⃗𝑣_ est is given by:",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "estimated direction vector _⃗𝑣_ est is given by: This ray _⃗𝑟_ ( _𝜆_ ) can intersect either the cumulative usage boundary\n(uRegulation) or the battery age boundary _𝑡_ Regulation specified by the\nregulation. The two intersection points are computed as follows: ∇est = ∑ _𝑛_\n_𝑖_ =0 _[𝑤][𝑖,𝑡]_ [∇] _[𝑖]_\n~~∑~~ _𝑛_ _._\n_𝑖_ =0 _[𝑤][𝑖,𝑡]_ We adopt a common confidence level of 95 %. Higher confidence\nlevels would require justification for critical applications, such as airbag\ndeployment or drug administration. To compute the 95 % prediction\ninterval, let _𝑧_ be the z-score corresponding to the 95 % confidence level\n( _𝑧_ ≈1 _._ 96), and define the standard deviation of the gradients as: _𝜎_ ∇ = std(∇ _𝑖_ ) _._ The upper and lower bounds for the prediction interval are then: ~~±~~\n∇est = ∇est ± _𝑧_ ⋅ _𝜎_ ∇ _._ After calculating the prediction interval for the gradients representing future daily distance, the intersections with the regulatory\nboundaries still need to be determined. To address this, let the final\npoint be _𝑃𝑛_ = ( _𝑡𝑛, 𝑢𝑛_ ), and let the direction estimates be: {\n∇∈ ~~+~~ ~~−~~ [}]\n∇est _,_ ∇est _,_ ∇est _._ We define a ray originating from _𝑃𝑛_ in the direction of ∇ as: (\n1\n_⃗𝑟_ ( _𝜆_ ) = _𝑃𝑛_ + _𝜆_ ⋅ ∇ )\n_,_ _𝜆_ ≥ 0 _._ _⃗𝑣𝑖_ = {\n_𝑃_ 0 _,_ if _𝑖_ = 0 _,_ _𝑃𝑖_ - _𝑃𝑖_ −1 _,_ if _𝑖>_ 0 _._ - **Intersection** **with** **the** **horizontal** **regulation** **line** at _𝑢_ =\n_𝑢_ Regulation:",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 563
    },
    {
      "text": "- **Intersection** **with** **the** **horizontal** **regulation** **line** at _𝑢_ =\n_𝑢_ Regulation: For each _𝑖_, the gradient ∇ _𝑖_ of _⃗𝑣𝑖_ is computed relative to a fixed\nreference direction (e.g., the positive _𝑥_ -axis) as: The intersection point _𝑄_ horiz(∇) is: )\n_𝑄_ horiz(∇) = [(] _𝑡𝑛_ + _𝜆𝑢, 𝑢_ Regulation _._ _𝑢_ Regulation                        - _𝑢𝑛_\nSolve for _𝜆𝑢_ ∶ _𝑢𝑛_ + _𝜆𝑢_ ⋅∇= _𝑢_ Regulation ⇒ _𝜆𝑢_ = _._\n∇ _𝜕𝑣𝑖,𝑢_\n∇ _𝑖_ = _𝜕𝑣𝑖,𝑡_ _,_ where _⃗𝑣𝑖_ = ( _𝑣𝑖,𝑡, 𝑣𝑖,𝑢_ ), and _𝜕𝑣𝜕𝑣𝑖,𝑢𝑖,𝑡_ [returns] [gradients] [in] [(0] _[,]_ [ ∞]][.]\nNext, the total contributions in the _𝑡_ -direction are defined as: _𝑉𝑡_ = ∑ _𝑛_ _𝑣𝑖,𝑡._\n_𝑖_ =0 _𝑖_ =0 The normalized directional weights for each vector are then: _𝑣𝑖,𝑡_\n_𝑤𝑖,𝑡_ = _._\n_𝑉𝑡_ These weights represent the proportion of each vector’s contribution\nin the _𝑡_ -direction relative to the total. The resulting gradient of the - **Intersection** **with** **the** **vertical** **regulation** **line** at _𝑡_ = _𝑡_ Regulation: Solve for _𝜆𝑡_ ∶ _𝑡𝑛_ + _𝜆𝑡_ = _𝑡_ Regulation ⇒ _𝜆𝑡_ = _𝑡_ Regulation − _𝑡𝑛._ The intersection point _𝑄_ vert(∇) is:",
      "page_num": 9,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 589
    },
    {
      "text": "The intersection point _𝑄_ vert(∇) is: _𝑄_ vert(∇) = [(] _𝑡_ Regulation _, 𝑢𝑛_ + _𝜆𝑡_ ⋅ ∇ [)] _._ Please note that the intersection is only valid for _𝜆_ ≥ 0. Therefore,\ndiscard cases where: _𝑢_ Regulation - _𝑢𝑛_ _<_ 0 or _𝑡_ Regulation − _𝑡𝑛_ _<_ 0 _._\n∇ 8",
      "page_num": 9,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 128
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **5.** Visualization of the intersection calculation using fictitious vehicle data. Furthermore, any direction estimate ∇ must lie within the interval\n(0 _,_ ∞]; otherwise, mileage or age would decrease, which is not physically possible for any vehicle. From this point onward, the intersection\ncoordinates obtained from either _𝑄_ horiz(∇) or _𝑄_ vert(∇) will be denoted\nas ( _𝑡𝑄, 𝑢𝑄_ ). In general, three intersection points will be determined: { }\n_𝑄_ ∈ _𝑄_ ∇est ~~_,_~~ _𝑄_ ∇est ~~+~~ _, 𝑄_ ∇est ~~−~~ _._ The overall process, including the three intersection points, is illustrated in Fig. 5. _5.1.1._ _Application_ _to_ _the_ _Volkswagen_ _AG_ _fleet_ _dataset_ From the total fleet of approximately 850,000 vehicles, a subsample\nof roughly 3500 vehicles has been identified that already surpasses at\nleast one regulatory boundary. This represents an extreme case within\nthe dataset. None of these 3500 vehicles has exceeded the eight-year\nage boundary, as MEB vehicles have only been in production since late\n2019 [65]. However, all of them have already surpassed the mileage\nregulation. Fig. 6 illustrates the distribution of regulation boundary\nintersections for this extreme subsample, showing that most vehicles\nintersect the mileage boundary between 1.5 and 4 years. Due to the low sampling frequency, caused by long intervals between workshop visits, these intersections are estimated based on\nthe last data point below _𝑃𝑡𝑖<_ Regulation∧ _𝑢𝑖<_ Regulation and the first data\npoint above _𝑃𝑡𝑖_ ≥Regulation∨ _𝑢𝑖_ ≥Regulation. To reach such high mileage in\na relatively short time, these vehicles must have traveled more than\n35 _,_ 000 km annually. This places them in an extreme usage category, especially considering that 95 % of the fleet travels less than\n32 _,_ 000 km annually and 75 % travels less than 20 _,_ 000 km, based on the\navailable protocol data. It is important to note that these 3500 vehicles do not constitute a\nrepresentative sample of the entire fleet but rather highlight edge cases\nwith unusually high usage intensity.",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 578
    },
    {
      "text": "It is important to note that these 3500 vehicles do not constitute a\nrepresentative sample of the entire fleet but rather highlight edge cases\nwith unusually high usage intensity. In contrast to the extreme subsample, Fig. 7 presents a fleet-wide\nprediction of regulation boundary intersections. Here, the peak observed in the subsample shifts toward the center of the plot, corresponding to an age of eight years and a mileage of 160 _,_ 000 km. The overall fleet prediction exhibits a primary peak at approximately 112 _,_ 000 km,\nhighlighted in red. A secondary peak at 0 km results from protocols\ngenerated prior to vehicle delivery, for which no subsequent data is\navailable. While the fleet-wide prediction in Fig. 7 suggests that most vehicles\nwill intersect regulatory boundaries around eight years, this estimate\nis based on extrapolation and carries inherent limitations. Specifically,\nthe methodology assumes stable usage behavior over time and does\nnot account for drastic changes, such as those caused by vehicle resale\nor special operating conditions (e.g., rental or company cars). For\ncontext, as of 2024, Germany had approximately 330,000 rental or carsharing vehicles, representing only 0 _._ 67 % of all passenger vehicles [81].\nFurthermore, leasing contracts in Europe typically end after three to\nfour years [82], and in Germany, 13 _._ 5 % of all ownership transfers involve vehicles younger than two years [82]. Such factors can introduce\ndeviations in the predicted intersections. These deviations are illustrated in Fig. 8, ranging from −31 % to 12 %\nfor 95 % of the data when comparing predicted intersections to observed\nprotocol points. However, when considering the entire intersection\nrange, deviations reduce significantly to between −11 % to 4 %. For 75 %\nof the data, the relative error narrows further to −6 % to 3 _._ 5 %, and\nfor 50 %, to −2 % to 1 %. It is important to note that these deviations\nmay be slightly affected by the absence of ground truth for the exact\nintersection points, primarily due to large time gaps between protocol\nentries. _5.1.2._ _Application_ _to_ _the_ _CALCE_ _dataset_ The regulation boundaries defined by Euro-7 or ACCII are not\napplicable to the CALCE dataset due to its fundamentally different\nuse case (automotive operation versus laboratory testing). Therefore,\nartificial boundaries based solely on the available test data  are introduced. These boundaries do not reflect real-world requirements and are\nintended exclusively for visualization and methodological verification: - Age boundary: 40 days - Cycle boundary: 400 9",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 562
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **6.** Intersection with regulatory boundaries for the 3500 vehicles that have already surpassed the mileage threshold. **Fig.** **7.** Fleet-wide prediction of intersections with regulatory boundaries. The left panel shows vehicles likely to surpass the mileage threshold, while the right\npanel shows those likely to exceed the age threshold. The red marker at 112 _,_ 000 km indicates the overall peak where most vehicles intersect the regulation\nboundaries. These artificial limits were chosen because a large proportion\nof DUTs in  exceed them. For illustration, ten random DUTs were\nselected, and their intersection points _𝑄_ were calculated. The results\nare presented in Table 3. Values marked as ‘‘n.a’’. correspond to\nDUTs that have already surpassed one of the boundaries. In such\ncases, _𝑄_ ∇est is either the observed point _𝑃𝑡𝑖_ ≥Regulation∨ _𝑢𝑖_ ≥Regulation or\nthe estimated intersection between the last point below the boundary\n_𝑃𝑡𝑖<_ Regulation∧ _𝑢𝑖<_ Regulation and the first point above it\n_𝑃𝑡𝑖_ ≥Regulation∨ _𝑢𝑖_ ≥Regulation. For the remaining DUTs, the intersection range is defined by the\nlower bound _𝑄_ ∇ ~~−~~ est [and] [the] [upper] [bound] ~~_[𝑄]_~~ [∇][+] est, representing the pre est [∇] est diction interval. Notably, the small prediction interval for DUT 06-048\nresults from highly homogeneous cycling behavior within its dataset. Now, the CALCE dataset  is further reduced to include only\nDUTs that reach the regulation boundaries, forming a new dataset\nRegulation Exceeder. This subset comprises 142 cells instead of the original\n192, as different testing scenarios lead to varying aging behaviors,\npreventing some cells from reaching the boundaries (see Fig. 2). Subsequently, to evaluate the methodology under varying data\navailability conditions, the reduced dataset Regulation Exceeder was truncated to include only observations within a specified percentage of\nthe age and cycle boundaries. This process resulted in a collection",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 543
    },
    {
      "text": "Subsequently, to evaluate the methodology under varying data\navailability conditions, the reduced dataset Regulation Exceeder was truncated to include only observations within a specified percentage of\nthe age and cycle boundaries. This process resulted in a collection of subsets denoted as Collection Regulation Exceeder Cutoff, where each subset Regulation Exceeder Cutoff= _𝑝_ corresponds to a cutoff percentage _𝑝_ of\nthe age and cycle limits. For each cutoff subset, additional sampling was performed by selecting random fractions of the truncated data,\ngenerating test sets collectively referred to as Test. This fractionation\nensures that the performance of the methodology can be assessed under progressively reduced data conditions. To mitigate sampling bias, each fraction was drawn randomly, and the procedure was repeated 30 times for every combination of cutoff and fraction parameters. The results were then averaged to obtain robust performance estimates. Fig. 9 shows the number of correct predictions for different cutoff and fraction combinations and thereby illustrates the resulting perfor\nmance trends. Notably, accuracy improvements beyond 50 % of the age and cycle boundaries were marginal. Furthermore, as little as 10 % of the dataset truncated at 50 % of the boundaries was sufficient to achieve an accuracy of approximately 95 %. Additional information regarding the _Mean_ _Squared_ _Error_ (MSE) of the day and cycle prediction can be found in the Appendix in Figs. 15 and 16. 10",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 314
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **8.** Deviation of predicted intersections with regulatory boundaries compared to observed values from Fig. 6. **Table** **3**\nExemplary intersections for ten randomly selected DUTs from the CALCE dataset, including estimated prediction intervals and\ncases where boundaries were already surpassed. DUT ID Intersection of Regulation Boundaries ~~_𝑄_~~ ∇est− (Days _𝑡𝑄_, Cycles _𝑢𝑄_ ) _𝑄_ ∇est (Days _𝑡𝑄_, Cycles _𝑢𝑄_ ) _𝑄_ ∇est+ (Days _𝑡𝑄_, Cycles _𝑢𝑄_ ) 02–012 n.a. (40.0, 245.11) n.a.\n03–019 n.a. (34.89, 400.0) n.a.\n04–030 n.a. (40.0, 273.49) n.a.\n06–048 (40.0, 361.92) (40.0, 362.47) (40.0, 363.01)\n15–114 n.a. (33.81, 400.0) n.a.\n16–128 n.a. (40.0, 344.91) n.a.\n17–131 n.a. (25.22, 400.0) n.a.\n18–140 n.a. (37.21, 400.0) n.a.\n22–169 (40.0, 333.16) (40.0, 375.4) (38.61, 400.0)\n22–175 (40.0, 350.38) (40.0, 379.69) (39.23, 400.0) **Fig.** **9.** Number of correct predictions for the 142 DUTs in Regulation Exceeder across varying boundary cutoffs and dataset fractions. _5.2._ _Estimation_ _of_ _SoH_ _at_ _regulatory_ _intersections_ After determining the intersections with the regulation boundaries,\nthe remaining step is to estimate the SoH at these points. Several\nmethods can be applied for this purpose: - SoH estimation based on a _Reference_ _Aging_ _Surface_ - SoH estimation based on curve fitting The following subsections introduce both approaches and evaluate their performance. 11",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 560
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **10.** Predicted SoH progression over mileage and age using a RFR with enforced monotonic constraints for the CALCE dataset. _5.2.1._ _SoH_ _estimation_ _using_ _a_ _reference_ _aging_ _surface_ As mentioned in Section 2, a reference aging surface can be constructed using a _Random_ _Forest_ _Regressor_ (RFR). To train the RFR,\na standard dataset split of 80 % for training and 20 % for testing is\nemployed [83,84] to mitigate overfitting. Before training, outliers and anomalies in the SoH progression must\nbe removed; otherwise, the predictions of the RFR would be skewed.\nThis outlier removal process was performed earlier in the workflow\n(see Section 5). Once the dataset was cleansed, the RFR is trained to\ngenerate the reference aging surface. Following training, the model approximates an unknown function\n_𝑓_ ( _𝑡, 𝑢_ ) that maps battery age _𝑡_ and cumulative usage _𝑢_ to the SoH: _𝑓_ ( _𝑡, 𝑢_ ) ≈ SoH( _𝑡, 𝑢_ ) _._ However, in some cases, the resulting surface does not exhibit\nmonotonic decrease as required by Eq. (1). This is problematic because a non-monotonic trend contradicts the typical SoH progression\nof lithium-ion batteries [85]. can be estimated. Depending on which boundary is reached first, this\ncorresponds to: _̃𝑓_ ( _𝑡_ est _, 𝑢_ Regulation) _,_ _̃𝑓_ ( _𝑡_ Regulation _, 𝑢_ est) _,_ or _̃𝑓_ ( _𝑡_ Regulation _, 𝑢_ Regulation) _._ However, these values would only represent the true SoH for a\nvehicle if all previous protocol entries _𝑃𝑖_ perfectly aligned with the\naging surface, i.e., ∀ _𝑖_ ∈{1 _,_ … _, 𝑛_ } _,_ _𝛿𝑖_ = _𝑃𝑖_ SoH − _𝑓_ _[̃]_ ( _𝑡𝑖, 𝑢𝑖_ ) = 0 _,_",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 558
    },
    {
      "text": "∀ _𝑖_ ∈{1 _,_ … _, 𝑛_ } _,_ _𝛿𝑖_ = _𝑃𝑖_ SoH − _𝑓_ _[̃]_ ( _𝑡𝑖, 𝑢𝑖_ ) = 0 _,_ where _𝛿𝑖_ denotes the deviation from the surface. In practice, this is\nrarely the case. Therefore, two approaches are proposed to account for\ndeviations when estimating SoH at intersection points: _𝑓_ 1( _𝑡, 𝑢_ ) = _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) + _𝛿,_ _[̄]_ where _̄𝛿_ = [1] _𝑛_ or _𝑓_ 2( _𝑡, 𝑢_ ) = _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) + _𝑠_ ⋅ _𝑟_ ( _𝑡, 𝑢_ ) + _𝑜,_ with ∑ _𝑛_ _𝛿𝑖,_\n_𝑖_ =1 s ⋅ r(t,u) + - =linear fit, (\nr(t,u) =max _𝑡_ _𝑢_\n_𝑡_ Regulation _[,]_ _𝑢_ Regulation _𝜕𝑓_ _𝜕𝑓_ _𝜕𝑓_ and\n_𝜕𝑡_ [≤] [0] _𝜕𝑢_ _𝜕𝑓_ for all ( _𝑡, 𝑢_ ) _._ (1)\n_𝜕𝑢_ [≤] [0] )\n, Although _𝑓_ ( _𝑡, 𝑢_ ) ∉ , where {\n = _𝑓_ ( _𝑡, 𝑢_ ) ∶ _[𝜕𝑓]_ } _[𝜕𝑓]_ _,_ _𝜕𝑢_ [≤] [0] _[𝜕𝑓]_ _𝜕𝑡_ [≤] [0] _[, ][𝜕𝑓]_ _𝜕𝑢_ o, s =fitting parameters. there exists a smoothed function _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) ∈  such that",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 596
    },
    {
      "text": "there exists a smoothed function _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) ∈  such that _𝜕𝑓_ _[̃]_\n_̃𝑓_ ( _𝑡, 𝑢_ ) ≈ _𝑓_ ( _𝑡, 𝑢_ ) and _𝑓_ _[̃]_ _𝜕𝑡_ [≤] [0] _[, ][𝜕]_ _𝜕𝑢_ _[𝑓][̃]_ _𝜕𝑢_ [≤] [0] _[.]_ This can be achieved by introducing monotonicity constraints during training to enforce Eq. (1). We define a new function _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) that\nsatisfies: _5.2.2._ _SoH_ _estimation_ _using_ _mathematical_ _functions_ Alternatively to the reference aging surface, the SoH can be estimated by fitting mathematical functions to each vehicle individually. While exponential models are commonly used [86], they suffer\nfrom reduced accuracy at higher mileage or cycle counts. Therefore,\nalternative formulations are proposed: _𝜕𝑓_ _[̃]_ _𝜕𝑓_ _[̃]_ _𝜕𝑓_ _[̃]_ and\n_𝜕𝑡_ [≤] [0] _𝜕𝑢_ _𝑓_ _[̃]_ for all points _._\n_𝜕𝑢_ [≤] [0] ∑ _𝑃_ SoH _𝑝,_\n_𝑝_ =1 As a result, _𝑓_ _[̃]_ ( _𝑡, 𝑢_ ) remains as close as possible to the original\npredictions of _𝑓_ ( _𝑡, 𝑢_ ) while ensuring monotonicity. The reference aging\nsurface for the CALCE dataset with monotonic constraints is shown\nin Fig. 10. Due to confidentiality, the corresponding surface for the\nVolkswagen AG dataset cannot be disclosed. _𝑔_ 1 = [1] _𝑃_ _𝑔_ 2( _𝑡, 𝑢_ ) = _𝑠_ ⋅ _𝑟_ ( _𝑡, 𝑢_ ) + _𝑜,_",
      "page_num": 13,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "_𝑔_ 2( _𝑡, 𝑢_ ) = _𝑠_ ⋅ _𝑟_ ( _𝑡, 𝑢_ ) + _𝑜,_ _𝑎_\n_𝑔_ 3( _𝑡, 𝑢_ ) = _𝑟_ ( _𝑡, 𝑢_ ) ⋅ _𝑏_ + 1 [+] _[ 𝑠]_ [⋅] _[𝑟]_ [(] _[𝑡, 𝑢]_ [) +] _[ 𝑜,]_ _𝑎_ 1\n_𝑔_ 4( _𝑡, 𝑢_ ) = _𝑟_ ( _𝑡, 𝑢_ ) ⋅ _𝑏_ + 1 [+] _[ 𝑠]_ [⋅] _[𝑟]_ [(] _[𝑡, 𝑢]_ [) −] _[𝑐]_ [⋅] _𝑟_ ( _𝑡, 𝑢_ ) − _ℎ_ _[,]_ where With the trained RFR, the SoH at the intersection points {\n_𝑄_ ∈ _𝑄𝜃_ est _, 𝑄𝜃_ est+ _[, 𝑄][𝜃]_ est [−] } 12",
      "page_num": 13,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 328
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **11.** Input–output structure for MLP and recurrent models. p =unique protocol entry within the dataset,\na,b,c,h,o,s =fitting parameters. The function _𝑔_ 1 represents the overall average of the dataset and\ncannot capture individual SoH progressions. Nevertheless, it serves as\na baseline for evaluating other algorithms. In contrast, _𝑔_ 2( _𝑡, 𝑢_ ) models\nconstant degradation over the entire service life, which contradicts the\ntypical aging process characterized by an _acceleration_ _stage_, followed by\na _stagnation_ _stage_, and ending in a _saturation_ _stage_ [87]. Thus, _𝑔_ 2 is used\nas a second baseline. The function _𝑔_ 3( _𝑡, 𝑢_ ) captures both the acceleration and stagnation\nstages but does not model the saturation stage. This limitation is acceptable because knee points are unlikely within the regulatory boundaries.\nFinally, _𝑔_ 4( _𝑡, 𝑢_ ) theoretically covers all three stages but is challenging to\nfit under the constraints imposed by the SoH estimation methodology. The results reveal clear patterns across datasets. Models trained\non  consistently exhibited higher MSE values for both training and\nvalidation loss. In general, the loss on  is approximately 1 % of that\non  . Additionally, in both datasets, the MLP achieved the lowest\ntraining and validation loss. Overall, the model parameters determined\nthrough hyperparameter search should be interpreted with caution,\nas the differences between configurations are marginal. The standard\ndeviation in MSE ranges from 10 [−][6] to 10 [−][2], depending on the dataset\nand the chosen model. _5.2.3._ _SoH_ _estimation_ _using_ _machine_ _learning_ _models_ Similar to prior studies (see Section 2), machine learning models are\nemployed as an alternative approach for SoH estimation. Specifically,\nfour architectures are evaluated: a MLP, a RNN, its predecessor LSTM,\nand a GRU. These models are selected for their ability to capture nonlinear relationships and temporal dependencies in sequential battery\ndata. Unlike several studies discussed in Section 2, advanced feature\nengineering techniques could not be applied due to the absence of highfrequency sampling and specialized measurement cycles (e.g., EIS or\nICA) in the Volkswagen AG dataset. These methods typically require\nlow C-rates and controlled laboratory conditions, which are unavailable\nin large-scale fleet data.",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "Unlike several studies discussed in Section 2, advanced feature\nengineering techniques could not be applied due to the absence of highfrequency sampling and specialized measurement cycles (e.g., EIS or\nICA) in the Volkswagen AG dataset. These methods typically require\nlow C-rates and controlled laboratory conditions, which are unavailable\nin large-scale fleet data. In this study, a 80/20 train-validation split was applied, consistent\nwith prior works [83,84]. To minimize bias from a single partition, the\ntraining data was randomly shuffled at each epoch, ensuring diverse\nsample exposure during optimization. This strategy provides a practical\nbalance between computational efficiency and reliable generalization\nassessment. The MLP model uses the current feature vector _𝑟_ ( _𝑡, 𝑢_ ) and\nits corresponding SoH( _𝑟_ ( _𝑡, 𝑢_ )) to predict the next SoH given the subsequent _𝑟_ ( _𝑡, 𝑢_ ). In contrast, the recurrent architectures, RNN, LSTM, and\nGRU, leverage the previous nine feature vectors and their associated\nSoH( _𝑟_ ( _𝑡, 𝑢_ )) values to predict the next SoH using the tenth _𝑟_ ( _𝑡, 𝑢_ ). For\nvehicles or DUTs with fewer than ten samples, missing entries are zeropadded to ensure that all input sequences have a consistent length. The\ninput–output structure is illustrated in Fig. 11. To identify the most suitable architecture, a hyperparameter search\nis conducted. Rather than performing an exhaustive search, a pragmatic\napproach is adopted by executing 10 runs per model for each of the two\ndatasets  and . This strategy balances computational efficiency with\nsufficient exploration of the hyperparameter space. Table 4 summarizes the best-performing hyperparameter configurations identified during the search for datasets  and . The search\nfocused only on a subset of a few hyperparameters, as the primary\nobjective was to validate the workflow rather than achieve globally\noptimal models. _5.2.4._ _Comparison_ _of_ _state_ _of_ _health_ _estimation_ _methods_ Tables 5 and 6 summarize the error distribution of nine SoH estimation methods across two datasets: the fleet dataset  and the\nCALCE dataset . The results reveal substantial performance differences\nbetween classical regression-based approaches and machine learning\nmodels, as well as across datasets. Percentiles are reported instead of\nmean errors to provide a robust measure of performance across the\ndistribution and reduce sensitivity to outliers.",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 573
    },
    {
      "text": "Tables 5 and 6 summarize the error distribution of nine SoH estimation methods across two datasets: the fleet dataset  and the\nCALCE dataset . The results reveal substantial performance differences\nbetween classical regression-based approaches and machine learning\nmodels, as well as across datasets. Percentiles are reported instead of\nmean errors to provide a robust measure of performance across the\ndistribution and reduce sensitivity to outliers. For both datasets, _𝑔_ 1 exhibits the weakest performance, which is\nexpected given its baseline functionality. However, within , the performance gap is smaller than in , likely due to the more homogeneous\naging behavior in  . The best performance in  is achieved by _𝑔_ 3 for\nthe 50th and 75th percentiles, while the MLP slightly outperforms _𝑔_ 3\nat the 95th percentile. Second-best overall in  is the MLP, followed\nby the two RFRs, _𝑓_ 1 (constant offset) and _𝑓_ 2 (increasing offset). Next\ncomes _𝑔_ 2 with its linear fit. The recurrent models (RNN, LSTM, GRU)\nalso outperform _𝑔_ 1, but still lag behind the other methods. In contrast, performance rankings shift for . The top four models\nare machine learning-based, followed by _𝑔_ 3. Afterward, RFR _𝑓_ 2 outperforms _𝑓_ 1 by more than 2 %, placing _𝑓_ 1 second to last. Similarly,\n_𝑔_ 2 surpasses _𝑓_ 1 by over 1 _._ 6 %. The superior performance of machine\nlearning models on  is likely due to its higher sampling frequency,\nwhich provides a larger quantity of training samples. This particularly\nbenefits recurrent networks, as the fleet dataset often lacks sufficient\nconsecutive samples (e.g., fewer than nine observations to predict the\ntenth). Based on these results, _𝑔_ 3( _𝑡, 𝑢_ ) is selected for subsequent analyses\ndue to its superior performance on the fleet dataset  . However, this advantage comes at a cost: the computation of _𝑔_ 3 is time-intensive because\nit requires an optimization procedure for each individual vehicle. _5.3._ _Identifying_ _relevant_ _vehicle_ _usage_ _behavior_ _groups_",
      "page_num": 14,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 558
    },
    {
      "text": "_5.3._ _Identifying_ _relevant_ _vehicle_ _usage_ _behavior_ _groups_ Based on the calculated intersections and SoH, groups of vehicles\nwith similar usage behavior can be identified. To achieve this, let the\nintersection points of all vehicles _𝑁_ be defined as , consisting of all\n_𝑄_ ∇est with their coordinates ( _𝑡𝑄, 𝑢𝑄_ ), such that  = {( _𝑡𝑄𝑖_ _, 𝑢𝑄𝑖_ )} _[𝑁]_ _𝑖_ =1 _[.]_ These points can be further expressed through a transformation. For\nthis purpose, the axes _𝑡_ and _𝑢_ are transformed into a new axis _𝑧_, which 13",
      "page_num": 14,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 192
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Table** **4**\nComparison of the best hyperparameter search results per model and dataset. Model Hidden layer size Number of layers MSE training loss MSE validation loss Dataset  MLP 256 2 1.5e−3 1.7e−3\nRNN 512 3 2.1e−3 2.8e−3\nLSTM 128 2 2.1e−3 2.8e−3\nGRU 1024 1 2.1e−3 2.9e−3 Dataset  MLP 1024 3 2.6e−5 5.4e−5\nRNN 256 2 3.9e−5 3.0e−4\nLSTM 1024 3 3.9e−5 9.5e−5\nGRU 512 3 3.8e−5 1.7e−4 **Table** **5**\nComparison of SoH estimation methods applied to the fleet dataset  . Values indicate absolute errors in SoH\nexpressed in percentage points, below which 50 %, 75 %, and 95 % of the predictions fall. Best results per percentile\nare highlighted in bold. Percentile _𝑓_ 1 _𝑓_ 2 _𝑔_ 1 _𝑔_ 2 _𝑔_ 3 MLP RNN LSTM GRU 50th 1.339 1.55 2.623 1.994 **0.705** 1.022 2.104 2.113 2.123\n75th 2.557 3.209 4.279 3.779 **1.534** 1.935 3.652 3.69 3.687\n95th 5.124 8.805 6.725 9.535 4.396 **4.079** 6.281 6.271 6.322 **Table** **6**\nComparison of SoH estimation methods applied to the CALCE dataset . Values indicate absolute errors in SoH\nexpressed in percentage points, below which 50 %, 75 %, and 95 % of the predictions fall. Best results per percentile\nare highlighted in bold. Percentile _𝑓_ 1 _𝑓_ 2 _𝑔_ 1 _𝑔_ 2 _𝑔_ 3 MLP RNN LSTM GRU",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 579
    },
    {
      "text": "Percentile _𝑓_ 1 _𝑓_ 2 _𝑔_ 1 _𝑔_ 2 _𝑔_ 3 MLP RNN LSTM GRU 50th 2.597 0.539 2.509 0.903 0.366 **0.058** 0.311 0.127 0.079\n75th 3.611 1.42 5.126 1.51 0.966 **0.136** 0.447 0.314 0.153\n95th 13.341 4.668 22.022 4.194 2.263 **0.585** 1.181 1.265 0.599 represents all possible combinations of _𝑡𝑄_ and _𝑢𝑄_ . This transformation\nis defined as _𝑡𝑄_ _𝑢𝑄_\n_𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) = _𝑡_ Regulation - _𝑢_ Regulation _,_ such that [−1 _,_ 0) if _𝑢𝑄_ = _𝑢_ Regulation ∧ _𝑡𝑄_ _< 𝑡_ Regulation _,_ {0} if _𝑢𝑄_ = _𝑢_ Regulation ∧ _𝑡𝑄_ = _𝑡_ Regulation _,_ (0 _,_ 1] if _𝑢𝑄_ _< 𝑢_ Regulation ∧ _𝑡𝑄_ = _𝑡_ Regulation _._ _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) ∈ ⎧\n⎪\n⎨\n⎪⎩ Fig. 12 illustrates the transformation of battery age _𝑡_ and cumulative\nusage _𝑢_ into the new axis _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ). The figure shows the predicted\nregulation boundary intersecting with the estimated SoH for the fleet\ndataset. As expected, the SoH is lowest where the combined impact\nof cyclic and calendar aging is greatest, namely at eight years and\n160 _,_ 000 km.",
      "page_num": 15,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 515
    },
    {
      "text": "This information, together with SoH _𝑖_, serves as input for a clustering\nalgorithm. In this study, the K-Means algorithm was chosen due to\nits simplicity and widespread application in similar contexts [35]. It\nis important to note that the choice of clustering algorithm presented\nhere is illustrative rather than definitive. Although the choice may vary\ndepending on the use case, the selected algorithm partitions  into\n_𝑀_ subgroups: Cluster1 _,_ … _,_ Cluster _𝑀_ . For further details on the K-Means\nalgorithm, please refer to MacQueen [32]. _5.3.1._ _Application_ _to_ _the_ _CALCE_ _dataset_ As described in Section 1, clustering performance is evaluated using\n_external_ _validation_ . Additionally, _internal_ _validation_ can also be applied;\nhowever, external validation is generally more meaningful when the\nobjective is to assess whether the same test groups are correctly identified, i.e., the groups to which the DUTs were originally assigned. This\nis particularly important in this case, as the goal is to demonstrate\nthat the framework can identify groups with similar aging behavior,\nwhich implies that they have experienced comparable usage patterns. **Table** **7**\nExternal evaluation scores assessing the clustering algorithm’s ability to group DUTs in alignment with their\noriginal categories. Metric Achieved score Rand Score 0.7669\nNormalized Mutual Information 0.9330\nHomogeneity 0.9157\nCompleteness 0.9509\nV-Measure 0.9330 Consequently, this part of the framework cannot be visualized with\nthe Volkswagen AG dataset because the required ground truth labels\nare not available. Therefore, only the CALCE dataset is used. In this\ncase, Regulation Exceeder Cutoff is applied directly. The number of clusters\nwas set to _𝑀_ = 18 based on the elbow method. To assess whether the\nframework works correctly and accurately, different evaluation metrics\nare employed: These metrics compare the true groups, represented by the test\ngroup labels of CALCE, with those determined by the clustering algorithm. Table 7 presents the achieved scores for the different algorithms. Based on the results in Table 7, the framework demonstrates a high\nability to correctly identify the different test groups. _5.4._ _Deriving_ _insights_ _into_ _usage_ _profiles_ The clustering step not only groups vehicles by intersection patterns\nwith regulatory boundaries but also establishes the connection between - Rand Score, introduced by Hubert and Arabie [88] - Normalized Mutual Information (NMI), introduced by Strehl and Ghosh [89] - V-Measure with Homogeneity and Completeness, introduced by",
      "page_num": 15,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 598
    },
    {
      "text": "- V-Measure with Homogeneity and Completeness, introduced by Rosenberg and Hirschberg [90] _5.3.1._ _Application_ _to_ _the_ _CALCE_ _dataset_ 14",
      "page_num": 15,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 48
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **12.** Transformation from battery age _𝑡_ and cumulative usage _𝑢_ to the new axis _𝑧_ ( _𝑡, 𝑢_ ), with estimated SoH for a subset of the fleet. Similar to Figs. 6 and 7,\nvehicles on the left are likely to exceed the mileage boundary, while those on the right are likely to exceed the age boundary. A decrease on the left indicates\nfrequent drivers, whereas an increase on the right corresponds to infrequent drivers. aging outcomes and underlying usage behaviors. For example, clusters with higher C-rates exhibit accelerated SoH decline compared to\nclusters dominated by moderate charging and longer rest periods. This\ndemonstrates that behavioral patterns are key drivers of battery aging\nand can be systematically identified through the proposed framework. To gain insights into the usage profiles of a specific group Cluster _𝑚_ _⊆_\n identified by the clustering algorithm, its mean Cluster _𝑚_ is computed\nas an interpretable representation of the cluster. For each Cluster _𝑚_, the\nmean intersection with the regulation boundaries is calculated as a\nfunction of _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ). We selected three distinct clusters: - Intersection at ( _𝑡𝑄, 𝑢_ Regulation) (G1, highlighted in blue in Fig. 13, represented by min( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ )), - Intersection at ( _𝑡_ Regulation _, 𝑢𝑄_ ) (G2, highlighted in green in Fig. 13, represented by max( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ )), - Intersection near ( _𝑡_ Regulation _, 𝑢_ Regulation) (G3, highlighted in red in To address these challenges, machine learning models offer a\npromising alternative. They can capture non-linear relationships, account for variability in mileage patterns, and adapt to evolving behaviors, making them better suited for predicting intersections under\ndiverse and dynamic conditions. However, these models require additional contextual information, such as indicators for resale events,\nchanges in ownership, or seasonal usage patterns, to accurately detect\nand adjust for abrupt shifts in behavior. Without such features, even\nadvanced models may struggle to provide reliable predictions.",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 578
    },
    {
      "text": "In addition, the sampling rate of available data plays a critical\nrole in prediction accuracy. Higher sampling frequencies enable models\nto capture short-term fluctuations and emerging trends, improving\nthe precision of intersection forecasts. Conversely, low sampling rates\ncan obscure these dynamics, leading to delayed detection of critical\nchanges and reduced reliability in long-term predictions. Enhancing\ndata acquisition strategies, for example through _Over_ _The_ _Air_ (OTA)based solutions, could therefore significantly strengthen the predictive\ncapability of both statistical and machine learning approaches. _6.2._ _Limitations_ _in_ _estimating_ _the_ _state_ _of_ _health_ The influence of low sampling rates on SoH estimation is clearly\nvisible in the Volkswagen AG fleet dataset  . Compared to the CALCE\ndataset , which provides measurements at a higher sampling frequency, the performance differences between estimation methods, particularly for recurrent networks, can reach several percentage points.\nThis highlights that the framework benefits significantly from higher\nsampling rates in fleet operations, for example by leveraging OTA\nsolutions to retrieve data automatically on a day-to-day basis. Another aspect concerns the handling of knee points in the degradation curve. These abrupt changes in aging behavior, often occurring\nnear the end of life, are not yet explicitly modeled in the current\napproach. Addressing knee points in future work could improve predictions of remaining useful life and ensure compliance with regulatory\nboundaries, particularly for batteries approaching critical thresholds. Additionally, during training of the models (RFR, MLP, RNN, LSTM,\nGRU) only a 80/20 train-validation split has been applied. To further\nreduce bias from a single partitioning and enhance robustness, incorporating K-fold cross validation would be beneficial. While this approach\nincreases computational requirements for large datasets, it represents a\npromising avenue for improving model reliability as resources allow. Finally, the full potential of machine learning models is currently\nlimited by the low sampling frequency and the absence of specialized represented by min( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ )), Intersection at ( _𝑡_ Regulation _, 𝑢𝑄_ ) represented by max( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ )), Fig. 13, represented by min(| _𝑧_ ( _𝑡, 𝑢_ ) _𝑚_ |)).",
      "page_num": 16,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 531
    },
    {
      "text": "Fig. 13, represented by min(| _𝑧_ ( _𝑡, 𝑢_ ) _𝑚_ |)). The representation Cluster _𝑚_ can be visualized as a line chart, as\nshown in Fig. 14. It reveals clear differences in charging behavior across\nclusters. This demonstrates that the proposed framework effectively\nseparates individual vehicles, in this case DUTs, into distinct and meaningful clusters. In addition to achieving a _Homogeneity_ score of 0.9157,\na comparison with the raw data of each DUT per cluster (see Fig. 17 in\nthe Appendix) and the corresponding labels confirms that homogeneous\ngroups can be successfully identified. **6.** **Discussion** This section discusses the limitations of the current framework and\nhighlights potential improvements for future work. _6.1._ _Limitations_ _in_ _predicting_ _the_ _intersection_ _with_ _regulation_ _boundaries_ Current statistical methods for predicting intersections with regulatory boundaries rely on simplified assumptions, such as constant daily\nmileage. In practice, this assumption rarely holds: daily mileage can\nvary due to seasonal changes, holidays, or shifts in commuting patterns.\nFurthermore, abrupt changes caused by vehicle resale or ownership\ntransfer introduce discontinuities that these models cannot capture. Another limitation is sensitivity to outliers, such as occasional longdistance trips or extended periods of inactivity, which can distort\npredictions. 15",
      "page_num": 16,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 310
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **13.** Visualization of the three selected clustering groups _𝐺_ 1, _𝐺_ 2, and _𝐺_ 3, highlighted in blue, green, and red, respectively. Each group represents a distinct\nintersection pattern with the regulation boundaries as a function of _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ). **Fig.** **14.** Charging behavior of three distinct clusters from the CALCE dataset, as determined by the proposed framework. Each cluster illustrates characteristic\nusage patterns that highlight differences in charging behavior. measurement cycles such as EIS or ICA, which require low C-rates\nand controlled conditions. While these techniques are challenging to\nintegrate into real-world fleet operations, incorporating them alongside\nOTA-based data acquisition could unlock significant improvements,\nmaking advanced methods increasingly feasible as technology and\ninfrastructure evolve. _6.3._ _Limitations_ _in_ _deriving_ _insights_ _from_ _usage_ _profiles_ The current representation (see Section 5.4), which focuses solely on\ncharging behavior of the DUTs, captures only one dimension of usage\nand does not fully explain why the groups intersect at different battery\nages _𝑡_ and cumulative usages _𝑢_ . Nevertheless, a clear connection between usage patterns and aging\nbehavior is evident. Differences in charging behavior lead to distinct aging outcomes: _𝐺_ 2 and _𝐺_ 3 exhibit less aging compared to _𝐺_ 1, which\nhas an average SoH of 78 %, whereas _𝐺_ 3 and _𝐺_ 2 reach 92 % and\n97 %, respectively. This correlates with C-rate differences: _𝐺_ 1 has the\nhighest C-rate, followed by _𝐺_ 3 and _𝐺_ 2, consistent with the well-known\nphenomenon that higher C-rates accelerate aging.",
      "page_num": 17,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 461
    },
    {
      "text": "However, charging behavior alone does not fully explain variations in regulatory boundary intersections or aging differences. Other\ninfluential factors include discharge rate, which varies significantly\namong DUTs: some operate at 0 _._ 7 C, while others reach 2 C. Additional variations include cycling temperature and rest time. For example, the blue cluster with min( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ ) and the green cluster with\nmax( _𝑧_ ( _𝑡𝑄, 𝑢𝑄_ ) _𝑚_ ) exhibit cycling temperatures around 10 °C, whereas\nthe red cluster with min(| _𝑧_ ( _𝑡, 𝑢_ ) _𝑚_ |) operates at approximately 25 °C.\nRest time further influences aging and the point of intersection with\nregulatory boundaries. 16",
      "page_num": 17,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 202
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ While the current approach uses single-view clustering based solely\non one usage behavior, such as charging behavior, this representation\nis inherently limited. It risks overlooking other influential dimensions,\nincluding discharge patterns, temperature, and rest periods, which can\nlead to biased group formation and incomplete insights into aging\nmechanisms. Consequently, an improved approach may be required\ndepending on the use case, one that considers multiple dimensions of\nusage behavior. A promising solution is an extension of the current\nframework by incorporating a multi-view clustering approach, where\neach view represents a distinct aspect of usage. For instance, one view\ncould capture charging behavior at different C-rates, another could\nrepresent discharge C-rates, and a third could include rest time at\nspecific temperatures and SoC intervals. Such a framework enables a\nmore comprehensive distinction between usage patterns and a more\naccurate assessment of their influence on aging. For further details on\nmulti-view clustering, see Chao et al. [91], who illustrates the concept\nusing image features, and Moujahid and Dornaika [92], who provides\nan overview of recent surveys and techniques. _6.4._ _Framework_ _flexibility_ _and_ _future_ _extensions_ An important strength of the proposed framework is its modular\ndesign. Each step can be replaced by improved methods as long as\nthe input and output interfaces remain consistent. For example, more\nadvanced machine learning models could substitute the current regression approach for predicting intersections with regulatory boundaries,\nor alternative clustering algorithms could replace K-Means without\naffecting subsequent steps. This flexibility ensures that the framework\ncan evolve with future advancements in predictive modeling and data\nanalysis while maintaining overall compatibility. To guide methodological extensions, the framework provides clear\nmodular interfaces. Future work could incorporate survival analysis\nor deep learning models for intersection prediction, integrate kneepoint detection for improved SoH estimation, or adopt multi-view\nclustering to capture complex behavioral patterns. These enhancements\nwould enable a more accurate and comprehensive assessment of aging\ninfluences while preserving the overall workflow structure. **7.** **Summary** **and** **outlook**",
      "page_num": 18,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 455
    },
    {
      "text": "**7.** **Summary** **and** **outlook** This paper demonstrated clear usage behavioral differences across\nfive countries (China, Germany, Italy, Norway, and the United States),\nemphasizing the need for a methodology that identifies key usage\nbehaviors for regulatory compliance testing. A data-driven framework\nwas introduced to predict battery age _𝑡_ and cumulative usage _𝑢_ at\nintersections with regulatory boundaries, estimate SoH at these points,\nand cluster vehicles into representative aging groups. Validation on\nthe Volkswagen AG fleet and _Center_ _for_ _Advanced_ _Life_ _Cycle_ _Engi-_\n_neering_ (CALCE) datasets achieved clustering scores of _Homogeneity_\n0.9157 and _Completeness_ 0.9509. Unlike software frameworks providing\nimplemented modular components, this work conceptually integrates\nestablished techniques, regulatory boundary prediction, SoH estimation, and behavioral clustering, into a cohesive analytical pipeline. This\nintegration enables comprehensive analysis linking battery aging to\nusage behavior and regulatory compliance, facilitating interpretability\nand adaptability to evolving operational and regulatory contexts. While the methodology shows strong potential, limitations such as\nreliance on single-view clustering and sensitivity to sampling frequency\nremain. Future work should incorporate multi-view clustering to capture multiple dimensions of usage behavior (e.g., charging, discharging,\nrest time or temperature), knee-point detection for improved lifetime\nprediction, and advanced machine learning models for intersection\nestimation. The modular design of the framework allows these enhancements to be integrated as drop-in replacements without altering\nthe overall structure. Thus, the main contribution lies in the integrative framework and its validation on large-scale fleet and laboratory _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Table** **8**\nExemplary aggregated data matrix which covers the frequency of occurrence\nbetween the Start SoC and End SoC. Frequency of occurrence End SoC in % _<_ 10 10–50 50–90 _>_ 90 Start SoC in % _<_ 10 _𝐴𝑖_ =0 _,𝑗_ =0 ... ... _𝐴𝑖_ =0 _,𝑗_ =3\n10–50 n.a. ⋮ ⋮ ⋮\n50–90 n.a. n.a. ⋮ ⋮ _>_ 90 n.a. n.a. n.a. _𝐴𝑖_ =3 _,𝑗_ =3 **Table** **9**\nExemplary aggregated data matrix which covers the frequency of occurrence\nof the _𝛥_ SoC during driving. Frequency of occurrence _𝛥_ SoC in % _<_ 1 _<_ 2 _<_ 5 ≥ 5",
      "page_num": 18,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 588
    },
    {
      "text": "_<_ 1 _<_ 2 _<_ 5 ≥ 5 Charging (= _̂_ Recuperation) _𝐴𝑖_ =0 _,𝑗_ =0 ... ... _𝐴𝑖_ =0 _,𝑗_ =3\nDischarging _𝐴𝑖_ =1 _,𝑗_ =0 ... ... _𝐴𝑖_ =1 _,𝑗_ =3 data, while the specific algorithmic choices should be regarded as\nplaceholders that demonstrate feasibility. Beyond regulatory compliance, the framework offers broad applicability including charging infrastructure optimization, vehicle-to-X\ncapabilities, and power grid planning. Its adaptable nature makes it\nsuitable for other domains where fleet data and lifetime-relevant _Key_\n_Performance_ _Indicator_ s (KPIs) exist, provided domain-specific factors are\naccounted for during feature engineering. Overall, this work presents\na systematic, scalable approach to link real-world vehicle usage with\nbattery aging dynamics, providing actionable insights for industry and\nresearch in the evolving landscape of electric mobility regulations. **CRediT** **authorship** **contribution** **statement** **Robin** **Saam:** Writing  - original draft, Visualization, Software,\nMethodology, Conceptualization. **Ludwig** **Hagen** **Letzig:** Writing original draft, Visualization, Methodology. **Jens** **Grabow:** Writing review & editing, Conceptualization. **Ralf** **Benger:** Writing - review\n& editing, Conceptualization. **Ines** **Hauer:** Writing - review & editing,\nSupervision. **Funding** This research was funded by Volkswagen AG. The findings, interpretations, and conclusions presented in this publication do not necessarily\nreflect the views of Volkswagen Aktiengesellschaft. Volkswagen AG had\nno influence on the research process or its outcomes. **Declaration** **of** **competing** **interest** The authors declare that they have no known competing financial interests or personal relationships that could have appeared to\ninfluence the work reported in this paper. **Acknowledgment** We acknowledge financial support by the Open Access Publishing\nFund of Clausthal University of Technology. **Appendix** See Figs. 15–17 and Tables 8 and 9. 17",
      "page_num": 18,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 487
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **15.** Mean Squared Error in days for predicting the day intersection across varying boundary cutoffs and dataset fractions. **Fig.** **16.** Mean Squared Error in cycles for predicting the cycle intersection across varying boundary cutoffs and dataset fractions. 18",
      "page_num": 19,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 89
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ **Fig.** **17.** Visualization of three different clusters determined by the methodology. Each line represents one DUT of the cluster. **Data** **availability** The data will not be made available due to the sensitivity of the\ndata for Volkswagen AG and the privacy of the customers. Data sharing\nmay be considered upon reasonable request and subject to approval\nby the appropriate legal entities within Volkswagen AG. Nevertheless,\nthe CALCE dataset used for the majority of testing can be found at the\n_Center_ _for_ _Advanced_ _Life_ _Cycle_ _Engineering_ (CALCE) at the University of\nMaryland [24]. **References** [1] Iser Jurik Caspar, Schadwinkel Alina. Nobelpreis für die Entwicklung von Lithium-Ionen-Akkus: Chemienobelpreis. In: ZEIT. 2019, [https:](https://www.zeit.de/wissen/2019-10/chemienobelpreis-fuer-die-entwicklung-von-lithium-ionen-batterien) [//www.zeit.de/wissen/2019-10/chemienobelpreis-fuer-die-entwicklung-von-](https://www.zeit.de/wissen/2019-10/chemienobelpreis-fuer-die-entwicklung-von-lithium-ionen-batterien) [lithium-ionen-batterien.](https://www.zeit.de/wissen/2019-10/chemienobelpreis-fuer-die-entwicklung-von-lithium-ionen-batterien) [2] Figgener J, Hecht C, Haberschusz D, Bors J, Spreuer KG, Kairies K-P, et al. The development of battery storage systems in Germany: A market review (status 2023). 2022, [http://dx.doi.org/10.48550/arXiv.2203.06762.](http://dx.doi.org/10.48550/arXiv.2203.06762) M, Edström K, Ayerbe E, Berecibar M, Bhowmik A, Castelli IE, et al. Rechargeable batteries of the future—The state of the art from a BATTERY 2030+ perspective. Adv Energy Mater 2022;12. [http://dx.doi.org/10.1002/aenm.](http://dx.doi.org/10.1002/aenm.202102904) [202102904.](http://dx.doi.org/10.1002/aenm.202102904)",
      "page_num": 20,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 599
    },
    {
      "text": "[202102904.](http://dx.doi.org/10.1002/aenm.202102904) S, Barelli L, Baumann M, Peters J, Weil M. Emerging battery tech nologies to boost the clean energy transition. Cham: Springer International Publishing; 2024, [http://dx.doi.org/10.1007/978-3-031-48359-2.](http://dx.doi.org/10.1007/978-3-031-48359-2) [3] Fichtner M, Edström K, Ayerbe E, Berecibar M, Bhowmik A, Castelli IE, et al. [4] Passerini S, Barelli L, Baumann M, Peters J, Weil M. Emerging battery tech [5] International Energy Agency. Global EV outlook 2024. 2024, [https://www.iea.](https://www.iea.org/reports/global-ev-outlook-2024) [org/reports/global-ev-outlook-2024.](https://www.iea.org/reports/global-ev-outlook-2024) [6] European Commission. Regulation of [the](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb6) European Parliment and of the Council on type-approval of motor vehicles [and](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb6) engines and of systems, components and separate technical units intended [for](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb6) such vehicles, with respect to their emissions and battery durability (Euro 7) and repealing Regulations (EC) No 715/2007 and (EC) No 595/2009: EU7. 2022. [11] Volkswagen AG. Neuwagengarantie der Volkswagen AG (Stand 2021). 2021, [https://www.volkswagen.de/idhub/content/dam/onehub_pkw/importers/de/](https://www.volkswagen.de/idhub/content/dam/onehub_pkw/importers/de/fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_Deutschland.pdf) [fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_](https://www.volkswagen.de/idhub/content/dam/onehub_pkw/importers/de/fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_Deutschland.pdf)",
      "page_num": 20,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 591
    },
    {
      "text": "[fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_](https://www.volkswagen.de/idhub/content/dam/onehub_pkw/importers/de/fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_Deutschland.pdf) [Deutschland.pdf.](https://www.volkswagen.de/idhub/content/dam/onehub_pkw/importers/de/fs/2021-09__Neuwagengarantie-Bedingungen_der_Volkswagen_AG_im_Markt_Deutschland.pdf) [12] Tesla Inc. Model S, model X, model 3, model Y: neuwagengarantie. 2024, [https://www.tesla.com/de_de/support/vehicle-warranty.](https://www.tesla.com/de_de/support/vehicle-warranty) [13] Broussely M, Biensan P, Bonhomme F, Blanchard P, Herreyre S, Nechev K, et al. Main aging mechanisms in Li ion batteries. J Power Sources 2005;146:90–6. [http://dx.doi.org/10.1016/j.jpowsour.2005.03.172.](http://dx.doi.org/10.1016/j.jpowsour.2005.03.172) [14] Keil P, Schuster SF, Wilhelm J, Travi J, Hauser A, Karl RC, et al. Calendar aging of lithium-ion batteries. J Electrochem Soc 2016;163:A1872–80. [http:](http://dx.doi.org/10.1149/2.0411609jes) [//dx.doi.org/10.1149/2.0411609jes.](http://dx.doi.org/10.1149/2.0411609jes) [15] Vermeer W, Chandra Mouli GR, Bauer P. A comprehensive review on the characteristics and modeling of lithium-ion battery aging. IEEE Trans Transp Electrification 2022;8:2205–32. [http://dx.doi.org/10.1109/TTE.2021.3138357.](http://dx.doi.org/10.1109/TTE.2021.3138357) [16] von Bülow F. A data-driven fleet service: state of health forecasting of lithium ion batteries. vol. 170, Wiesbaden: Springer Fachmedien Wiesbaden; 2024, [http:](http://dx.doi.org/10.1007/978-3-658-43188-4)",
      "page_num": 20,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 583
    },
    {
      "text": "ion batteries. vol. 170, Wiesbaden: Springer Fachmedien Wiesbaden; 2024, [http:](http://dx.doi.org/10.1007/978-3-658-43188-4) [//dx.doi.org/10.1007/978-3-658-43188-4.](http://dx.doi.org/10.1007/978-3-658-43188-4) [17] Lienkamp M. What will the vehicle [battery](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb17) of the future look like? From Battery Cell to Electric Vehicle. In: Advanced [battery](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb17) power    - Kraftwerk batterie. 2024. [18] Schreiber M, Abo Gamra K, Bilfinger P, Teichert O, Schneider J, Kröger T, et al. Understanding lithium-ion battery degradation in vehicle applications: Insights from realistic and accelerated aging tests using Volkswagen ID.3 pouch cells. J Energy Storage 2025;112:115357. [http://dx.doi.org/10.1016/j.est.2025.115357.](http://dx.doi.org/10.1016/j.est.2025.115357) [19] Geslin A, Xu Le, Ganapathi D, Moy K, Chueh WC, Onori S. Dynamic cycling enhances battery lifetime. Nat Energy 2024. [http://dx.doi.org/10.1038/s41560-](http://dx.doi.org/10.1038/s41560-024-01675-8) [024-01675-8.](http://dx.doi.org/10.1038/s41560-024-01675-8) [20] Saam R, Grabow J, Benger R, Hauer I. Fleet-based behavioral insights for battery electric vehicles: understanding the gap between real-world use and test procedures. 2025, [http://dx.doi.org/10.2139/ssrn.5353433,](http://dx.doi.org/10.2139/ssrn.5353433) Preprint. [21] Nazari M, Hussain A, Musilek P. Applications of clustering methods for different aspects of electric vehicles. Electronics 2023;12:790. [http://dx.doi.org/10.3390/](http://dx.doi.org/10.3390/electronics12040790) [electronics12040790.](http://dx.doi.org/10.3390/electronics12040790)",
      "page_num": 20,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "[electronics12040790.](http://dx.doi.org/10.3390/electronics12040790) [22] Forte M, Guzman CP, Pereira L, Morais H. A comprehensive review of clustering methods applications in electric mobility. Transp Eng 2025;21:100360. [http:](http://dx.doi.org/10.1016/j.treng.2025.100360) [//dx.doi.org/10.1016/j.treng.2025.100360.](http://dx.doi.org/10.1016/j.treng.2025.100360) [23] European Commission, editor. [REGULATION](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb23) (EU) 2023/1542 of the EUROPEAN PARLIAMENT and of the COUNCIL: of [12](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb23) 2023 concerning batteries and waste batteries, amending directive [2008/98/EC](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb23) and regulation (EU) 2019/1020 and repealing directive 2006/66/EC. 2023. [24] Pecht M, Osterman M. Battery accelerated cycle life testing data: Continuous cycling data. 2018, [https://calce.umd.edu/battery-accelerated-cycle-life-testing-](https://calce.umd.edu/battery-accelerated-cycle-life-testing-data) [data.](https://calce.umd.edu/battery-accelerated-cycle-life-testing-data) [25] Hasib SA, Islam S, Chakrabortty RK, Ryan MJ, Saha DK, Ahamed MH, et al. A comprehensive review of available battery datasets, RUL prediction approaches, and advanced battery management. IEEE Access 2021;9:86166–93. [http://dx.doi.](http://dx.doi.org/10.1109/ACCESS.2021.3089032) [org/10.1109/ACCESS.2021.3089032.](http://dx.doi.org/10.1109/ACCESS.2021.3089032) [7] California Air Resource Board. Final [regulation](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb7) order - section 1962.4, title 13, california code of regulations. 2022. [8] United Nations Economic and Social Council. Proposal for amendment",
      "page_num": 20,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 596
    },
    {
      "text": "[8] United Nations Economic and Social Council. Proposal for amendment california code of regulations. 2022. 1 to UN GTR (22) (in-vehicle battery durability for electrified light\nduty vehicles). 2024, [https://unece.org/transport/documents/2024/04/working-](https://unece.org/transport/documents/2024/04/working-documents/grpe-proposal-amendment-1-un-gtr-no-22-vehicle) [documents/grpe-proposal-amendment-1-un-gtr-no-22-vehicle.](https://unece.org/transport/documents/2024/04/working-documents/grpe-proposal-amendment-1-un-gtr-no-22-vehicle) [9] USA, editor. Durability requirements in california advanced clean cars II (ACC II) program: [EVE](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb9) 57. 2022. [10] California Air Resource Board. Final [regulation](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb10) order - section 1962.7, title 13, california code of regulations. 2022. 19",
      "page_num": 20,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 276
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ [26] dos Reis G, Strange C, Yadav M, Li S. Lithium-ion battery data and where to find it. Energy AI 2021;5:100081. [http://dx.doi.org/10.1016/j.egyai.2021.100081.](http://dx.doi.org/10.1016/j.egyai.2021.100081) [27] Tan R, Hong W, Tang J, Lu X, Ma R, Zheng X, et al. BatteryLife: a comprehensive it. Energy AI 2021;5:100081. [http://dx.doi.org/10.1016/j.egyai.2021.100081.](http://dx.doi.org/10.1016/j.egyai.2021.100081) dataset and benchmark for battery life prediction. 2025, [http://dx.doi.org/10.](http://dx.doi.org/10.48550/arXiv.2502.18807) [48550/arXiv.2502.18807.](http://dx.doi.org/10.48550/arXiv.2502.18807) [28] Geisser S. Predictive inference: an introduction. Routledge; 2017, [http://dx.doi.](http://dx.doi.org/10.1201/9780203742310) [org/10.1201/9780203742310.](http://dx.doi.org/10.1201/9780203742310) [29] Gentle JE, Kaufman L, Rousseuw PJ. Finding groups in data: An introduction to cluster analysis. Biometrics 1991;47:788. [http://dx.doi.org/10.2307/2532178.](http://dx.doi.org/10.2307/2532178) [30] Xu D, Tian Y. A comprehensive survey of clustering algorithms. Ann Data Sci 2015;2:165–93. [http://dx.doi.org/10.1007/s40745-015-0040-1.](http://dx.doi.org/10.1007/s40745-015-0040-1) [31] Yin H, Aryani A, Petrie S, Nambissan A, Astudillo A, Cao S. A rapid review cluster analysis. Biometrics 1991;47:788. [http://dx.doi.org/10.2307/2532178.](http://dx.doi.org/10.2307/2532178)",
      "page_num": 21,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "cluster analysis. Biometrics 1991;47:788. [http://dx.doi.org/10.2307/2532178.](http://dx.doi.org/10.2307/2532178) 2015;2:165–93. [http://dx.doi.org/10.1007/s40745-015-0040-1.](http://dx.doi.org/10.1007/s40745-015-0040-1) of clustering algorithms. 2024, [http://dx.doi.org/10.48550/arXiv.2401.07389,](http://dx.doi.org/10.48550/arXiv.2401.07389) [http://arxiv.org/pdf/2401.07389v1.](http://arxiv.org/pdf/2401.07389v1) JB. Some methods for classification and analysis of multivariate obser vations: Proceedings of the fifth Berkeley symposium on mathematical statistics and probability. 1967, [https://api.semanticscholar.org/CorpusID:6278891.](https://api.semanticscholar.org/CorpusID:6278891) [32] MacQueen JB. Some methods for classification and analysis of multivariate obser [33] Bezdek JC, Ehrlich R, Full W. FCM: The fuzzy c-means clustering algorithm. Com put Geosci 1984;10:191–203. [http://dx.doi.org/10.1016/0098-3004(84)90020-](http://dx.doi.org/10.1016/0098-3004(84)90020-7) [7.](http://dx.doi.org/10.1016/0098-3004(84)90020-7) Y, Wang B, Chu C-C, Gadh R. Electric vehicle driver clustering using statistical model and machine learning. 2018, [http://dx.doi.org/10.48550/arXiv.](http://dx.doi.org/10.48550/arXiv.1802.04193) [1802.04193.](http://dx.doi.org/10.48550/arXiv.1802.04193) [34] Xiong Y, Wang B, Chu C-C, Gadh R. Electric vehicle driver clustering using [35] Märtz A, Langenmayr U, Ried S, Seddig K, Jochem P. Charging behavior of electric vehicles: Temporal clustering based on real-world data. Energies 2022;15:6575. [http://dx.doi.org/10.3390/en15186575.](http://dx.doi.org/10.3390/en15186575)",
      "page_num": 21,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 598
    },
    {
      "text": "2022;15:6575. [http://dx.doi.org/10.3390/en15186575.](http://dx.doi.org/10.3390/en15186575) A, Zhang G, Tian C, Peng W, Liu Y. Charging behavior portrait of electric vehicle users based on fuzzy C-means clustering algorithm. Energies 2024;17:1651. [http://dx.doi.org/10.3390/en17071651.](http://dx.doi.org/10.3390/en17071651) M, Guzman CP, Lekidis A, Morais H. Clustering methodologies for flexi bility characterization of electric vehicles supply equipment. Green Energy Intell Transp 2025;100304. [http://dx.doi.org/10.1016/j.geits.2025.100304.](http://dx.doi.org/10.1016/j.geits.2025.100304) V-H, Hussain A, Zarrabian S, Kump PM, Su W. Clustering-based optimal operation of charging stations under high penetration of electric vehicles. Sustain Energy, Grids Networks 2023;36:101178. [http://dx.doi.org/10.1016/j.](http://dx.doi.org/10.1016/j.segan.2023.101178) [segan.2023.101178.](http://dx.doi.org/10.1016/j.segan.2023.101178) MR, Lu Q-C, Hussain A, Tripura S, Xu P-C, Wang S. Location opti mization of EV charging stations: A custom K-means cluster algorithm approach. Energy Rep 2024;12:5367–82. [http://dx.doi.org/10.1016/j.egyr.2024.09.075.](http://dx.doi.org/10.1016/j.egyr.2024.09.075) _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ [51] Li W, Zhang H, van Vlijmen B, Dechent P, Sauer DU. Forecasting battery capacity and power degradation with multi-task learning. Energy Storage Mater 2022;53:453–66. [http://dx.doi.org/10.1016/j.ensm.2022.09.013.](http://dx.doi.org/10.1016/j.ensm.2022.09.013) [52] O’Kane SEJ, Ai W, Madabattula G, Alonso-Alvarez D, Timms R, Sulzer V, et al. Lithium-ion battery degradation: how to model it. Phys Chem Chem Phys : PCCP",
      "page_num": 21,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 595
    },
    {
      "text": "Lithium-ion battery degradation: how to model it. Phys Chem Chem Phys : PCCP 2022;24:7909–22. [http://dx.doi.org/10.1039/D2CP00417H.](http://dx.doi.org/10.1039/D2CP00417H) [53] Zhang M, Yang D, Du J, Sun H, Li L, Wang L, et al. A review of SOH prediction of li-ion batteries based on data-driven algorithms. Energies 2023;16:3167. [http:](http://dx.doi.org/10.3390/en16073167) [//dx.doi.org/10.3390/en16073167.](http://dx.doi.org/10.3390/en16073167) [54] Rumelhart DE, Hinton GE, Williams RJ. Learning internal representations by error propagation. In: Readings in cognitive science. Elsevier; 1988, p. 399–421. [http://dx.doi.org/10.1016/B978-1-4832-1446-7.50035-2.](http://dx.doi.org/10.1016/B978-1-4832-1446-7.50035-2) [55] Hochreiter S, Schmidhuber J. Long short-term memory. Neural Comput 1997;9:1735–80. [http://dx.doi.org/10.1162/neco.1997.9.8.1735.](http://dx.doi.org/10.1162/neco.1997.9.8.1735) [56] Cho K, van Merrienboer B, Bahdanau D, Bengio Y. In: Wu D, editor. On the properties of neural machine translation: encoder–decoder approaches. PA, USA: Stroudsburg; 2014, p. 103–11, [http://dx.doi.org/10.3115/v1/W14-4012.](http://dx.doi.org/10.3115/v1/W14-4012) [57] Arbaoui S, Samet A, Ayadi A, Mesbahi T, Boné R. Data-driven strategy for state of health prediction and anomaly detection in lithium-ion batteries. Energy AI 2024;17:100413. [http://dx.doi.org/10.1016/j.egyai.2024.100413.](http://dx.doi.org/10.1016/j.egyai.2024.100413) [58] Lee J, Sun H, Liu Y, Li X. A machine learning framework for remaining useful lifetime prediction of li-ion batteries using diverse neural networks. Energy AI",
      "page_num": 21,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "lifetime prediction of li-ion batteries using diverse neural networks. Energy AI 2024;15:100319. [http://dx.doi.org/10.1016/j.egyai.2023.100319.](http://dx.doi.org/10.1016/j.egyai.2023.100319) [59] Li X, Lyv M, Gao X, Li K, Zhu Y. A co-estimation framework of state of health and remaining useful life for lithium-ion batteries using the semi-supervised learning algorithm. Energy AI 2025;19:100458. [http://dx.doi.org/10.1016/j.egyai.2024.](http://dx.doi.org/10.1016/j.egyai.2024.100458) [100458.](http://dx.doi.org/10.1016/j.egyai.2024.100458) [60] Zou J, Gao Y, Frieges MH, Börner MF, Kampker A, Li W. Machine learning for battery quality classification and lifetime prediction using formation data. Energy AI 2024;18:100451. [http://dx.doi.org/10.1016/j.egyai.2024.100451.](http://dx.doi.org/10.1016/j.egyai.2024.100451) [61] Breiman L. Random forests. 2001, [https://www.stat.berkeley.edu/breiman/](https://www.stat.berkeley.edu/breiman/randomforest2001.pdf) [randomforest2001.pdf.](https://www.stat.berkeley.edu/breiman/randomforest2001.pdf) [62] Liaw A, Wiener M. Classification and regression by randomForest. 2002, [https:](https://journal.r-project.org/articles/RN-2002-022/RN-2002-022.pdf) [36] Yang A, Zhang G, Tian C, Peng W, Liu Y. Charging behavior portrait of [37] Forte M, Guzman CP, Lekidis A, Morais H. Clustering methodologies for flexi [38] Bui V-H, Hussain A, Zarrabian S, Kump PM, Su W. Clustering-based optimal [39] Abdullahi MR, Lu Q-C, Hussain A, Tripura S, Xu P-C, Wang S. Location opti [40] Fotouhi A, Montazeri-Gh M. Tehran driving cycle development using the k-means",
      "page_num": 21,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 547
    },
    {
      "text": "[40] Fotouhi A, Montazeri-Gh M. Tehran driving cycle development using the k-means clustering method. 2013, [http://dx.doi.org/10.1016/j.scient.2013.04.001.](http://dx.doi.org/10.1016/j.scient.2013.04.001) [41] Yuhui P, Yuan Z, Huibao Y. Development of a representative driving cycle for ur ban buses based on the K-means cluster method. Clust Comput 2019;22:6871–80. [http://dx.doi.org/10.1007/s10586-017-1673-y.](http://dx.doi.org/10.1007/s10586-017-1673-y) D, Dufford B, Martin S, Negoita GA, Yen M, Paxton WA. Graph based two-level clustering for electric vehicle usage patterns. Energy AI 2025;21:100539. [http://dx.doi.org/10.1016/j.egyai.2025.100539.](http://dx.doi.org/10.1016/j.egyai.2025.100539) W, Chen S, Peng X, Xiao M, Gao L, Garg A, et al. A comprehensive approach for the clustering of similar-performance cells for the design of a lithium-ion battery module for electric vehicles. Engineering 2019;5:795–802. [http://dx.doi.org/10.1016/j.eng.2019.07.005.](http://dx.doi.org/10.1016/j.eng.2019.07.005) A, Zhou Z, Chen S, Nie P, Qian K, Li Z, et al. Data–driven fast clustering of second–life lithium–Ion battery: Mechanism and algorithm. Adv Theory Simulations 2020;3. [http://dx.doi.org/10.1002/adts.202000109.](http://dx.doi.org/10.1002/adts.202000109) Q, Tian J, Yan Z, Li X, Pan T. Classification of lithium-ion batteries based on impedance spectrum features and an improved K-means algorithm. Batteries 2023;9:491. [http://dx.doi.org/10.3390/batteries9100491.](http://dx.doi.org/10.3390/batteries9100491) [//journal.r-project.org/articles/RN-2002-022/RN-2002-022.pdf.](https://journal.r-project.org/articles/RN-2002-022/RN-2002-022.pdf)",
      "page_num": 21,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 581
    },
    {
      "text": "[//journal.r-project.org/articles/RN-2002-022/RN-2002-022.pdf.](https://journal.r-project.org/articles/RN-2002-022/RN-2002-022.pdf) [63] Borup D, Christensen BJ, Mühlbach NS, Nielsen MS. Targeting predictors in random forest regression. Int J Forecast 2023;39:841–68. [http://dx.doi.org/10.](http://dx.doi.org/10.1016/j.ijforecast.2022.02.010) [1016/j.ijforecast.2022.02.010.](http://dx.doi.org/10.1016/j.ijforecast.2022.02.010) [64] Byrd RH, Lu P, Nocedal J, Zhu C. A limited memory algorithm for bound constrained optimization. SIAM J Sci Comput 1995;16:1190–208. [http://dx.doi.](http://dx.doi.org/10.1137/0916069) [org/10.1137/0916069.](http://dx.doi.org/10.1137/0916069) [65] Schaal Sebastian. Produktionsstart des ID.3: VW leitet den Systemwechsel zur E-Mobilität ein, electrive.net. 2019, [https://www.electrive.net/2019/11/04/](https://www.electrive.net/2019/11/04/produktionsstart-des-id-3-vw-leitet-den-systemwechsel-zur-e-mobilitaet-ein/) [produktionsstart-des-id-3-vw-leitet-den-systemwechsel-zur-e-mobilitaet-ein/.](https://www.electrive.net/2019/11/04/produktionsstart-des-id-3-vw-leitet-den-systemwechsel-zur-e-mobilitaet-ein/) [66] Volkswagen AG. Geschäftsbericht 2020. 2021, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2020-2093) [com/de/publikationen/weitere/geschaeftsbericht-2020-2093.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2020-2093) [67] Volkswagen AG. Geschäftsbericht 2021. 2022, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2021-1791)",
      "page_num": 21,
      "chunk_index": 6,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "[67] Volkswagen AG. Geschäftsbericht 2021. 2022, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2021-1791) [com/de/publikationen/weitere/geschaeftsbericht-2021-1791.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2021-1791) [68] Volkswagen AG. Geschäftsbericht 2022. 2023, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-volkswagen-ag-2022-2148) [com/de/publikationen/weitere/geschaeftsbericht-volkswagen-ag-2022-2148.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-volkswagen-ag-2022-2148) [69] Volkswagen AG. Geschäftsbericht 2023. 2024, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2023-2671) [com/de/publikationen/weitere/geschaeftsbericht-2023-2671.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2023-2671) [70] Volkswagen AG. Geschäftsbericht 2024. 2025, [https://www.volkswagen-group.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2024-2931) intervalle bei iD. modellen. 2024, [https://www.volkswagen.de/de/besitzer-](https://www.volkswagen.de/de/besitzer-und-service/service-und-ersatzteile/inspektion-und-hu-au.html/__layer/layers/as-4/service-und-ersatzteile/inspektion-und-hu-au/inspektionsintervalle-fuer-hybrid-und-elektrofahrzeuge/master.layer#inspektion-hybrid-elektro)",
      "page_num": 21,
      "chunk_index": 7,
      "section_name": "Content",
      "token_count": 511
    },
    {
      "text": "[und-service/service-und-ersatzteile/inspektion-und-hu-au.html/__layer/layers/as-](https://www.volkswagen.de/de/besitzer-und-service/service-und-ersatzteile/inspektion-und-hu-au.html/__layer/layers/as-4/service-und-ersatzteile/inspektion-und-hu-au/inspektionsintervalle-fuer-hybrid-und-elektrofahrzeuge/master.layer#inspektion-hybrid-elektro) [4/service-und-ersatzteile/inspektion-und-hu-au/inspektionsintervalle-fuer-hybrid-](https://www.volkswagen.de/de/besitzer-und-service/service-und-ersatzteile/inspektion-und-hu-au.html/__layer/layers/as-4/service-und-ersatzteile/inspektion-und-hu-au/inspektionsintervalle-fuer-hybrid-und-elektrofahrzeuge/master.layer#inspektion-hybrid-elektro) [und-elektrofahrzeuge/master.layer#inspektion-hybrid-elektro.](https://www.volkswagen.de/de/besitzer-und-service/service-und-ersatzteile/inspektion-und-hu-au.html/__layer/layers/as-4/service-und-ersatzteile/inspektion-und-hu-au/inspektionsintervalle-fuer-hybrid-und-elektrofahrzeuge/master.layer#inspektion-hybrid-elektro) [72] Szczuka C, Sletbjerg P, Bruchhausen M. Performance and durability re [42] Balaram D, Dufford B, Martin S, Negoita GA, Yen M, Paxton WA. Graph [43] Li W, Chen S, Peng X, Xiao M, Gao L, Garg A, et al. A comprehensive [44] Ran A, Zhou Z, Chen S, Nie P, Qian K, Li Z, et al. Data–driven fast clustering [com/de/publikationen/weitere/geschaeftsbericht-2024-2931.](https://www.volkswagen-group.com/de/publikationen/weitere/geschaeftsbericht-2024-2931) [71] Volkswagen AG. Die inspektionsintervalle für hybrid- und elektrofahrzeuge: [45] Zhang Q, Tian J, Yan Z, Li X, Pan T. Classification of lithium-ion batteries based [46] Wang C, Chen Y, Zhang Q, Zhu J. Dynamic early recognition of abnormal",
      "page_num": 21,
      "chunk_index": 8,
      "section_name": "Content",
      "token_count": 584
    },
    {
      "text": "[46] Wang C, Chen Y, Zhang Q, Zhu J. Dynamic early recognition of abnormal lithium-ion batteries before capacity drops using self-adaptive quantum cluster\ning. Appl Energy 2023;336:120841. [http://dx.doi.org/10.1016/j.apenergy.2023.](http://dx.doi.org/10.1016/j.apenergy.2023.120841) [120841.](http://dx.doi.org/10.1016/j.apenergy.2023.120841) [47] Zafar R, Huang P, Sun Y. Enhancing electric vehicle charging load prediction in data-scarce scenarios: A hybrid deep learning-based approach integrating clustering analysis and transfer learning. Energy AI 2025;21:100545. [http://dx.](http://dx.doi.org/10.1016/j.egyai.2025.100545) [doi.org/10.1016/j.egyai.2025.100545.](http://dx.doi.org/10.1016/j.egyai.2025.100545) Z, Meng B, Pan R, Zhou J. An enhanced sorting framework for retired batter ies based on multi-dimensional features and an integrated clustering approach. Energy AI 2025;22:100612. [http://dx.doi.org/10.1016/j.egyai.2025.100612.](http://dx.doi.org/10.1016/j.egyai.2025.100612) quirements in the batteries regulation. 2024, [http://dx.doi.org/10.2760/](http://dx.doi.org/10.2760/289331) [289331,](http://dx.doi.org/10.2760/289331) [https://op.europa.eu/en/publication-detail/-/publication/3fcf6f9d-c95b-](https://op.europa.eu/en/publication-detail/-/publication/3fcf6f9d-c95b-11ee-95d9-01aa75ed71a1) [11ee-95d9-01aa75ed71a1.](https://op.europa.eu/en/publication-detail/-/publication/3fcf6f9d-c95b-11ee-95d9-01aa75ed71a1) [73] Dubarry M, Qin N, Brooker P. Calendar aging of commercial li-ion cells of different chemistries    - A review. Curr Opin Electrochem 2018;9:106–13. [http:](http://dx.doi.org/10.1016/j.coelec.2018.05.023)",
      "page_num": 21,
      "chunk_index": 9,
      "section_name": "Content",
      "token_count": 588
    },
    {
      "text": "different chemistries    - A review. Curr Opin Electrochem 2018;9:106–13. [http:](http://dx.doi.org/10.1016/j.coelec.2018.05.023) [//dx.doi.org/10.1016/j.coelec.2018.05.023.](http://dx.doi.org/10.1016/j.coelec.2018.05.023) [74] Arunachala R. Influence of cell size on performance and lifetime of lithium-ion [48] Liu Z, Meng B, Pan R, Zhou J. An enhanced sorting framework for retired batter batteries. München: [Universitätsbibliothek](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb74) der TU München; 2018. [75] Nobis C, Kuhnimhof T. Mobilitaet in [deutschland-](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb75) MiD: ergebnisbericht. 2018. [76] Guo Z, Chen Z. Aging property for LiFePO4/graphite cell with different tem [49] Ullmann T. Evaluation of clustering results and novel cluster algorithms [Ph.D. thesis], Ludwig-Maximilians-Universität München; 2022, [http://dx.doi.org/10.](http://dx.doi.org/10.5282/edoc.31273) [5282/edoc.31273.](http://dx.doi.org/10.5282/edoc.31273) [50] Liu Y, Li Z, Xiong H, Gao X, Wu J. Understanding of internal clustering validation measures. In: 2010 IEEE international conference on data mining. IEEE; 2010, p. 911–6. [http://dx.doi.org/10.1109/ICDM.2010.35.](http://dx.doi.org/10.1109/ICDM.2010.35) perature and DODs. Russ J Electrochem 2016;52:546–54. [http://dx.doi.org/10.](http://dx.doi.org/10.1134/S1023193516060045) [1134/S1023193516060045.](http://dx.doi.org/10.1134/S1023193516060045)",
      "page_num": 21,
      "chunk_index": 10,
      "section_name": "Content",
      "token_count": 545
    },
    {
      "text": "[1134/S1023193516060045.](http://dx.doi.org/10.1134/S1023193516060045) [77] Bundesamt Kraftfahrt. Verkehr in [kilometern](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb77) (VK): Zeitreihe von 2014–2024. [2025.](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb77) [78] Oguchi M, Fuse M. Regional and longitudinal estimation of product lifespan distribution: a case study for automobiles and a simplified estimation method. Environ Sci Technol 2015;49:1738–43. [http://dx.doi.org/10.1021/es505245q.](http://dx.doi.org/10.1021/es505245q) [2025.](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb77) [78] Oguchi M, Fuse M. Regional and longitudinal estimation of product lifespan 20",
      "page_num": 21,
      "chunk_index": 11,
      "section_name": "Content",
      "token_count": 246
    },
    {
      "text": "_R._ _Saam_ _et_ _al._ [79] Hodge V, Austin J. A survey of outlier detection methodologies. Artif Intell Rev 2004;22:85–126. [http://dx.doi.org/10.1023/B:AIRE.0000045502.10941.a9.](http://dx.doi.org/10.1023/B:AIRE.0000045502.10941.a9) [80] Souiden I, Omri MN, Brahmi Z. A survey of outlier detection in high dimensional _Energy_ _and_ _AI_ _24_ _(2026)_ _100669_ [87] Lin X, Park J, Liu L, Lee Y, Sastry AM, Lu W. A comprehensive capacity fade model and analysis for li-ion batteries. J Electrochem Soc 2013;160:A1701–10. [http://dx.doi.org/10.1149/2.040310jes.](http://dx.doi.org/10.1149/2.040310jes) [88] Hubert L, Arabie P. Comparing partitions. J Classification 1985;2:193–218. [http:](http://dx.doi.org/10.1007/BF01908075) data streams. Comput Sci Rev 2022;44:100463. [http://dx.doi.org/10.1016/j.](http://dx.doi.org/10.1016/j.cosrev.2022.100463) [cosrev.2022.100463.](http://dx.doi.org/10.1016/j.cosrev.2022.100463) [81] Bundesamt Kraftfahrt. Halter 2024: [Bestand](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb81) an kraftfahrzeugen und kraftfahrzeu ganhängern nach [haltergruppen](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb81) und wirtschaftszweigen. 2024. [82] Bundesamt Kraftfahrt. Besitzumschreibungen: Zahlen des Jahres 2023 im Überblick. 2023, [https://www.kba.de/DE/Statistik/Fahrzeuge/](https://www.kba.de/DE/Statistik/Fahrzeuge/Besitzumschreibungen/besitzumschreibungen_node.html) [Besitzumschreibungen/besitzumschreibungen_node.html.](https://www.kba.de/DE/Statistik/Fahrzeuge/Besitzumschreibungen/besitzumschreibungen_node.html)",
      "page_num": 22,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 594
    },
    {
      "text": "[Besitzumschreibungen/besitzumschreibungen_node.html.](https://www.kba.de/DE/Statistik/Fahrzeuge/Besitzumschreibungen/besitzumschreibungen_node.html) [83] Joseph VR. Optimal ratio for data splitting. Stat Anal Data Min: ASA Data Sci J 2022;15:531–8. [http://dx.doi.org/10.1002/sam.11583.](http://dx.doi.org/10.1002/sam.11583) [84] Sivakumar M, Parthasarathy S, Padmapriya T. Trade-off between training and testing ratio in machine learning for medical image processing. PeerJ Comput Sci 2024;10:e2245. [http://dx.doi.org/10.7717/peerj-cs.2245.](http://dx.doi.org/10.7717/peerj-cs.2245) [85] Keil P. Aging of lithium-ion batteries in [electric](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb85) vehicles [Dissertation], München: Universitätsbibliothek [der](http://refhub.elsevier.com/S2666-5468(25)00201-0/sb85) TU München; 2017. [86] Sivalertporn K, Poopanya P, Phophongviwat T. Capacity forecasting of [//dx.doi.org/10.1007/BF01908075.](http://dx.doi.org/10.1007/BF01908075) [89] Strehl A, Ghosh J. Cluster ensembles–a knowledge reuse framework for com bining partitionings. 2002, [https://www.jmlr.org/papers/volume3/strehl02a/](https://www.jmlr.org/papers/volume3/strehl02a/strehl02a.pdf) [strehl02a.pdf.](https://www.jmlr.org/papers/volume3/strehl02a/strehl02a.pdf) [90] Rosenberg A, Hirschberg J. V-measure: a conditional entropy-based external cluster evaluation measure. 2007, [https://aclanthology.org/D07-1043.pdf.](https://aclanthology.org/D07-1043.pdf) [91] Chao G, Sun S, Bi J. A survey on multi-view clustering. 2017, [http://dx.doi.org/](http://dx.doi.org/10.48550/arXiv.1712.06246)",
      "page_num": 22,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 576
    },
    {
      "text": "[91] Chao G, Sun S, Bi J. A survey on multi-view clustering. 2017, [http://dx.doi.org/](http://dx.doi.org/10.48550/arXiv.1712.06246) [10.48550/arXiv.1712.06246.](http://dx.doi.org/10.48550/arXiv.1712.06246) [92] Moujahid A, Dornaika F. Advanced unsupervised learning: a comprehensive overview of multi-view clustering techniques. Artif Intell Rev 2025;58. [http:](http://dx.doi.org/10.1007/s10462-025-11240-8) [//dx.doi.org/10.1007/s10462-025-11240-8.](http://dx.doi.org/10.1007/s10462-025-11240-8) lithium-ion batteries using empirical models: Toward efficient SOH estimation with limited cycle data. Energies 2025;18:3828. [http://dx.doi.org/10.3390/](http://dx.doi.org/10.3390/en18143828) [en18143828.](http://dx.doi.org/10.3390/en18143828) 21",
      "page_num": 22,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 286
    }
  ],
  "total_chunks": 74,
  "created_at": "2026-02-04 14:04:56"
}