{
  "filename": "batteries-10-00119.pdf",
  "chunks": [
    {
      "text": "_Article_",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "**_batteries_**",
      "token_count": 4
    },
    {
      "text": "**William Wheeler** **[1,2,]** ***** **, Yann Bultel** **[3]** **, Pascal Venet** **[1]** **, Ali Sari** **[1]** **and Elie Riviere** **[4]** 1 Universite Claude Bernard Lyon 1, Ampère, UMR5005, INSA Lyon, Ecole Centrale de Lyon, CNRS,\nF-69100 Villeurbanne, France; pascal.venet@univ-lyon1.fr (P.V.); ali.sari@univ-lyon1.fr (A.S.)\n2 EIGSI La Rochelle, EIGSI Lab., F-17000 La Rochelle, France\n3 Univ. Grenoble Alpes, Univ. Savoie Mont Blanc, CNRS, Grenoble INP, LEPMI, F-38000 Grenoble, France;\nyann.bultel@grenoble-inp.fr\n4 EVE System, F-69440 Taluyers, France; elie.riviere@eve-system.com ***** Correspondence: william.wheeler@eigsi.fr **Abstract:** Second-life applications for lithium-ion batteries offer industry opportunities to defer\nrecycling costs, enhance economic value, and reduce environmental impacts. However, cells are\naffected by numerous aging phenomena which can lead to an acceleration in capacity loss. This paper\nuses postmortem techniques to compare aging phenomenon in 1.1 Ah 18650 graphite/LFP cells,\nexamining the differences between a pristine cell and three cells aged to 40~30% of state of health\n(SoH). Macroscopic and microscopic techniques are used to identify aging phenomenon occurring\nin the cell on both positive and negative electrodes. Energy-dispersive X-ray spectroscopy (EDXS)\nand scanning electron microscopes (SEMs) with back-scattered electron (BSE) detector are used to\nanalyze each electrode. These methods are used to analyze the morphology and the material on each\nelectrode. The results show a stable positive LFP electrode whereas numerous deposits and cracking\noccurred on the negative electrode. A discussion of the appearance of those aging phenomenon is\npresented. Impacts for industrial cells in second-life applications are finally discussed. **Keywords:** aging; second life; postmortem; SEM; EDXS; lithium-ion; G/LFP **Citation:** Wheeler, W.; Bultel, Y.; Venet, P.; Sari, A.; Riviere, E. Postmortem Analysis of 18650 Graphite/LFP Cells in a Long-Term Aging Study for Second-Life Applications. _Batteries_ **2024**, _10_, 119. [https://doi.org/10.3390/](https://doi.org/10.3390/batteries10040119)",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "**Postmortem Analysis of 18650 Graphite/LFP Cells in a** **Long-Term Aging Study for Second-Life Applications**",
      "token_count": 590
    },
    {
      "text": "[https://doi.org/10.3390/](https://doi.org/10.3390/batteries10040119) [batteries10040119](https://doi.org/10.3390/batteries10040119) Academic Editor: Carlos Ziebert Received: 14 February 2024 Revised: 11 March 2024 Accepted: 20 March 2024 Published: 2 April 2024 **Copyright:** © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons [Attribution (CC BY) license (https://](https://creativecommons.org/licenses/by/4.0/) [creativecommons.org/licenses/by/](https://creativecommons.org/licenses/by/4.0/) 4.0/). **1. Introduction** Lithium-ion batteries are widely used in electric vehicles (EV). The lifespan of EV\nbatteries is limited and varies based on the selected chemistry, storage conditions, and use.\nThe literature suggests a capacity decrease of 20% to 30% for an EV at the end of its first\nlife. Batteries still retain 70% to 80% of their initial capacity [1,2]. Batteries from EV can\nbe reused in second-life applications for 70% to 40% of their cell nominal capacity. It is an\nopportunity to postpone recycling and reduce the environmental impact.\nMost of the aging studies on lithium-ion cell focus on their use in EV. However,\nlithium-ion cells can be impacted by various aging mechanisms, some of which are known\nto cause an acceleration in the loss of capacity after hundreds or thousands of cycles. The\nacceleration in capacity fade, also called aging-knee, may reduce the lifespan in secondlife applications and reduce the benefits of reuse of lithium-ion cells. All lithium-ion\ncells—lithium iron phosphate (LFP), lithium manganese oxide (LMO), or lithium nickel\nmanganese cobalt oxides (NMC)—may encounter an acceleration in capacity fade [3–9].\nThe acceleration in capacity fade apparition depends on several factors: cell chemistry,\ntemperature of use, current, and depth of discharge [9]. A review by Peter et al. discusses\nthis phenomenon and gives some postmortem analyses of cells undergoing this acceleration\nin capacity fade [9]. Those studies point out a possible acceleration in capacity fade that\ncould prevent a reuse in second-life applications due to a low capacity or a limited number\nof operating cycles. A review of non-invasive diagnosis techniques has been published by\nCarlos et al. to analyze lithium-ion cells using electric data [10]. A pic tracking technique is",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "**Postmortem Analysis of 18650 Graphite/LFP Cells in a** **Long-Term Aging Study for Second-Life Applications**",
      "token_count": 564
    },
    {
      "text": "_Batteries_ **2024**, _10_ [, 119. https://doi.org/10.3390/batteries10040119](https://doi.org/10.3390/batteries10040119) [https://www.mdpi.com/journal/batteries](https://www.mdpi.com/journal/batteries)",
      "page_num": 2,
      "chunk_index": 3,
      "section_name": "**Postmortem Analysis of 18650 Graphite/LFP Cells in a** **Long-Term Aging Study for Second-Life Applications**",
      "token_count": 72
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 2 of 15 used by Wheeler et al to diagnose the remaining capacity in a long-term aging study on\nlithium-ion G/LFP cells [11] Those cells are analyzed in this postmortem study.\nThe degradation of a lithium battery is the result of many different aging mechanisms\nwhich can affect the electrodes (the active material, the current collector, the binder  .), the\nelectrolyte, or the separator Birkl et al show the main degradation mechanisms: the solid\nelectrolyte interface (SEI) (growth, decomposition, and cracking); electrodes (cracking, dissolution, exfoliation, and binder decomposition); current collector (corrosion); and lithium\ndendrites (separator drilling and internal short-circuits) [12] Local lithium deposition can\nlead to an increase in capacity fade and the loss of usable lithium [3] Identifying each aging\nmechanism can be complex, given the large number of them However, it is possible to\ngroup them together into the following aging modes: loss of lithium inventory (LLI), loss\nof active material at the negative electrode (LAMNE), or at the positive electrode (LAMPE).\nThe aging may vary at different rates under cycling A previous study by Wheeler et al.\npresents a method based on incremental capacity analysis (ICA) and differential voltage\nanalysis (DVA) to estimate the aging of the negative electrode from 100% to 40% of the\nnominal capacity [11] In this paper, a small decrease in capacity of the negative electrode is\nobserved in the first 500 equivalent full cycles (EFCs) and a faster decrease after 1500 EFCs.\nMoreover, the cell capacity decreases faster while the negative electrode degrades rapidly.\nIn this paper, a postmortem analysis is conducted in order to give some insights of the\naging of the negative electrode on the full cell operation.\nWaldmann et al show that numerous postmortem studies have been carried out\non lithium-ion cells [13] The following physical-chemical analysis methods can be performed on the samples to analyze the electrode surface: microscopy, chemical analysis\nmethods sensitive to electrode surfaces, or chemical analysis methods for electrode bulk\nanalysis A wide range of methods can be used to identify electrode degradation, separator\ndegradation, or material degradation A wide range of methods are available: microscopy,\nenergy-dispersive X-ray spectroscopy (EDXS), scanning electron microscope (SEM), Raman\nspectroscopy, etc",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 530
    },
    {
      "text": "A wide range of methods can be used to identify electrode degradation, separator\ndegradation, or material degradation A wide range of methods are available: microscopy,\nenergy-dispersive X-ray spectroscopy (EDXS), scanning electron microscope (SEM), Raman\nspectroscopy, etc Each method can be used to characterize one or more of the following\nphenomena: growth of a film on the electrode, clogging of pores, delamination of the\nelectrode or the separator, cracks in the electrode coating, deformation, changes on particle\nsurface, particle cracks, exfoliation, metal dissolution and transition, and electrolyte degradation Coin cell reassembly from an electrode sample versus a reference electrode (lithium)\nenables the measurement of the electrode’s capacity It is also used to obtain the electrode’s\npseudo-OCP Among the numerous aging phenomena, the growth of the SEI during aging\ncaused by electrolyte decomposition is the main reason for the cell capacity loss In a\nprevious study, Waldmann et al found a thicker SEI layer on graphite particles [14] Burns\net al observed in cycled graphite/NMC 111 cells an acceleration in capacity fade and\na surface film on the graphite electrode [15] The surface film results from an oxidation\nproduct which limits or blocks ion transportation into the electrode Tiaszny et al observed\na similar bulky deposit on the negative electrode in a graphite/LiMn2O4 cell [16] Moreover,\nrepeated changes in electrode material volume due to lithiation and delithiation can bend\nelectrodes, weakening the contact of the active material to the separator and the current\ncollector [17] In the literature, very few postmortem studies analyze the deposits on the\nelectrode at a very low state of health (SoH): a cell SoH below 40% A postmortem analysis\nat a very low SoH may give some insights on inhomogeneous aging of the cell and the electrodes, the different types of deposits that can occur on the electrodes, and their chemical\ncomposition This information is necessary to understand the aging behavior and produce\na prognosis of the remaining useful life of lithium-ion cells in second-life applications.\nThis paper focuses on the aging phenomenon appearing in a long-term aging study in\nA123 1.1 Ah graphite/LFP 18650 commercial cells in first and second-life conditions Three\ncells are aged down to 40~30% of SoH and two of them are opened in a postmortem study,\nas well as a pristine cell This cell is used as a reference sample Postmortem analysis is\nused to compare the aging mechanisms between the pristine cell and three aged cells in\norder to identify the aging phenomenon occurring in long-term aging Macroscopic and",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 571
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 3 of 15 microscopic techniques are used to identify the aging mechanisms occurring in the cell on\nboth positive and negative electrodes. Photography, SEM, EDXS and coin cells are used to\nanalyze the morphology and materials on each electrode. **2. Experiments**\n_2.1. Graphite/LFP Cell Aging Experiment_ Experiments were conducted on three A123 18650 graphite/LFP cells with a nominal\ncapacity of 1.1 Ah. The cell was aged in a thermal chamber at 50 _[◦]_ C, with a depth of\ndischarge (DoD) set to 100%. The cell was discharged following a current profile derived\nfrom the worldwide harmonized light vehicles test procedures (WLTP) until the cell voltage\nreached 2.5 V [18]. This WLTP cycle featured an average discharge rate of C/3, a maximum\ndischarge C-rate of 2.7C, and a maximum regenerative C-rate of 1.2C. This discharge cycle\naccounted for energy regeneration during vehicle braking. The data obtained regarding\nthe experimental evolution of the cell’s state of health are presented in Figure 1. The cell\nstate of health reached 40~30% at the end of the experiment depending on the cell. The\ncharacterization was conducted after every 100 cycles to measure the cell capacity. **Figure 1.** Evolution of the cells’ state of health during the experiment. All three cells experienced a linear decline in the state of health during the first 1500,\n2200 and 2300 transferred ampere-hours. All cells experienced acceleration in the slope\nafter these first stages. Subsequently, a faster cell capacity decrease is observed. The linear\ndecline in capacity can be attributed to LLI, while the acceleration in capacity fade can be\nrelated to LAM [19]. Indeed, a loss of capacity and active material at the negative electrode\n(LAMNE) can occur due to uniform or non-uniform aging phenomena.\nCells 1 and 2 are opened in a postmortem study in order to identify the causes of this\ncapacity loss after a long-term aging cycle. Those cells are opened and analyzed in the\nsame condition as the pristine cell for comparison. Then, the morphology of the electrode\nmaterials and their compositions are analyzed. Cells were dismantled in a glove box under\nan argon atmosphere. Samples were not washed in order to not damage the samples with\nbulky deposits and to compare all the samples in the same conditions. It was unclear if\nwashing would affect those fragile deposits as discussed by Waldmann et al. [13]. Coin\ncells were made in a glove box under argon atmosphere using LP30 electrolyte. Chemical\nelements were detected using EDXS and estimated using the PhiRhoZ estimation technique.",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "_2.2. Pristine Cell Characterization_ The positive electrode (LFP) from the pristine cell in Figure 2a did not undergo any\nspecific damage after disassembly. Visual analysis does not reveal any specific surface\ndeposits or mechanical fragility (cracks, exfoliation) for the pristine electrode. Using both",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 69
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 4 of 15 secondary electron (SE) and back-scattered electron (BSE) detectors, a few rare defects exist\non the LFP electrode surface in white on the left-hand side in Figure 3a. SE and BSE give the\nsame result; however, only SE is represented in Figure 3a. Results in Table 1 were obtained\nusing EDXS to give a higher presence of oxygen and fluorine in the white defect. Darker\nareas have a similar composition as the rest of the electrode. The origin of this rare defect is\nunclear and could come from contamination during dismantling, manufacturing, or from\ndeposits which formed within the cell. **Figure 2.** Sections of pristine electrodes for ( **a** ) the LFP electrode and ( **b** ) the graphite electrode. The\npositive electrode is 718 mm long and 55.4 mm wide and the negative electrode is 764 mm long and\n57.4 mm wide. ( **a** ) ( **b** ) **Figure 3.** SEM pictures using a BSE detector from the pristine cell for ( **a** ) the LFP electrode and ( **b** ) the\ngraphite electrode. Positions 1 to 5 refers to the position of their respective results in Table 1. The negative electrode (graphite) from the pristine cell in Figure 2b has a uniform\ncolor, indicating a homogeneous lithiation of the graphite [20]. Grey areas near imprints\nof the current collector tab exist. The top and bottom edges of the negative electrode are\ndarker due to non-used/non-lithiated graphite in this area because the negative electrode\nis larger than the positive one. Using SEM, graphite particles are uniformly distributed\non the surface. Rare defects exist such as fibrous aggregate as is visible in the center\nof Figure 3b. Using EDXS and the results in Table 1, this aggregate has a significantly\nhigher concentration of fluorine and oxygen compared to the pristine graphite from the",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 434
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 5 of 15 pristine cell. This defect probably corresponds to a local abnormal concentration of the\nbinder. The binder network should be homogeneously distributed on graphite particles [21].\nOn average, the pristine graphite electrode has 78.6% carbon, 8.3% nitrogen, 6.6% fluor,\n4% oxygen, and traces of phosphorus on the section in the red box in Figure 3b using\nEDXS mapping. **Table 1.** Chemical compounds detected on samples from the pristine electrode (EDXS). **Defect in**\n**Graphite**\n**Electrode:**\n**Position 5 from**\n**Figure 3b** **[1]** **Graphite Particle**\n**in Graphite**\n**Electrode:**\n**Position 4 from**\n**Figure 3b** **[1]** **EDXS Mapping**\n**on Graphite**\n**Electrode: Zone**\n**from Figure 3b** **[1]** **Dark Grey Areas**\n**in LFP Electrode:**\n**Position 3 from**\n**Figure 3a** **[1]** **Grey Areas in**\n**LFP Electrode:**\n**Position 1 from**\n**Figure 3a** **[1]** **White Defect in**\n**LFP Electrode:**\n**Position 2 from**\n**Figure 3a** **[1]**",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 304
    },
    {
      "text": "**White Defect in**\n**LFP Electrode:**\n**Position 2 from**\n**Figure 3a** **[1]** C 15.09 _±_ 4.93 18.66 _±_ 5.82 15.9 _±_ 5.04 86.79 _±_ 19.14 78.38 _±_ 17.48 78.60 _±_ 17.20\nFe 30.43 _±_ 1.69 29.0 _±_ 1.62 26.1 _±_ 1.46 / / /\nF 1.18 _±_ 0.62 7.37 _±_ 2.46 4.83 _±_ 1.66 1.57 _±_ 0.68 10.04 _±_ 2.78 6.64 _±_ 1.90\nN / / / 10.04 _±_ 4.00 5.65 _±_ 2.50 8.33 _±_ 3.10\nO 36.5 _±_ 9.03 53.71 _±_ 12.84 31.80 _±_ 7.94 / 3.26 _±_ 1.32 4.08 _±_ 1.46\nCu / / / 1.13 _±_ 0.14 1.74 _±_ 0.18 1.45 _±_ 0.14\nP 15.66 _±_ 1.27 13.26 _±_ 1.09 14.36 _±_ 1.18 0.48 _±_ 0.10 0.93 _±_ 0.14 0.90 _±_ 0.12 1 Data expressed as mass [%] _±_ ∆abs. (2 sigma error). _2.3. Aged Electrodes Characterization_\n2.3.1. Macroscopic Analysis",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 443
    },
    {
      "text": "_2.3. Aged Electrodes Characterization_\n2.3.1. Macroscopic Analysis The positive electrode suffers no specific damage on disassembly, contrary to the\npristine positive electrode. A visual analysis of cells 1 and 2 reveals no surface deposits or\nmechanical changes to the positive electrode between the pristine and the aged cells using\nEDXS or SEM.\nOn the contrary, visual analysis in cells 1 and 2 on the negative electrode suffers\ninhomogeneous aging: local deposits, cracking and exfoliation. Cell 2 is used for SEM and\nEDXS analysis and cell 1 for photography. Defects are mainly present at both ends of the\njellyroll at the core of the cell or near the casing in Figure 4: (i) the inner end of the coil (the\nend of the coil at the heart of the cell) is marked by the appearance of a large number of\ncracks and the active material detached from the collector; (ii) the edge at the outer end\n(end of the coil close to the cell casing) is marked by cracking, detached graphite from the\ncurrent collector, and golden/orange-colored deposits on the electrode surface in Figure 4b;\n(iii) a grey-colored deposit between the golden/orange deposit and the rest of the electrode\nexists and enlarged pictures of Figure 4b are shown in Figure 4c,d; (iv) the middle of the\njellyroll has less deposit formations and traces are repeatedly formed on the edge at the\nelectrical connector that provides the electrical link between the current collector and the\ntabs in Figure 4g,h. In Figure 5b, the most common defect on the electrode is composed\nof an orange-gold deposits surrounded by a light gray deposit. Both of these deposits are\nvisible on the graphite electrode (dark grey).\nIn our study, the total surface area occupied on the electrode by the main deposit,\nmade up of the orange-gold in Figure 4c and gray in Figure 4d deposits, is 8.4% for the\nA side and 13.2% for the B side. The average surface area occupied is around 11%. Local\nformation of deposits on the negative electrode led to the loss of access to the graphite.\nOther rare surface defects exist within the electrode such as white deposits on the electrode\nsurface in Figure 4f or standalone grey deposits in Figure 4e. The white deposit surface\ncould suggest the presence of electrolyte salt. Darker areas, within the white deposits,\ncould suggest the presence of gas bubbles in the electrode prior to cell dismantling. Bubbles\nevacuate when the cell is opened and the rest of the electrode, still in contact with electrolyte,\nundergoes a deposit of electrolyte salt (due to evaporation of electrolyte during the cell\nopening procedure). Gold/orange-colored areas crack and peel easily from the copper\ncurrent collector. This bulky deposit is probably the result of the degradation of lithium",
      "page_num": 6,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 623
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 6 of 15 with the electrolyte. Lithium metal deposits should react with the electrolyte and thicken\nthe bulky deposit as discussed above. The deposit in Figure 4e has a color similar to the\nborder zone (d) (grey surfaces) and a similar shape. Light grey patches on the grey surface\nsuggest the formation of an additional deposit. The position of the deposit in Figure 4e is\nat the same position of deposit in Figure 4f on the other side of the electrode. This deposit\n~~is similar to the gray deposit near the collector tab in Figure 4h.~~ **Figure 4.** Macroscopic view of deposits on the negative electrode: ( **a** ) analysis of both sides of\nthe negative electrode (cell 2); ( **b** ) most common defect on the electrode composed of orange-gold\ndeposits surrounded by a light gray deposit on the graphite, the graphite exhibits a dark grey color;\n( **c**, **d** ) enlargements of Figure 4b for defect orange-gold and light gray; ( **e**                      - **h** ) additional deposits on\nthe electrode. 2.3.2. SEM and EDXS Analysis SEM and EDXS analyses were performed on cell 2 in a similar manner to the analysis\nof the pristine electrode. The results on the positive electrode from the aged cell give similar",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 301
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 7 of 15 results using BSE detectors in Figure 5 and EDXS mapping results in Table 2. The same\namount of material is detected. No changes were observed from macroscopic, SEM, or\nEDXS measurements. **Table 2.** Chemical compounds detected a on the negative electrode sample. **Bulky Deposit on**\n**Top Graphite from**\n**Position 9 in**\n**Figure 6d** **[1]** **Heterogeneous Bulky**\n**Deposit on Top**\n**Graphite from Position**\n**8 in Figure 6c** **[1]** **Graphite Grain**\n**Covered with LiPF6**\n**from Position 7 in**\n**Figure 6b** **[1]** **EDXS Mapping**\n**on Aged LFP from**\n**Figure 5a** **[1]** **Non-Damaged**\n**Graphite from**\n**Position 6 in**\n**Figure 6a** **[1]** C 12.40 _±_ 2.84 77.59 _±_ 17.34 28.45 _±_ 7.44 43.96 _±_ 10.86 18.9 _±_ 5.18\nFe 30.06 _±_ 1.67 / / / /\nF 3.76 _±_ 0.91 1.75 _±_ 0.74 62.06 _±_ 14.08 - N / 11.58 _±_ 4.44 / - O 37.21 _±_ 7.79 7.11 _±_ 2.50 7.80 _±_ 15.86 51.50 _±_ 12.88 77.11 _±_ 17.52\nCu / 1.98 _±_ 0.18 1.69 _±_ 0.86 4.54 _±_ 0.36 3.99 _±_ 0.32 1 Data expressed as mass [%] _±_ ∆abs. (2 sigma error). * Values unavailable due to detection error. ( **a** ) ( **b** ) **Figure 5.** Image from the SEM BSE detector for the positive electrode for ( **a** ) a view field of 278 µm\nand ( **b** ) a view field of 55.6 µm. The red box indicates the position of the EDXS mapping result in\nTable 2.",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 546
    },
    {
      "text": "**Figure 5.** Image from the SEM BSE detector for the positive electrode for ( **a** ) a view field of 278 µm\nand ( **b** ) a view field of 55.6 µm. The red box indicates the position of the EDXS mapping result in\nTable 2. Using SEM, the analysis of the dark grey area in cell 2 (cf. Figure 6a) shows a similar\nsurface to the sample from the pristine cell. Nevertheless, the EDXS in cell 2’s in the dark\ngrey area gives a presence of oxygen of 7% on the electrode, contrary to the pristine sample\n(Table 2). This slight increase in oxygen without deposits on-top the graphite could be due\nto a thickening of the SEI on graphite particles during aging experiments. A slight increase\n~~in nitrogen is also detected, going from 8% on average to more than 10% for the aged cell~~\n(Table 2). This result may correlate with an increase in SEI on graphite particles. However,\nthis increase may be correlated to air contamination. Further investigation should be done\nto properly link the presence of oxygen and nitrogen to SEI formation on graphite particles\nin a test without air contamination.\nCell 2’s light gray area (cf. Figure 6b) shows the presence of spheres on the surface of\ngraphite particles between 0.5 and 1 µm. Using EDXS, the fuorine content rises around\n60% for a detection on a completely coated graphite particle. Both EDXS measurements\nfrom Figure 6a,b have the same amount of oxygen. The high presence of fluorine and the\nshape of the crystals observed on the surface correspond to the same deposit of lithium\nfluoride (LiF) detected by Anderson et al. [22].",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 382
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 8 of 15 ( **a** ) ( **b** ) ( **c** ) ( **d** ) **Figure 6.** Images from SEM BSE detector for ( **a** ) a pristine-like area, ( **b** ) light gray deposit, and\n( **c**, **d** ) gold/orange deposit. Positions 6 to 9 refers to the position of their respective results in Table 2. The orange/gold deposition in Figure 4c is characterized by a very high proportion of\noxygen at the surface in Table 2. The deposit in Figure 6c,d is observed with EDXS color\nmapping in Figure 7. The result gives a high quantity of oxygen. The inhomogeneous\ndeposit on the left-hand side of Figure 6c has less oxygen and a higher presence of fluorine\nand phosphorus than the default on the right-hand side. This may suggest a localized\nthicker defect mainly composed of electrolyte reduction products appearing on top of\nthis first inhomogeneous deposit. Nonetheless, both deposits are sufficiently thick to hide\ngraphite particles. Those deposits are bulky and much different than standard SEI on\ngraphite particles: both primary SEI in the pristine cell in Figure 3b and the SEI increase in\nFigure 6a do not make modifications of the graphite particle shape. Those deposits will be\ninvestigated in the next section using EDXS.\nThe deposit in Figure 6d is blurred and hard to observe. It was not possible to\nhave good focus in this picture for this section of deposits on the electrode. Thus, the\nblurred deposit in Figure 6d may suggest the presence of a non-visible compound for the\nSEM detector. Such material would be a non-electronic conducting compound such as\ninorganic salt.",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 389
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 9 of 15 ( **b** ) ( **a** ) ( **c** ) **Figure 7.** EDXS mapping for ( **a** ) all detected deposits on the bulky deposits in Figure 6c,d, ( **b** ) oxygen\nonly, and ( **c** ) fluorine only. The red boxes indicate the respective position of SEM image in Figure 6c,d. EDXS mapping obtained in Figure 7 shows the distribution of elements on the bulky\ndeposit (orange/gold) observed on the graphite electrode. The two red rectangles help\nin locating the bulky deposit observed in Figure 6c and the blurred deposit in Figure 6d.\nMoreover, a higher concentration of oxygen is detected because of a more pronounced\ngreen color in the top right-hand corner. Figure 7b gives the mapping result for the oxygen\nonly. The blurred SEM picture from Figure 6d is located in the top right-hand corner of\nthe picture. Fluorine is detected on all the mapping sections in Figure 7c with a lower\nproportion in the blurred section from Figure 6d in the top right-hand corner. Phosphorus\nis detected in the same areas as fluorine. However, the blurred deposits on the surface may\nhide fluorine deposits, leading to lower detection of this element. Moreover, the bulky\noxygen deposit on the electrode can lead to a lower beam penetration in the material. We\nexpect deposits with high amounts of oxygen to be on top of LiF and graphite particles. 2.3.3. Electrochemical Analysis in Coin Cells",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 342
    },
    {
      "text": "2.3.3. Electrochemical Analysis in Coin Cells Electrochemical characterizations were performed on both positive and negative\nelectrodes for samples from the pristine cell and samples from cell 2. Those electrodes\nwere tested in CR2032 coin cells in a half-cell experiment by employing a portion of each\nelectrode versus a lithium foil in a coin cell. The positive electrode had no change in\ncapacity between the pristine cell and the aged cell in Figure 8a. We did not find a capacity\nloss at the positive electrode or any sign of aging such as particle cracking or surface\nreactivity, as was found in other studies such as Lee et al. in the case of NMC reach cells. As\na result, we consider no aging of the LFP electrode due to our results from MEB, EDXS, and\nelectrochemical results. On the negative electrode, samples from the dark grey area in the\naged cell 2 yielded a slightly lower capacity by comparison to the pristine cell. The samples\ngave an average of 9% capacity loss, which is lower than the estimated capacity loss of 30%\nfor the full cell data in Wheeler et al. [11]. This result was estimated by using both ICA and\nDVA techniques on a negative electrode pseudo-open circuit potential (pseudo-OCP), as\nillustrated in Figure 8b. The arrow and dashed lines give the displacement of a specific\npoint using DVA technique. We were not able to test the gold/orange-colored areas in the\ncoin cells because they crack and peel easily from the copper current collector, contrary to\nthe pristine electrode. This behavior may indicate a larger capacity loss or even an inability",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 351
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 10 of 15 to operate on the bulky deposits to explain the larger capacity fade of the full electrode\nthan in the “pristine-like” area. ( **a** ) ( **b** ) **Figure 8.** Electrochemical characterization of pristine and aged materials for ( **a** ) samples from the\npositive electrode and ( **b** ) samples from the negative electrode. All defects observed on both cells are summarized in Figure 9. Deposits and loss of\ncontact between the separator and the graphite lead to unusable surface sections of the\ngraphite electrode. Inhomogeneous aging leads to loss of active material (LAMNE) and\nloss of lithium inventory (LLI) due to the impossibility to transfer the remaining available\nlithium through the electrolyte. Several defects may block lithium transport in the cell:\ngas bubbles in Figure 9d, loss of electric contact and cracking with the current collector in\nFigure 9b, light gray areas with LiF in Figure 9c, or around bulky deposits in Figure 9a.\nBoth LAMNE and LLI lead to a direct blockage of lithium in those areas and result in a\ncapacity loss. The rest of the electrode remains functional despite a loss of capacity. **Figure 9.** Exploded view of a cell with the negative electrode, the separator and the positive electrode.\nAging mechanisms observed in graphite/LFP cell are ( **a** ) LiF formation in grey and thick layer\ndeposition in orange, ( **b** ) graphite cracking and exfoliation, ( **c** ) first LiF formation, and ( **d** ) traces of\ngas bubble. **3. Discussion** For the three cells discharged following profile derived from WLTP, negative electrodes\nundergo aging through SEI thickening and material damage under cycling: formation of",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 395
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 11 of 15",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 18
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 11 of 15 LiF, thick deposits, cracking, exfoliation. On the contrary, it is worth mentioning that the\nLFP positive electrode does not undergo specific aging leading to material degradation,\ndetachment from the electrode, or the appearance of surface defects. In this section, we aim\nto discuss our findings and compare those data with other authors’ results and conclusions.\nThis discussion provides some possible reactions that could explain the apparition of LiF\nand bulky deposits on the electrodes. Those local deposits are correlated with the loss\nof active material at the negative electrode. We recall that the dark gray area (graphite\nelectrode) only lost 9% capacity on average, whereas a 30% capacity loss of the negative\nelectrode was detected in a previous study [11]. Bulky deposits were extremely fragile\nand impossible to characterize in coin cells. Moreover, they detach easily from the current\ncollector. We believe those areas are inoperable and would explain the greater capacity loss\ndetected in the full-cell configuration.\nCommercial lithium-ion cells generally contain lithium hexafluorophosphate (LiPF6)\nsalt dissolved in a cyclic ethylene carbonate (EC) with linear dimethyl carbonate (DMC)\nand/or diethyl carbonate (DEC) solvents as the electrolyte. Hou et al. recall that a cascade\nof reduction reactions occur during the first cycle, and that the initially formed SEI contains\ninorganic species and organic species [23]. Li2CO3 and LiF are inorganic species commonly\nreported as formed in the primary SEI layer with other organic species such as lithium\nethylene decarbonates (LEDC, (CH2OCO2Li)2) or lithium alkyl carbonates (ROCO2Li) [24].\nSEI formation and further reactions leading to cell aging depend on the negative electrode\ncomponents (material, chemistry, structure), electrolyte components, and concentrations\nincluding salts, additives, impurities, or reaction-side products [23]. The formation of LiF\ncan come from various sources: (i) degradation of the electrolyte salt LiPF6 thank to the\nreaction (1), (ii) reactions (3) and (4) with the first layers of Li2CO3 SEI, or (iii) reaction (2)\nto water. The first two paths of LiF formation can occur in commercial lithium-ion cells.\nThe last condition requires a contamination with H2O during cell manufacturing. The\nreaction (2) with water contamination is discussed in the literature [23]. LiPF6 is known\nto be unstable with lithium carbonate in DMC [24]. The thermal decomposition of LiPF6\nfollows Equation (1) and exhibits a potential-dependent kinetics [25]. This decomposition\ncan occur in high temperature conditions or at high overpotential or at low potentials at\nthe pristine edge plane [23,25]. According to Andersson et al., the formation of LiF on the\ncarbon electrode increases the interfacial resistance because of a poor conductivity of this\ndeposit [22]. In the opinion of Anderson et al., the transformation of Li2CO3 to LiF does not\naccount for the very large increase in LiF in their study. Salt decomposition reactions may be\nthe main reason of LiF formation. Its formation could be due to LiPF6 degradation catalyzed\nby graphite exposure (e.g., SEI and/or graphite cracking) [22]. Henschel et al. studied\nthe aging of lithium-ion cells after use in electric vehicles [26]. The conducting salt LiPF6\ndegrades in several reactions leading to the formation of several products: acidic and nonacidic oregano(fluoro)phosphates. Henschel et al. determined that LiPF6 salt undergoes\na significant decomposition in electric vehicles, resulting in lower concentration than the\ninitial electrolyte salt [26]. Numerous acidic and non-acidic organo(fluoro) phosphates, as\nwell as POF3 were identified in many samples, which supported the authors’ findings:",
      "page_num": 12,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 853
    },
    {
      "text": "LiPF6 _→_ LiF + PF5 (1) LiPF6 + H2O _→_ LiF + 2HF + POF3 (2) The reaction of LiPF6 with Li2CO3, a common contributor of the primary SEI, is given\nin Equation (3) [27]. Li2CO3 has poor mechanical strength and low resistance to graphite\nvolume expansion during the lithiation and delithiation process. Cracks can appear through\nthe primary SEI, leading to an increase in reaction rate. Parimalam et al. consider the same\nreaction with LiPF6 and Li2CO3 but through a different reaction path than in Equation (4)\nleading to LiPO2F2, LiF, and CO2 [24]. LiPF6 + Li2CO3 _→_ 3 LiF + POF3 + CO2 (3)",
      "page_num": 12,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 188
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 12 of 15 LiPF6 + 2 Li2CO3 _→_ 4 LiF + LiPO2F2 + 2 CO2 (4) The detection of LiF on some graphite particles implies the appearance of other\ncompounds as side reaction products. The formation of PF5 in Equation (1) can lead to an\nadditional consumption of lithium in Equation (5) and the subsequent formation of LiF and\nLixPFy deposits. PF5 is also highly reactive in the presence of water, producing phosphoryl\nfluoride (POF3) and hydrogen fluoride (HF) in Equation (6). PF5 + Li [+] + e _[−]_ _→_ LiF + LixPFy (5) PF5 + H2O _→_ POF3 + 2 HF (6) The formation of POF3 and CO2 by previous reactions of LiPF6 can react with Li [+],\nleading to a new compound formation such as LiF, Li2CO3, LixPOFy deposits, and gas\ngeneration. Aurbach provides the principle of reactions (7) and (8) without necessarily\ndefining their stoichiometry [28]. POF3 + n Li [+] + n e _[−]_ _→_ LiF + LixPOFy (7) 2 CO2 + 2 Li [+] + 2 e _[−]_ _→_ Li2CO3 + CO (8)",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 327
    },
    {
      "text": "2 CO2 + 2 Li [+] + 2 e _[−]_ _→_ Li2CO3 + CO (8) Other decomposition of electrolytes components can lead to several products such as\ngases, ethers, phosphates or fluorophosphates, short-chain organic molecules, oligomers/\npolymers, inorganic carbonates, and oxides [24,27]. These reactions of decomposition of\nthe electrolyte may lead to a cell dry out. Fang et al. shows that the battery lifespan is\ninfluenced by the amount of electrolytes [29]. Authors propose that the transition from\nlinear to nonlinear aging could be induced by a continuous loss of electrolytes. This\nassumption may explain the bulky deposits observed in our postmortem study on the\nelectrode. Local loss of electrolytes leading to a dry out can isolate graphite particles,\nleading to a loss of active material. Despite this, other areas of the negative electrode\nremained able to retain 90% of the initial capacity. A study should be carried out to explain\nthe correlation between the heavy deposits, probably due to high reactivity with electrolyte,\nwhich might lead to cell dry out, and the high brittleness of graphite and its detachment\nfrom the current collector in the same area.\nAs a result, the aging of graphite/LFP cells to low states of health, representative\nof a use in second-life applications, has various stages of aging resulting from different\nelectrochemical processes. A representation of those aging processes is given as successive\naging phenomena in Figure 10. This figure aims to provide a general view of the formation\nof inhomogeneous aging on the negative electrode. However, it does not aim to detail the\ncomposition of the bulky deposits. First, the primary layer of SEI appears after the cell\nmanufacturing in Figure 10a. During the use in first-life applications, the SEI thickens on\nthe graphite particles as represented by a thicker line on graphite particles in Figure 10b.\nThe use of lithium-ion cells involves lithiation and delithiation operations of the graphite\nparticles. Subsequently, cracks can appear through the SEI due to bad mechanical strength\nof Li2CO3, resulting in possible contact of the electrolyte and LiPF6 with graphite particles\nin Figure 10c. In the case of deep discharge, the graphite can experience a change in particle\nvolume of up to 10% [30]. The crack initiates a new reaction forming additional SEIs and\nother reactions resulting in LiF and gas emissions in Figure 10d. These gas emissions cause\na local increase in pressure and possible deformations. In large quantities, a gas bubble\ncan form and impede the passage of lithium ions. The gases formed trigger new reactions,\nresulting in the consumption of cyclable lithium and new deposits on the electrodes. LiF is\ninsulating and prevents lithium ions from transferring to the electrode. Lithium may stay\non the electrode in contact with electrolytes leading to additional reactions and deposits in\nFigure 10e. Inorganic compounds also participate in the formation of this new deposit. The\nsequence of these phenomena leads to a significant consumption of cyclable lithium and\nthe deposition of a highly resistive or even insulating layer on the negative electrode in\nFigure 10f.",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 689
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 13 of 15 **Figure 10.** Proposed deposits mechanisms on the surface of the negative electrode: ( **a** ) primary\nSEI formation, ( **b** ) SEI growth, ( **c** ) SEI cracking, ( **d** ) LiF formation, ( **e** ) bulky deposit formation, and\n( **f** ) thickening and reformation. Partial view of a full cell, the positive electrode is not represented. **4. Conclusions**",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 115
    },
    {
      "text": "**4. Conclusions** Aging tests and postmortem analyses show that graphite/LFP lithium-ion cells hold\nup very well over time. Namely, no safety problems arose during the tests, and no dendritic\nformation was observed. The postmortem study showed that the LFP electrode does not\nage over time and over a very large number of charge/discharge cycles. No electrical or\nmechanical changes were observed. Indeed, mechanical properties were maintained after\nseveral thousand cycles.\nThe negative electrode, on the other hand, shows a high degree of degradation after\nthousands of cycles. In fact, some local areas were severely degraded by the apparition of\nLiF formation, thick SEI deposition, graphite cracking, and exfoliation. This paper does\nnot investigate the reason for fragile graphite in aged cells contrary to the pristine cell. The\nlower mechanical stability during cell opening could be a sign of structural changes inside\nthe graphite electrode such as loss of mechanical stability due to poorer binder mechanical\nstrength. Poorer mechanical stability and loss of contact with the current collector could\nbe another reason for the loss of active material at the negative electrode. Bulky deposits\non the electrode were detected; however, they were mainly composed of oxygen and were\nattributed to electrolyte decompositions. The bulky deposit leads to unusable electrode\nsections in the cell. Inhomogeneous aging of graphite electrodes leads to localized loss of\nactive material and overconsumption of lithium. The loss of active material at the negative\nelectrode can be a sign of acceleration in capacity loss due to increase in lithium reaction\nand loss of lithium inventory (LLI).\nLocal defects lead to graphite isolation, blocked lithium onto the surface, increased\nparasitic reactions with the electrolyte, increased deposits onto the surface, and changes in\nits morphology. The impossibility to use a fraction of the electrode highlights the direct\nimpact of loss of active material at the negative electrode (LAMNE) in commercial cells and\nthe overall cell capacity. The localized loss of lithium due to inhomogeneous aging besides\nstandard SEI formation leads to an increase in capacity fade.\nThis postmortem study confirms the apparition of inhomogeneous aging on the\nnegative electrode, while the positive electrode operates in the same manner as the pristine\nelectrode. As a result, the lithiation and delithiation no longer takes place over the entire\nsurface of the electrode, leading to lithium being trapped in those areas and resulting\nin a supplementary capacity fade. Thus, the loss of capacity in the graphite/LFP cell is\ndue to SEI formation and loss of active material at the negative electrode, leading to a\nsupplementary capacity fade in long-term aging. Therefore, it is necessary to diagnose\nthe negative electrode’s state of health in order to provide an accurate prognosis of the\nremaining useful life of batteries in second-life applications.",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "**Author Contributions:** Conceptualization, W.W., Y.B., P.V., A.S. and E.R.; methodology, W.W., Y.B.,\nP.V. and A.S.; visualization, W.W., Y.B., P.V. and A.S.; data curation, W.W.; writing—original draft,\nW.W.; formal analysis, W.W., Y.B., P.V. and A.S.; writing—review and editing, W.W., Y.B., P.V. and A.S.;",
      "page_num": 14,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 104
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 14 of 15 funding acquisition, Y.B., P.V., A.S. and E.R.; project administration, Y.B., P.V. and A.S. All authors\nhave read and agreed to the published version of the manuscript. **Funding:** This research was funded by EVE System and ANRT, grant number CIFRE 2018/1625. **Data Availability Statement:** The raw data supporting the conclusions of this article will be made\navailable by the authors on request. **Conflicts of Interest:** The authors declare that they have no known competing financial interests\nor personal relationships that could have appeared to influence the work reported in this paper.\nAuthors Elie Riviere is employee of EVE System company, who provided funding and technical\nsupport for the work. The funder had no role in the design of the study; in the collection, analysis, or\ninterpretation of data, in the writing of the manuscript, or in the decision to publish the results. **References** 1 Martinez-Laserna, E.; Sarasketa-Zabala, E.; Villarreal Sarria, I.; Stroe, D.-I.; Swierczynski, M.; Warnecke, A.; Timmermans, J.-M.;\nGoutam, S.; Omar, N.; Rodriguez, P Technical Viability of Battery Second Life: A Study From the Ageing Perspective _IEEE Trans._\n_Ind Appl._ **2018**, _54_ [, 2703–2713 [CrossRef]](https://doi.org/10.1109/TIA.2018.2801262)\n2 Quinard, H.; Redondo-Iglesias, E.; Pelissier, S.; Venet, P Fast Electrical Characterizations of High-Energy Second Life Lithium-Ion\nBatteries for Embedded and Stationary Applications _Batteries_ **2019**, _5_ [, 33 [CrossRef]](https://doi.org/10.3390/batteries5010033)\n3 Klett, M.; Eriksson, R.; Groot, J.; Svens, P.; Ciosek Högström, K.; Lindström, R.W.; Berg, H.; Gustafson, T.; Lindbergh, G.; Edström,\nK Non-Uniform Aging of Cycled Commercial LiFePO4//Graphite Cylindrical Cells Revealed by Post-Mortem Analysis _J Power_\n_Sources_ **2014**, _257_ [, 126–137 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2014.01.105)\n4 Baumhöfer, T.; Brühl, M.; Rothgang, S.; Sauer, D.U Production Caused Variation in Capacity Aging Trend and Correlation to\nInitial Cell Performance _J",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 600
    },
    {
      "text": "Production Caused Variation in Capacity Aging Trend and Correlation to\nInitial Cell Performance _J Power Sources_ **2014**, _247_ [, 332–338 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2013.08.108)\n5 Ecker, M.; Nieto, N.; Käbitz, S.; Schmalstieg, J.; Blanke, H.; Warnecke, A.; Sauer, D.U Calendar and Cycle Life Study of\nLi(NiMnCo)O2-Based 18650 Lithium-Ion Batteries _J Power Sources_ **2014**, _248_ [, 839–851 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2013.09.143)\n6 Harris, S.J.; Harris, D.J.; Li, C Failure Statistics for Commercial Lithium Ion Batteries: A Study of 24 Pouch Cells _J Power Sources_\n**2017**, _342_ [, 589–597 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2016.12.083)\n7 Mathieu, R.; Briat, O.; Gyan, P.; Vinassa, J.-M Fast Charging for Electric Vehicles Applications: Numerical Optimization of a\nMulti-Stage Charging Protocol for Lithium-Ion Battery and Impact on Cycle Life _J Energy Storage_ **2021**, _40_ [, 102756 [CrossRef]](https://doi.org/10.1016/j.est.2021.102756)\n8 Mathieu, R.; Briat, O.; Gyan, P.; Vinassa, J.-M Comparison of the Impact of Fast Charging on the Cycle Life of Three Lithium-Ion\nCells under Several Parameters of Charge Protocol and Temperatures _Appl Energy_ **2021**, _283_ [, 116344 [CrossRef]](https://doi.org/10.1016/j.apenergy.2020.116344)\n9 Attia, P.M.; Bills, A.; Brosa Planella, F.; Dechent, P.; Dos Reis, G.; Dubarry, M.; Gasper, P.; Gilchrist, R.; Greenbank, S.; Howey, D.;\net al Review—“Knees” in Lithium-Ion Battery Aging Trajectories _J Electrochem Soc._ **2022**, _169_ [, 060517 [CrossRef]](https://doi.org/10.1149/1945-7111/ac6d13)\n10 Pastor-Fernández, C.; Yu, T.F.; Widanage, W.D.; Marco, J Critical Review of Non-Invasive Diagnosis Techniques for Quantification\nof Degradation Modes in Lithium-Ion Batteries _Renew Sustain",
      "page_num": 15,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "_Renew Sustain Energy Rev._ **2019**, _109_ [, 138–159 [CrossRef]](https://doi.org/10.1016/j.rser.2019.03.060)\n11 Wheeler, W.; Venet, P.; Bultel, Y.; Sari, A.; Riviere, E Aging in First and Second Life of a G/LFP 18650 Cell: Diagnosis and\nEvolution of the State of Health of the Cell and the Negative Electrode under Cycling _Batteries_ **2024**  _under review_ .\n12 Birkl, C.R.; Roberts, M.R.; McTurk, E.; Bruce, P.G.; Howey, D.A Degradation Diagnostics for Lithium Ion Cells _J Power Sources_\n**2017**, _341_ [, 373–386 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2016.12.011)\n13 Waldmann, T.; Iturrondobeitia, A.; Kasper, M.; Ghanbari, N.; Aguesse, F.; Bekaert, E.; Daniel, L.; Genies, S.; Gordon, I.J.; Löble,\nM.W.; et al Review—Post-Mortem Analysis of Aged Lithium-Ion Batteries: Disassembly Methodology and Physico-Chemical\nAnalysis Techniques _J Electrochem Soc._ **2016**, _163_ [, A2149–A2164 [CrossRef]](https://doi.org/10.1149/2.1211609jes)\n14 Waldmann, T.; Wilka, M.; Kasper, M.; Fleischhammer, M.; Wohlfahrt-Mehrens, M Temperature Dependent Ageing Mechanisms\nin Lithium-Ion Batteries—A Post-Mortem Study _J Power Sources_ **2014**, _262_ [, 129–135 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2014.03.112)\n15 Burns, J.C.; Kassam, A.; Sinha, N.N.; Downie, L.E.; Solnickova, L.; Way, B.M.; Dahn, J.R Predicting and Extending the Lifetime of\nLi-Ion Batteries _J Electrochem Soc._ **2013**, _160_ [, A1451–A1456 [CrossRef]](https://doi.org/10.1149/2.060309jes)\n16 Stiaszny, B.; Ziegler, J.C.; Krauß, E.E.; Schmidt, J.P.; Ivers-Tiffée, E",
      "page_num": 15,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 568
    },
    {
      "text": "[CrossRef]](https://doi.org/10.1149/2.060309jes)\n16 Stiaszny, B.; Ziegler, J.C.; Krauß, E.E.; Schmidt, J.P.; Ivers-Tiffée, E Electrochemical Characterization and Post-Mortem Analysis of\nAged LiMn2O4–Li(Ni0.5Mn0.3Co0.2)O2/Graphite Lithium Ion Batteries Part I: Cycle Aging _J Power Sources_ **2014**, _251_, 439–450. [[CrossRef]](https://doi.org/10.1016/j.jpowsour.2013.11.080)\n17. Waldmann, T.; Gorse, S.; Samtleben, T.; Schneider, G.; Knoblauch, V.; Wohlfahrt-Mehrens, M. A Mechanical Aging Mechanism in\nLithium-Ion Batteries. _J. Electrochem. Soc._ **2014**, _161_ [, A1742–A1747. [CrossRef]](https://doi.org/10.1149/2.1001410jes)\n18. United Nations. _Addendum 15: Global Technical Regulation No._ _15, Worldwide Harmonized Light Vehicles Test Procedure._\n_ECE/TRANS/180/Add.15_ ; United Nations: New York, NY, USA, 2014; pp. 1–234.\n19. Dubarry, M.; Truchot, C.; Liaw, B.Y. Synthesize Battery Degradation Modes via a Diagnostic and Prognostic Model. _J. Power_\n_Sources_ **2012**, _219_ [, 204–216. [CrossRef]](https://doi.org/10.1016/j.jpowsour.2012.07.016)\n20. Shellikeri, A.; Watson, V.; Adams, D.; Kalu, E.E.; Read, J.A.; Jow, T.R.; Zheng, J.S.; Zheng, J.P. Investigation of Pre-Lithiation in\nGraphite and Hard-Carbon Anodes Using Different Lithium Source Structures. _J. Electrochem. Soc._ **2017**, _164_, A3914–A3924. [[CrossRef]](https://doi.org/10.1149/2.1511714jes)",
      "page_num": 15,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 504
    },
    {
      "text": "_Batteries_ **2024**, _10_, 119 15 of 15 21 Ender, M.; Joos, J.; Weber, A.; Ivers-Tiffée, E Anode Microstructures from High-Energy and High-Power Lithium-Ion Cylindrical\nCells Obtained by X-Ray Nano-Tomography _J Power Sources_ **2014**, _269_ [, 912–919 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2014.07.070)\n22 Andersson, A.M.; Edström, K Chemical Composition and Morphology of the Elevated Temperature SEI on Graphite _J._\n_Electrochem Soc._ **2001**, _148_ [, A1100 [CrossRef]](https://doi.org/10.1149/1.1397771)\n23 Hou, T.; Yang, G.; Rajput, N.N.; Self, J.; Park, S.-W.; Nanda, J.; Persson, K.A The Influence of FEC on the Solvation Structure and\nReduction Reaction of LiPF6/EC Electrolytes and Its Implication for Solid Electrolyte Interphase Formation _Nano Energy_ **2019**,\n_64_ [, 103881 [CrossRef]](https://doi.org/10.1016/j.nanoen.2019.103881)\n24 Parimalam, B.S.; MacIntosh, A.D.; Kadam, R.; Lucht, B.L Decomposition Reactions of Anode Solid Electrolyte Interphase (SEI)\nComponents with LiPF6 _J Phys Chem C_ **2017**, _121_ [, 22733–22738 [CrossRef]](https://doi.org/10.1021/acs.jpcc.7b08433)\n25 Leung, K Predicting the Voltage Dependence of Interfacial Electrochemical Processes at Lithium-Intercalated Graphite Edge\nPlanes _Phys Chem Chem Phys._ **2015**, _17_ [, 1637–1643 [CrossRef] [PubMed]](https://doi.org/10.1039/C4CP04494K)\n26 Henschel, J.; Horsthemke, F.; Stenzel, Y.P.; Evertz, M.; Girod, S.; Lürenbaum, C.; Kösters, K.; Wiemers-Meyer, S.; Winter,\nM.; Nowak, S Lithium Ion Battery Electrolyte Degradation of Field-Tested Electric Vehicle Battery Cells—A Comprehensive\nAnalytical Study _J Power Sources_ **2020**, _447_ [, 227370 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2019.227370)\n27",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 588
    },
    {
      "text": "Power Sources_ **2020**, _447_ [, 227370 [CrossRef]](https://doi.org/10.1016/j.jpowsour.2019.227370)\n27 Spotte-Smith, E.W.C.; Petrocelli, T.B.; Patel, H.D.; Blau, S.M.; Persson, K.A Elementary Decomposition Mechanisms of Lithium\nHexafluorophosphate in Battery Electrolytes and Interphases _ACS Energy Lett._ **2023**, _8_ [, 347–355 [CrossRef]](https://doi.org/10.1021/acsenergylett.2c02351)\n28 Aurbach, D Review of Selected Electrode–Solution Interactions Which Determine the Performance of Li and Li Ion Batteries _J._\n_Power Sources_ **2000**, _89_ [, 206–218 [CrossRef]](https://doi.org/10.1016/S0378-7753(00)00431-6)\n29 Fang, R.; Dong, P.; Ge, H.; Fu, J.; Li, Z.; Zhang, J Capacity Plunge of Lithium-Ion Batteries Induced by Electrolyte Drying-out:\nExperimental and Modeling Study _J Energy Storage_ **2021**, _42_ [, 103013 [CrossRef]](https://doi.org/10.1016/j.est.2021.103013)\n30 Schweidler, S.; De Biasi, L.; Schiele, A.; Hartmann, P.; Brezesinski, T.; Janek, J Volume Changes of Graphite Anodes Revisited: A\nCombined _Operando_ X-Ray Diffraction and In Situ Pressure Analysis Study _J Phys Chem C_ **2018**, _122_ [, 8829–8835 [CrossRef]](https://doi.org/10.1021/acs.jpcc.8b01873) **Disclaimer/Publisher’s Note:** The statements, opinions and data contained in all publications are solely those of the individual\nauthor(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury to\npeople or property resulting from any ideas, methods, instructions or products referred to in the content.",
      "page_num": 16,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 481
    }
  ],
  "total_chunks": 33,
  "created_at": "2026-02-04 15:53:43"
}