{
  "filename": "Eldesoky_2023_J._Electrochem._Soc._170_080515.pdf",
  "chunks": [
    {
      "text": "Journal of The\nElectrochemical Society **OPEN ACCESS**",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 12
    },
    {
      "text": "To cite this article: A. Eldesoky et al 2023 J. Electrochem. Soc. 170 080515 View the [article online](https://doi.org/10.1149/1945-7111/aceffd) for updates and enhancements. You may also like Impact of Graphite Materials on the\n~~Lifetime of NMC811/Graphite Pouch~~ Cells:\n~~Part II. Long-Term Cycling, Stack Pressure~~\n~~Growth, Isothermal Microcalorimetry, and~~\n~~Lifetime Projection~~\n~~A. Eldesoky, E. R.~~ Logan, A. J. Louli et al. Deterioration Analysis in Cycling Test at\n~~High Temperature of 60°C for Li-Ion Cel~~ ls\n~~Using SiO Anode~~\n~~Tetsuya Kajita, Ry~~ ota Yuge, Kentaro\nNakahara et al. Impact of Electrolyte Additives on the\n~~Lifetime of High Voltage NMC Lithium~~ -Ion\n~~Pouch Cells~~\n~~Saad Azam,~~ C. P. Aiken, Quinton Meisner\net al. This content was downloaded from IP address 71.212.53.134 on 03/02/2026 at 07:31",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 276
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 15
    },
    {
      "text": "A. Eldesoky, [1] N. Kowalski, [2] and J. R. Dahn [1][,][3][,][z] 1Department of Chemistry, Dalhousie University, Halifax, NS, Canada\n2Department of Mechanical Engineering, Dalhousie University, Halifax, NS, Canada\n3Department of Physics & Atmospheric Science, Dalhousie University, Halifax, NS, Canada Ni-rich Li-ion cells suffer from severe capacity fade at high states of charge (SOC) due to oxygen release and/or lattice volume\ncollapse. We share long-term cycling results (12000 h) at 40 °C for NMC811, NMC532, and NMC640 cells cycled with different\nupper cut-off voltages (UCV), C-rates, and depths of discharge (DOD). We show that cycling to a greater UCV results in more\ncapacity loss and resistance growth as expected. However, NMC811 suffered from 5–10 times greater resistance growth at 4.20 V\ncompared to 4.06 V, while the resistance for NMC532 and NMC640 cycled to 4.30 V was roughly twice that of the 4.10 V UCV\ncells. This highlights a challenging problem with Ni-rich materials that can be mitigated if the UCV is limited to avoid NMC811\nvolume change. Finally, we used competitive graphite materials reported in previous work to examine the impact of UCV on the\nrate of SEI growth in NMC811 cells, which was found to increase with temperature and UCV, particularly at ⩾4.08 V UCV. We\nhope this brief report will highlight the importance of lifetime energy output, rather than initial energy density, and encourage\nbattery users to limit the UCV of Ni-rich cells when possible.\n© 2023 The Author(s). Published on behalf of The Electrochemical Society by IOP Publishing Limited. This is an open access\n[article distributed under the terms of the Creative Commons Attribution 4.0 License (CC BY, http://creativecommons.org/licenses/](http://creativecommons.org/licenses/by/4.0/)\n[by/4.0/), which permits unrestricted reuse of the work in any medium, provided the original work is properly cited. [DOI: 10.1149/](http://creativecommons.org/licenses/by/4.0/)\n[1945-7111/aceffd]](https://doi.org/10.1149/1945-7111/aceffd) Manuscript submitted June 2, 2023; revised manuscript received July 20, 2023. Published August 23, 2023. [Supplementary material for this article is available online](https://doi.org/10.1149/1945-7111/aceffd)",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 591
    },
    {
      "text": "[Supplementary material for this article is available online](https://doi.org/10.1149/1945-7111/aceffd) Ni-rich positive electrode materials are attractive due to their\nhigh energy density. [1] However, Ni-rich NMC materials experience a\nlarge lattice volume collapse upon delithiation. [2] This large volume\nchange can expose fresh, reactive particle surfaces to the electrolyte\nwhich increase the parasitic reactions between the positive electrode\nand the electrolyte, increase cell resistance, and result in rapid\ncapacity fade. [3] Moreover, Ni-rich materials such as NMC811 are\nknown to release lattice oxygen past 80% state of charge (SOC) that\ncan result in electrolyte oxidation. [4] While Ni-rich cells cycled to\nhigh SOC benefit from a competitive energy density compared\nto other positive electrode materials, the degradation of these materials\neventually results in lower energy output per cycle compared to lower\nSOC counterparts. [4][–][6] There have been many strategies employed, with\nvarying degrees of success, to address these well-known issues with\nNi-rich materials such as the use of coatings, dopants, core-shell\nparticle design, single crystalline (SC) particle morphologies, and\nelectrolyte additives. [1][,][5][,][7][–][10] Despite these research efforts, the lifetime of Ni-rich materials is\nstill compromised at high SOCs. Previous work from our group\nlooked at the impact of C-rate, depth of discharge (DOD), and upper\ncut-off voltage (UCV) on the lifetime of NMC811/Artificial\nGraphite (AG) cells. [11] We found that cells operating at top of\ncharge with a small DOD (i.e., spend more time at high SOCs)\nexperienced more capacity loss than cells operating with a large\nDOD. This was attributed to potential oxygen release/lattice volume\ncollapse at high SOCs that will be occurring more frequently for\ncells cycling in 3.9–4.20 V window, for example. [11] While C-rate and\nDOD choice did impact capacity loss, cycling NMC811 past 4.06 V\nwas far more detrimental than any other factor. [11] If NMC811 cells\nare limited to 4.06 V UCV, the resistance growth is minimal and\ncapacity loss is largely governed by SEI growth only. Therefore, we\nexplored the impact of negative electrode materials on the lifetime of\nNMC811 cells and found a more competitive artificial graphite (AG)\nmaterial that outperformed our commonly-used Kaijin AML400\nmaterial. [6][,][12] This led us to believe that the use of competitive AG\nmaterials and limiting the volume change in NMC811 cells can yield",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 594
    },
    {
      "text": "ultra-long-lived Ni-rich cells that may be suited for energy storage\napplications.\nThis brief report shares some long-term cycling results from\nNMC811, NMC532 and NMC640 cells with the same negative\nelectrode (Kaijin AML400) to highlight the impact of volume\nchange on resistance growth of NMC811 cells compared to NMC\ngrades with lower Ni-content. We also used the competitive AG\nmaterial (“AGC”) reported in previous work from our group to\nexamine the impact of UCV on the rate of SEI growth at 40 °C and\n70 °C. With the increasing demand for Li-ion batteries, we believe\ntaking any measures to prolong cell lifetime to maximize energy\noutput is important to address the growing energy storage needs and\nreducing energy consumption to replace spent cells. [13] Experimental Methods electrolyte additives. Pouch cells and electrolytes.—Machine-made pouch cells were",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 197
    },
    {
      "text": "electrolyte additives. Pouch cells and electrolytes.—Machine-made pouch cells were Despite these research efforts, the lifetime of Ni-rich materials is received vacuum sealed from LiFUN Technologies (Hunan prostill compromised at high SOCs. Previous work from our group vince, China) with no electrolyte. The positive electrode material\nlooked at the impact of C-rate, depth of discharge (DOD), and upper was Li(Ni0.8Mn0.1Co0.1)O2 (NMC811), Li(Ni0.5Mn0.3Co0.2)O2\ncut-off voltage (UCV) on the lifetime of NMC811/Artificial (NMC532), Li(Ni0.6Mn0.4Co0)O2 (NMC640). The positive electrode\nGraphite (AG) cells. [11] We found that cells operating at top of was 94% active material, 2% PVDF binder, and 4% carbon black.\ncharge with a small DOD (i.e., spend more time at high SOCs) The NMC532 and NMC640 materials had a Ti-based coating. The\nexperienced more capacity loss than cells operating with a large specific surface areas of the positive electrode materials were similar\nDOD. This was attributed to potential oxygen release/lattice volume and in the 0.3–1.1 m [2] g [−][1] based on the suppliers’ certificates of\ncollapse at high SOCs that will be occurring more frequently for analysis. The negative electrolyte was Kaijin AML400 artificial\ncells cycling in 3.9–4.20 V window, for example. [11] While C-rate and graphite (AGA), or “artificial graphite C” (AGC) studied in previous\nDOD choice did impact capacity loss, cycling NMC811 past 4.06 V work from our lab. [6][,][12] The negative electrode was 95.2% active\nwas far more detrimental than any other factor. [11] If NMC811 cells materials, 2.8% CMC/SBR binder, and 2% carbon black. The N/P\nare limited to 4.06 V UCV, the resistance growth is minimal and ratio was around 1.10 at 4.40 V for all cells.\ncapacity loss is largely governed by SEI growth only. Therefore, we Cells were cut open in an Ar-filled glovebox and dried at 120 °C\nexplored the impact of negative electrode materials on the lifetime of under dynamic vacuum prior to filling with 0.85 mL (∼1.0 g) of\nNMC811 cells and found a more competitive artificial graphite (AG) electrolyte. The electrolyte for all cells was ethylene carbonate (EC):\nmaterial that outperformed our commonly-used Kaijin AML400 ethyl methyl carbonate (EMC):dimethyl carbonate (DMC) 25:5:70",
      "page_num": 3,
      "chunk_index": 4,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 629
    },
    {
      "text": "[6][,][12] This led us to believe that the use of competitive AG (wt. ratio) with 2% vinylene carbonate (VC) and 1% ethylene sulfate\nmaterials and limiting the volume change in NMC811 cells can yield (DTD) as additives. The salt was 1.5 M lithium hexafluorophosphate (LiPF6). All electrolyte components were obtained from Shenzen\nCapchem.\nAfter filling, cells were held at 1.50 V for 24 h after electrolyte\n[zE-mail: jeff.dahn@dal.ca](mailto:jeff.dahn@dal.ca) filling to allow for proper wetting of the jelly roll, then underwent a",
      "page_num": 3,
      "chunk_index": 5,
      "section_name": "Highlighting the Advantages of Operating NMC811 Cells to Voltages below 4.20 V Compared to NMC Grades with Lower Ni Content",
      "token_count": 150
    },
    {
      "text": "Table I. List of cells and cycling conditions in this work. Cell type Voltage range (V) C-rate Temp. (°C) Reversible Spec. Cap. in half cells vs Li/Li [+] (mAh g [−][1] ) NMC811/AGA 3.0–4.20 or 3.0–4.06 (“100 %” DOD) C/3:C/3 40 (173 @ 4.06 V)\n3.9–4.20 or 3.74–4.06 (“25 %” DOD) C/10:C/10 (200 @ 4.20 V)\nNMC811/AGC 3.0–4.04; 3.0–4.06; 3.0–4.08; 3.0-4.10; or 3.0–4.20 C/3:C/3 40 or 70 (170 @ 4.04 V)\n(173 @ 4.06 V)\n(176 @ 4.08 V)\n(178 @ 4.10 V)\n(200 @ 4.20 V)\nNMC532/AGA 3.0–4.30 or 3.0–4.10 (“100 %” DOD) C/3:C/3 40 (168 @ 4.10 V)\n3.94–4.30 or 3.8–4.10 (“25 %” DOD) 1C:1C (195 @ 4.30 V)\nNMC640/AGA 3.0–4.30 or 3.0–4.10 (“100 %” DOD) C/3:C/3 40 (135 @ 4.10 V)\n3.94–4.30 or 3.8–4.10 (“25 %” DOD) 1C:1C (170 @ 4.30 V)",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 414
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 1. Checkup cycle capacity loss at t = 12000 h for NMC811, NMC532 and NMC640 cells with the same AG negative electrode. All cycling was at 40 °C\nand the lower cut-off voltage was 3.0 V. The UCVs for NMC811 cells were 4.06 or 4.20, while the UCV for NMC532 and NMC640 were 4.10 or 4.30 V. Left\ncolumn shows cells cycled with a 25 % DOD, and right column shows cells cycled with 100 % DOD. Cycle number in brackets, UCV, C-rate, and DOD are as\nindicated in the panels. C/20 charge-discharge formation cycle at 40.0 ± 0.1 °C between\n3.00 and the UCV specified for each cell. All cells were degassed\nafter formation prior to any further testing. Long-term cycling.—Long-term cycling was done on Neware\ncyclers (Shenzhen, China). All cycling conditions are indicated in\nTable I below. Periodic, low-rate, capacity check cycles were done\nevery 500 h or every 50 cycles at 100% DOD and C/10:C/10 or C/\n20:C/20 in some cases. The UCVs for NMC532 and NMC640 were\n4.10 V or 4.30 V for ease of comparison with internal lab data, and\nthe UCV for NMC811 were 4.06 V or 4.20 V to avoid the lattice\nvolume change around 80% SOC, and to trigger it with the higher\nUCV. Results and Discussion Comparing NMC811 to NMC532 and NMC640 at different\nDODs.—In previous work, we looked at the impact of cycling\nconditions (C-rate, DOD, UCV, and temperature) on the lifetime of\nSC NMC811/AGA cells. [11] While capacity was impacted by DOD\nand C-rate choice, the primary detriment to cell lifetime was",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 458
    },
    {
      "text": "Comparing NMC811 to NMC532 and NMC640 at different\nDODs.—In previous work, we looked at the impact of cycling\nconditions (C-rate, DOD, UCV, and temperature) on the lifetime of\nSC NMC811/AGA cells. [11] While capacity was impacted by DOD\nand C-rate choice, the primary detriment to cell lifetime was operating NMC811 cells to an UCV of 4.20 V compared to\n4.06 V. Figure S1 shows the discharge capacity (mAh) and normalized ΔV growth for NMC811/AGA cells cycled at 40 °C. The\ndifference between the average charge and discharge voltage is\n“ΔV” in this work and is taken as a. measure of resistance growth in\nthe cell. The UCV was 4.06 V or 4.20 V and cells were discharged to\n25, 50, 75, or 100 % DOD at C/3:C/3. Cycling at or below 4.06 V vs\ngraphite avoids the lattice volume collapse of NMC811. Figure S1\nshows that limiting the UCV to 4.06 V greatly hindered ΔV growth.\nThe 4.20 V cells showed ∼250 % ΔV growth compared to ∼20 %\nfor 4.06 V counterparts after 12000 h of cycling at 40 °C. This ΔV\ngrowth will negatively impact the cell’s power and energy output.\nWhile operating Li-ion cells at higher voltages is known to\naccelerate capacity loss and resistance growth, NMC811 cells suffer\nfrom severe lattice volume collapse past ∼80 % SOC which greatly\nhinders the cell’s performance compared to NMC grades with lower\nNi content. [2][–][4][,][6][,][14] Other grades of NMC can experience some lattice\nvolume change at high SOCs, this behavior is much more detrimental for Ni-rich positive electrodes. [7] NMC532/AGA and NMC640/AGA cells were cycled at 40 °C to\n4.10 V or 4.30 V with 25 % or 100% DOD at C/3:C/3 and 1C:1C,",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 483
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 2. Percent ΔV growth at t = 12000 h for NMC811, NMC532 and NMC640 cells with the same AG negative electrode. All cycling was at 40 °C and the\nlower cut-off voltage was 3.0 V. The UCVs for NMC811 cells were 4.06 or 4.20, while the UCV for NMC532 and NMC640 were 4.10 or 4.30 V. Left column\nshows cells cycled with a 25 % DOD, and right column shows cells cycled with 100 % DOD. Cycle number in brackets, UCV, C-rate, and DOD are as indicated\nin the panels. and the results were compared to previous NMC811 data. [11] Figure 1\nshows the capacity loss from the checkup cycles at t = 12000 h for\nNMC811, NMC532 and NMC640 cells. C-rate, DOD, and UCV are\nindicated for each panel. Figures S2–S3 show the discharge capacity\nand ΔV growth vs time for the NMC532 and NMC640 cells. The\nNMC532 and NMC640 cells cycled at 1 C:1 C show that high DOD\nresults in more capacity fade, which is consistent with previous\nreports on the impact of DOD in cell lifetime. [15][–][17] Similar trends can\nbe seen in NMC640 cells cycled at C/3:C/3 with a 4.30 V UCV, but\ndifferences due to DOD were very small for NMC532 and NMC640\ncycled to a 4.10 V UCV. In contrast, NMC811 in Figs. 1a–1b show\nthat 25 % DOD cells actually had more capacity loss compared to\n100 % DOD, which we attributed to longer residence time at high\nSOCs when the DOD is only 25 % (i.e., cycling in the 3.9–4.20 V\nrange) as discussed in our previous work. [11] While NMC640 cells showed poor retention at 1 C:1 C, this\nperformance can be greatly improved by tailoring the electrolyte\nadditive to improve high-rate performance. In fact, NMC640 cells\ncycled at 4.30 V and 1 C:1 C in Fig. 1d did not cycle for more than\n500 h and showed severe Li plating (see Fig. S3). Here, 2VC1DTD",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 563
    },
    {
      "text": "While NMC640 cells showed poor retention at 1 C:1 C, this\nperformance can be greatly improved by tailoring the electrolyte\nadditive to improve high-rate performance. In fact, NMC640 cells\ncycled at 4.30 V and 1 C:1 C in Fig. 1d did not cycle for more than\n500 h and showed severe Li plating (see Fig. S3). Here, 2VC1DTD was used throughout for consistency so additives that result in\nsmaller RCT compared to VC may be more suitable for NMC640\ncells. [18][,][19] Overall, NMC532 cells had the best capacity retention. At\nlow UCV, NMC640 had less capacity fade compared to NMC811\n(Figs. 1a–1b) but performed similar to NMC811 at high UCV\n(Figs. 1c–1d).\nFigure 2 shows the ΔV growth at t = 12000 h for the cells in\nFig. 1. Low UCV cells in the top row show small ΔV growth after\n12000 h. NMC640 had more severe ΔV growth at 1 C:1 C and C/3:\nC/3 for both DODs compared to NMC532. The NMC811 cells\nshowed the largest ΔV growth at 4.20 V followed by NMC640 and\nNMC532. The severe ΔV growth for NMC811 shown in Fig. 2 will\ndrastically impact the power density of these cells, therefore keeping\nthe UCV at or below 4.06 V is critical for NMC811 cells. Even\nthough cycling to a high UCV increased capacity loss for all cells,\nNMC811 cells were the only ones to suffer from a drastic increase in\nresistance. Despite small differences in capacity loss (<5 %)\nbetween NMC81 and NMC532/640 in Figs. 1c–1d, the NMC811\ncells tested to 4.2 V show 3–8 times as much ΔV growth compared\nto the other NMC grades tested to 4.3 V.",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 459
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 3. (a)-(b) Discharge capacity (mAh), (c)-(d) normalized capacity, and (e)-(f) normalized ΔV for NMC811/AGC cells cycled to different UCVs at 70 and\n40 °C with C/3:C/3 rates. Rate of SEI growth as a function of temperature and UCV for\nNMC811.—To further demonstrate the impact of UCV on capacity\nloss, NMC811/AGC cells were cycled to 4.04, 4.06, 4.08, 4.10, and\n4.20 V UCV at 40 °C or 70 °C. Cells were not cycled at 70 °C with\na 4.20 V UCV. The AGC material here was used because it was\nmore competitive than AGA as shown previously, [6] so we wanted to\nsee the impact of low SOC cycling and competitive graphite material\non capacity loss. Figure 3 shows the discharge capacity (mAh),\nnormalized capacity, and normalized ΔV vs cycle number for\nNMC811/AGC cells with different UCVs. Despite the small\ndifference of 60 mV between the 4.04 and 4.10 V cells, the 4.04 V\ncell lost 10 % capacity and its resistance increased by 5% at 70 °C\nafter 400 cycles, compared to 15 % capacity loss and 30% resistance\ngrowth at 4.10 V UCV. Similar trends can be seen after 2500 cycles\nat 40 °C, where increasing the UCV resulted in more fade and ΔV\ngrowth. The importance of limiting the UCV is not just to improve\ncapacity retention, but also to keep the resistance growth under\ncontrol to avoid compromising the power capabilities of the cells. In\naddition to the improved resistance growth at low UCVs, Fig. 3b\nsuggests that 4.04 V cells may have greater lifetime energy output\ncompared to 4.20 V.\nNMC811 cells operating below 4.20 V show small resistance\ngrowth during cycling and the capacity loss is primarily Li loss due\nto SEI growth. [6][,][11] Therefore, the rate of capacity loss as a function of time will likely follow the simple square-root time model as\ndescribed in previous work by Broussely and co-workers. [20][,][21] The\nsquare-root time model assumes that SEI thickness increases with _t_, where _t_ is time, according to the following equation: _Q t_ ( ) = _Qo_ (1          - _A t_ ) [ ]1",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 588
    },
    {
      "text": "_Q t_ ( ) = _Qo_ (1          - _A t_ ) [ ]1 where _Q t_ ( ) is capacity at time _t_, _Qo_ is initial capacity, and _A_ is a\nproportionality term. The term _A_ will increase with rate of SEI\ngrowth.\nFigure 4 shows the measured and calculated capacity loss for\nNMC811/AGC cells cycled at 40 °C with 2VC1DTD and different\nUCVs along with the residuals from the fit (difference between\nmeasured and calculated capacity). The C/20:C/20 capacity check\ncycles were fitted here. Figure S4 shows measured and calculated\ncapacity loss for the 70 °C cells shown in Fig. 3. For both\ntemperatures, the square root time model fits the measured data\nquite well as seen in the residual plots for voltages below 4.20 V.\nThis is expected for cells where capacity loss is only due to SEI\ngrowth and the concentration of Li in the negative electrode\noverhang is small since the cells are cycled to 100 % DOD. [22] However, the residuals are larger for the 4.20 V cells since the\nincreasing ΔV contributes to capacity fade on top of SEI growth, so\nthe square-root time model is not a perfect fit in this case.",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 293
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 4. Measured and calculated capacity loss for NMC811/AGC cells cycled to 4.04 V, 4.06 V, 4.08 V, 4.10 V, and 4.20 V UCV at 40 °C. Figure 5. A parameter vs UCV for NMC811/AGC cells cycled at 40 °C or 70 °C. All cycling was done at C/3:C/3 and the lower cut-off voltage was 3.0 V for all\ncells. The 40 °C cells had about 2500 cycles (1500 for 4.20 V UCV) and the 70 °C cells had about 400 cycles.",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 169
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 6. Discharge energy (mWh) vs time (hours) for NMC811/AGC cells cycling at (a) 70 °C or (b) 40 °C with different UCVs. All cycling was done at C/3:\nC/3. Circles shows the measured data and solid lines are extrapolated discharge energy trajectories based on Eq. 1. The solid lines terminate at 80 % of the initial\ndischarge energy for each cell. (c)-(d) cumulative energy output (Wh) and (e)-(f) normalized energy output normalized to the initial energy at end of life (i.e., 80\n% of the initial discharge energy). Figure 5 shows the extracted A parameter vs UCV for the 40 °C\nand 70 °C cells. Note the difference in y-axis scale for the 40 °C and\n70 °C data, At 40 °C, the A term increases slightly from 4.04 V to\n4.06 V. There is a clear increase in SEI growth at 4.08 V and 4.10 V,\nconsistent with the differences in capacity fade and ΔV in Fig. 3.\nWhen the cell is cycled to 4.20 V UCV, the rate of SEI growth\nincreases by nearly two-fold. Similarly for 70 °C, the rate of SEI\ngrowth linearly increases from 4.04 V to 4.08 V and spikes at\n4.10 V. At 4.10 V, the A term is nearly 30 % greater than 4.08 V\ndespite only 20 mV difference in voltage. Lowering the UCV is\ntherefore critical for the longevity of NMC811 cells.\nFinally, we wanted to consider the lifetime energy output as a\nfunction of temperature and UCV. Figure 6 shows the discharge\nenergy (mWh) vs time (hours) for the cells in Fig. 3, and the total\nenergy and normalized energy outputs at 70 °C and 40 °C. Using the\nsquare-root time model to fit the measured data (see Eq. 1), we\nextrapolated the discharge energy trajectory for the different UCVs\nup until reaching 80 % of the initial discharge energy (taken as end\nof life here). From there, assuming that one C/3:C/3 cycle is\ncompleted every 6 h, we took the sum of discharge energy output\nfrom each cycle to get the cumulative energy output over the cell’s\nlifetime. The total energy was then divided by the initial discharge",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 563
    },
    {
      "text": "energy to get the normalized energy output. The results in Fig. 6\nassume that Li loss will continue to follow the square-root time\nmodel until end of life and does not consider any failures mitigated\nby the cell form factor and/or mechanical degradation of the cell\ncomponents. Note from Fig. 4 above that the residuals from the\nsquare-root time model for the 4.20 V cells were larger than the\nlower voltage ones. In Fig. 6b, the discharge energy data for the\n4.20 V cells shows a slightly more linear trajectory than the fitted\ndata in the solid lines. This is due to the resistance growth\nexperienced at higher UCV which impacts the quality of the fit.\nThis means that estimates of cumulative stored energy for the 4.2 V\ncells tested at 40 °C will be overestimates based on only the square\nroot time model.\nFigures 6a–6b show that, at 70 °C and 40 °C, the time it takes the\ncell to reach 80 % of the initial discharge energy decreases as the\nUCV increases (see solid lines). Looking at Figs. 6c–6d, the\ncumulative energy output at end of life decreases with increasing\nUCV at both temperatures, with a sharp drop in output going from\n4.10 V to 4.20 V in Fig. 6d. The energy output for the 4.04 V cells in\nFig. 6d was nearly three times that of the 4.20 V cells, despite the\ninitial energy penalty seen in Fig. 6b. Similar trends can be seen in\nthe normalized energy outputs in Figs. 6e–6f.",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 364
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 Figure 7. Normalized ΔV vs cumulative energy output (Wh) for NMC811/AGC cells cycled at 40 °C or 70 °C. All cycling was done at C/3:C/3 and the lower\ncut-off voltage was 3.0 V for all cells. The 40 °C cells had about 2500 cycles (1500 for 4.20 V UCV) and the 70 °C cells had about 400 cycles. The dashed line\nshows the point where ΔV growth is at 20%. Figure 7 shows normalized ΔV vs cumulative discharge energy\noutput (Wh) at 70 °C and 40 °C. The dashed line represents a\nhypothetical scenario where only 20 % resistance growth is allowed\nfor a given application. Here, we can clearly see that as we increase the\nUCV, the 20 % resistance growth threshold (or any other limit on ΔV\ngrowth) will be reached at smaller energy outputs at both temperatures.\nAt 70 °C, ΔV steadily increases with UCV. However, at 40 °C,\nthe ΔV growth is similar for both 4.04 and 4.06 V cells at the time of\nwriting. The trends at 40 °C are likely to be the same as 70 °C but\nafter more cycling as seen in Figs. 6c-6d. The results in Figs. 6–7\nsuggest that limiting the UCV for NMC811 cells can be very costeffective when considering the initial cost of the cell and its lifetime\nenergy output, rather than initial $/kWh. While this usage scheme may\nnot be suitable for applications where high-energy is more important\nthan lifetime, we believe purpose-built NMC811 (or Ni-rich cells,\nmore broadly) that are balanced to operate at low UCVs can be\nimportant in stationary energy storage applications and in applications\nwhere cells are continuously exposed to high temperatures. Conclusions",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 433
    },
    {
      "text": "Conclusions This short communication shares some long-term cycling results\non NMC811, NMC532, and NMC640 cells cycled at different DODs\nand C-rates for 12000 h at 40 °C. All cells had similar construction\nwith an identical AG negative electrode and electrolyte. In this work,\nwe showed that NMC811 cells suffer from a severe resistance growth\nwhen cycled past 4.06 V due to the large lattice volume collapse that\nthe positive electrode material experiences. This is further demonstrated in Fig. 3, where increasing the UCV by even 10–30 mV\nresulted in a dramatic increase in capacity loss and resistance growth\nat 40 and 70 °C. In contrast to the other NMC grades with lower Ni\ncontent, 4.3 V cycling resulted in doubling the cell’s resistance (at the\nmost) for NMC532 and NMC640 compared to 4.10 V. However,\nNMC811 cells cycled to 4.20 V experienced 5-10 times the resistance\ngrowth that was seen in the same cells cycled to 4.06 V. We believe\nthis highlights an ongoing challenge with Ni-rich materials that will\ngreatly impact the cell lifetime and power capabilities. Therefore,\nlimiting the UCV when possible is a simple and important measure\nfor battery consumers to consider when operating Ni-rich cells.\nAdditionally, Ni-rich cells that are balanced to 4.04 or 4.06 V will\nrecover energy density compared to Ni-rich cells that are balanced to\n4.2 V and operated to 4.04 or 4.06 V. Acknowledgments The authors acknowledge financial support from the NSERC/\nTesla Canada Industrial Research Chair program. A.E. thanks Vanier CGS, Killam Foundation, and O’Brien Foundation for financial\nsupport. The authors thank Dr. Michael Metzger (Dalhousie\nUniversity) for his valuable feedback on the manuscript. ORCID References 1 J U Choi, N Voronina, Y.-K Sun, and S.-T Myung, “Recent progress and\nperspective of advanced high-energy co-less ni-rich cathodes for li-ion batteries:\n[yesterday, today, and tomorrow.” Adv Energy Mater., 10, 2002027 (2020).](https://doi.org/10.1002/aenm.202002027)\n2 K Märker, P J Reeves, C Xu, K J Griffith, and C P Grey, “Evolution of\nstructure and lithium dynamics in LiNi0.8Mn0.1Co0.1O2 (NMC811) Cathodes\n[during electrochemical cycling.” Chem",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "P Grey, “Evolution of\nstructure and lithium dynamics in LiNi0.8Mn0.1Co0.1O2 (NMC811) Cathodes\n[during electrochemical cycling.” Chem Mater., 31, 2545 (2019).](https://doi.org/10.1021/acs.chemmater.9b00140)\n3 J Li, L E Downie, L Ma, W Qiu, and J R Dahn, “Study of the failure\nmechanisms of LiNi0.8Mn0.1Co0.1O2 cathode material for lithium ion batteries.”\n[J Electrochem Soc., 162, A1401 (2015).](https://doi.org/10.1149/2.1011507jes)\n4 R Jung, M Metzger, F Maglia, C Stinner, and H A Gasteiger, “Chemical vs\nElectrochemical Electrolyte Oxidation on NMC111, NMC622, NMC811, LNMO,\n[and Conductive Carbon.” J Phys Chem Lett., 8, 4820 (2017).](https://doi.org/10.1021/acs.jpclett.7b01927)\n5 Y Liu, W Song, A Eldesoky, J Harlow, E R Logan, H Li, and J R Dahn, “The\nimpact of upper cut-off voltage on the cycling performance of li-ion cells with\n[positive electrodes having various nickel contents.” J Electrochem Soc., 169,](https://doi.org/10.1149/1945-7111/ac6456)\n040531 (2022).\n6 A Eldesoky et al., “Impact of graphite materials on the lifetime of nmc811/graphite\npouch cells: part II long-term cycling, stack pressure growth, isothermal micro[calorimetry, and lifetime projection.” J Electrochem Soc., 169, 010501 (2022).](https://doi.org/10.1149/1945-7111/ac42f1)\n7 H Li, A Liu, N Zhang, Y Wang, S Yin, H Wu, and J R Dahn, “An unavoidable\n[challenge for ni-rich positive electrode materials for lithium-ion batteries.” Chem.](https://doi.org/10.1021/acs.chemmater.9b02372)\n[Mater., 31, 7574 (2019).](https://doi.org/10.1021/acs.chemmater.9b02372)\n8 Z Xiao, Z Chi, L Song, Z Cao, and A",
      "page_num": 10,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 575
    },
    {
      "text": "Song, Z Cao, and A Li, “LiTa2PO8 coated nickel-rich cathode\n[material for improved electrochemical performance at high voltage.” Ceram Int.,](https://doi.org/10.1016/j.ceramint.2019.12.064)\n46, 8328 (2020).\n9 N Zhang, N Zaker, H Li, A Liu, J Inglis, L Jing, J Li, Y Li, G A Botton, and\nJ R Dahn, “Cobalt-free nickel-rich positive electrode materials with a core–shell\n[structure.” Chem Mater., 31, 10150 (2019).](https://doi.org/10.1021/acs.chemmater.9b03515)\n10 L Liu, W Gao, Y Cui, and S Chen, “A bifunctional additive Bi(4-Flurorophenyl)\nsulfone for enhancing the stability and safety of nickel-rich cathode based cells.”\n[J Alloys Compd., 820, 153069 (2020).](https://doi.org/10.1016/j.jallcom.2019.153069)\n11 A Eldesoky, M Bauer, T Bond, N Kowalski, J Corsten, D Rathore, R Dressler,\nand J R Dahn, “Long-term study on the impact of depth of discharge, c-rate,\nvoltage, and temperature on the lifetime of single-crystal nmc811/artificial graphite\n[pouch cells.” J Electrochem Soc., 169, 100531 (2022).](https://doi.org/10.1149/1945-7111/ac99a6)\n12 A Eldesoky, M Bauer, S Azam, E Zsoldos, W Song, R Weber, S Hy,\nM B Johnson, M Metzger, and J R Dahn, “Impact of graphite materials on the\nlifetime of NMC811/Graphite Pouch cells: part I material properties, arc safety tests, gas\n[generation, and room temperature cycling.” J Electrochem Soc., 168, 110543 (2021).](https://doi.org/10.1149/1945-7111/ac39fc)\n13 S Davidsson Kurland, “Energy use for GWh-scale lithium-ion battery production.”",
      "page_num": 10,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 513
    },
    {
      "text": "Davidsson Kurland, “Energy use for GWh-scale lithium-ion battery production.” [Environmental Research Communications, 2, 012001 (2020).](https://doi.org/10.1088/2515-7620/ab5e1e)\n14. J. E. Harlow et al., “A wide range of testing results on an excellent lithium-ion cell\n[chemistry to be used as benchmarks for new battery technologies.” J. Electrochem.](https://doi.org/10.1149/2.0981913jes)\n[Soc., 166, A3031 (2019).](https://doi.org/10.1149/2.0981913jes)\n15. R. Gauthier, A. Luscombe, T. Bond, M. Bauer, M. Johnson, J. Harlow, A. J. Louli,\nand J. R. Dahn, “How do depth of discharge, c-rate and calendar age affect capacity",
      "page_num": 10,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 207
    },
    {
      "text": "Journal of The Electrochemical Society, 2023 170 080515 retention, impedance growth, the electrodes, and the electrolyte in li-ion cells?”\nJ. Electrochem. Soc., 169, 020518 (2022).\n16. M. Ecker, N. Nieto, S. Käbitz, J. Schmalstieg, H. Blanke, A. Warnecke, and\nD. U. Sauer, “Calendar and cycle life study of Li(NiMnCo)O2-Based 18650\n[lithium-ion batteries.” J. Power Sources, 248, 839 (2014).](https://doi.org/10.1016/j.jpowsour.2013.09.143)\n17. M. Lewerenz and D. U. Sauer, “Evaluation of cyclic aging tests of prismatic\nautomotive LiNiMnCoO2-graphite cells considering influence of homogeneity and\n[anode overhang.” Journal of Energy Storage, 18, 421 (2018).](https://doi.org/10.1016/j.est.2018.06.003)\n18. J. C. Burns, N. N. Sinha, D. J. Coyle, G. Jain, C. M. VanElzen, W. M. Lamanna,\nA. Xiao, E. Scott, J. P. Gardner, and J. R. Dahn, “The impact of varying the\nconcentration of vinylene carbonate electrolyte additive in wound li-ion cells.”\n[J. Electrochem. Soc., 159, A85 (2011).](https://doi.org/10.1149/2.028202jes)",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 362
    },
    {
      "text": "19. Z. L. Brown and B. L. Lucht, “Synergistic performance of lithium difluoro(oxalato)\nborate and fluoroethylene carbonate in carbonate electrolytes for lithium metal\nanodes.” J. Electrochem. Soc., 166, A5117 (2019).\n20. M. Broussely, P. Biensan, F. Bonhomme, P. Blanchard, S. Herreyre, K. Nechev,\n[and R. J. Staniewicz, “Main aging mechanisms in li ion batteries.” In Journal of](https://doi.org/10.1016/j.jpowsour.2005.03.172)\n[Power Sources, 146, 90 (2005).](https://doi.org/10.1016/j.jpowsour.2005.03.172)\n21. M. Broussely, S. Herreyre, P. Biensan, P. Kasztejna, K. Nechev, and R. J. Staniewicz,\n“Aging mechanism in li ion cells and calendar life predictions.” J. Power Sources,\n97–98, 13 (2001).\n22. B. Gyenes, D. A. Stevens, V. L. Chevrier, and J. R. Dahn, “Understanding\nanomalous behavior in coulombic efficiency measurements on li-ion batteries.”\nJ. Electrochem. Soc., 162, A278 (2014).",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 314
    }
  ],
  "total_chunks": 25,
  "created_at": "2026-02-04 14:04:56"
}