{
  "filename": "How_Observable_Is_Lithium_Plating_Differential_Vol.pdf",
  "chunks": [
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A725",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 24
    },
    {
      "text": "**Ian D. Campbell,** **Mohamed Marzook,** **Monica Marinescu,** **and Gregory J. Offer** **∗,z** _Department of Mechanical Engineering, Imperial College London, South Kensington, London SW7 2AZ,_\n_United Kingdom_ Fast charging of batteries is currently limited, particularly at low temperatures, due to difficulties in understanding lithium plating.\nAccurate, online quantification of lithium plating increases safety, enables charging at speeds closer to the electrochemical limit\nand accelerates charge profile development. This work uses different cell cooling strategies to expose how voltage plateaus arising\nfrom cell self-heating and concentration gradients during fast charging can falsely indicate plating, contrary to prevalent current\nassumptions. A solution is provided using Differential Voltage (DV) analysis, which confirms that lithium stripping is observable.\nHowever, scanning electron microscopy and energy-dispersive X-ray analysis are used to demonstrate the inability of the plateau\ntechnique to detect plating under certain conditions. The work highlights error in conventional plating quantification that leads to the\ndangerous underestimation of plated amounts. A novel method of using voltage plateau end-point gradients is proposed to extend the\nsensitivity of the technique, enabling measurement of lower levels of lithium stripping and plating. The results are especially relevant\nto automotive OEMs and engineers wishing to expand their online and offline tools for fast charging algorithm development, charge\nmanagement and state-of-health diagnostics.\n© The Author(s) 2019. Published by ECS. This is an open access article distributed under the terms of the Creative Commons\n[Attribution 4.0 License (CC BY, http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse of the work in any](http://creativecommons.org/licenses/by/4.0/)\n[medium, provided the original work is properly cited. [DOI: 10.1149/2.0821904jes]](http://dx.doi.org/10.1149/2.0821904jes) Manuscript submitted December 28, 2018; revised manuscript received February 17, 2019. Published March 6, 2019.",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "**How Observable Is Lithium Plating? Differential Voltage Analysis** **to Identify and Quantify Lithium Plating Following Fast Charging** **of Cold Lithium-Ion Batteries**",
      "token_count": 449
    },
    {
      "text": "Manuscript submitted December 28, 2018; revised manuscript received February 17, 2019. Published March 6, 2019. Fast charging of lithium-ion batteries remains a priority amongst\nautomotive Original Equipment Manufacturers (OEMs) that are electrifying their product portfolios. Consequently, there are increasingly\nlarge demands on time and monetary investment in the development\nof fast charging strategies, for which, the avoidance of lithium plating\nis a priority. However, the techniques available for inexpensive, nondestructive and fast plating identification and quantification are immature and contribute to the cost of development. Moreover, increased accuracy of plating assessments is required for improved online, Battery\nManagement System (BMS)-based diagnostics and charge strategy\nde-rating. Researchers also demand alternatives to destructive evaluation techniques. The instability of Li [0] coupled with the timeframe\nbetween plating and cell disassemly presents a major problem because\nex-situ observations may no longer be accurate. [1] During charging of a lithium-ion cell with a graphitic Negative\nElectrode (NE) the reversible lithium intercalation reaction proceeds\nin the reduction direction according to Equation 1 at the NE. Under\ncertain conditions, overpotential exceeding NE equilibrium potential\nor Li concentration saturation of the graphite, the competing lithium\nmetal deposition reaction additionally proceeds. It does so in the reduction direction according to Equation 2, inducing lithium plating\n(deposition). In this work, the phrase “the technique” is used to refer to the practice\nof using the high voltage plateau to identify and/or quantify lithium\nplating and stripping. Throughout the technique’s evolution from a\nqualitative to a quantitative tool, few works have addressed its accuracy and reliability or considered in full the difference between\nquantifying stripping and quantifying plating. [11]",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "**How Observable Is Lithium Plating? Differential Voltage Analysis** **to Identify and Quantify Lithium Plating Following Fast Charging** **of Cold Lithium-Ion Batteries**",
      "token_count": 378
    },
    {
      "text": "In this work, the phrase “the technique” is used to refer to the practice\nof using the high voltage plateau to identify and/or quantify lithium\nplating and stripping. Throughout the technique’s evolution from a\nqualitative to a quantitative tool, few works have addressed its accuracy and reliability or considered in full the difference between\nquantifying stripping and quantifying plating. [11] Moreover, the use of the technique for lithium plating identification\nalone is still not fully understood and is without consensus. The traditional belief that an absence of a plateau is indicative of an absence\nof plating [2][,][5] has been challenged, but remains unclear. The concern\nby Smart et al. [5] that Chemical Intercalation (CI) could result in a reduction or absence of Li [0] availability, and consequently the absence\nof a stripping plateau in spite of plating having occurred, has been\nreiterated. [12][–][15] It has been suggested that the stripping current is dependent upon the areal coverage of lithium [16] and additionally, that\nthe area be of a minimum size for detection. [11][,][14] Following plating,\nthe interplay between CI, stripping and irreversible Loss of Lithium\nInventory (LLI) owing to parasitic reaction is acknowledged as complex, and requires further studies to develop the state of knowledge.\nThe technique has been nearly universally developed and studied\ni) under the conditions of slow charging where cell self-heating is\ninsubstantial and with cell temperature deviating little spatially and\nversus the ambient, and additionally, where solid-phase lithium concentration gradients are small, or ii) at ambient temperatures so low\nthat they are rarely applicable to Electric Vehicles (EVs). This development history has led to perpetuation of the theory that the technique\nfunctions only at temperatures of −20 [◦] C and below. [13][,][14][,][16] However,\nthe discharge plateau technique’s performance is arguably of greatest\ninterest to the automotive sector following fast charging, when the\npropensity to lithium plate is greater than following slow charging,\nand at temperatures more commonly encountered by EVs. A dearth\nof information exists under these conditions, as Table I demonstrates.\nThe majority of works given in Table I report only ambient\ntemperatures and neglect the difference relative to cell temperature.\nUhlmann,Illig,Ender,Schuster&Ivers-Tifféeinvestigatedplatingfollowing 10 C charge pulses at 23 [◦] C, but via the alternative relaxation\ntechnique. [16] While works such as that by Tippmann, Walper, Balboa,\nSpier & Bessler have simulated the influence of cell self-heating on NE\npotential during charging, few have done so with a focus on the high\nvoltage plateau. [11][,][17] Yang, Ge, Liu, Leng, & Wang probed via simulation the influence of temperature on the voltage curves, again during\nrelaxation, for the same quantity of Li [0] . [11] Similarly, little attention has\nbeen afforded to the influence of instantaneous State of Charge (iSOC)",
      "page_num": 2,
      "chunk_index": 3,
      "section_name": "**How Observable Is Lithium Plating? Differential Voltage Analysis** **to Identify and Quantify Lithium Plating Following Fast Charging** **of Cold Lithium-Ion Batteries**",
      "token_count": 662
    },
    {
      "text": "Li _x_ C6 −−−−→oxidation\n←−−−− _x_ Li [+] + _x_ e [−] + 6C [1]\nreduction −−−−→oxidation\nLi [0] ←−−−− (1 − _x_ )Li [+] + (1 − _x_ )e [−] [2]\nreduction Since both reactions are reversible, cell discharging oxidizes\nlithium sourced from both reactants, Li _x_ C6 and Li [0] . Versus Li _x_ C6\noxidation, the relatively facile Li [0] oxidation (stripping) process and\nassociated lower oxidation potential produce a high voltage discharge\nplateau. [2][,][3] The plateau has traditionally been used to identify Li [0] stripping, and by extension, lithium plating. [4][–][7] Extensions of those works\nreport the discharge plateau measurement as a technique for the semiquantitative assessment of lithium plating. [2][,][8] Petzl & Danzer further\nreported the technique as fully quantitative, employing differential\nvoltage analysis for unambiguous determination of plateau length. [9][,][10] ∗Electrochemical Society Member.\n[zE-mail: gregory.offer@imperial.ac.uk](mailto:gregory.offer@imperial.ac.uk)",
      "page_num": 2,
      "chunk_index": 4,
      "section_name": "**How Observable Is Lithium Plating? Differential Voltage Analysis** **to Identify and Quantify Lithium Plating Following Fast Charging** **of Cold Lithium-Ion Batteries**",
      "token_count": 295
    },
    {
      "text": "A726 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) **Table I. Summary of charge rates and ambient temperatures,**\n_**T**_ **amb, during application & study of the discharge plateau**\n**technique in literature.** Max. rate\nWork (Low _T_ amb) _T_ amb, ( [◦] C) Pub. Smart et al. [4] 18 [C] −40, −20, 23 2002 Smart et al. [5] 13 [C] −40, −20, 0, 23 2003 Fan & Tan [6] 1 _._ 125 [C] −30, −20, RT [a] 2006 Smart & Ratnakumar [2] 51 _._ 7 [C] −40, −30, −20, 25 2011 Zinth et al. [1] 51 [C] −20 2014 Petzl & Danzer [9] 1 C −26, −24, −22, −20 2014 Danzer, Bauer, Schindler & Petzl [10] 1 C −20, 25 2016 Waldmann et al. [29] 21 [C] 0, 5, 25, 45 2017 Waldmann & W-Mehrens [15] 21 [C] 0 2017 Kowal et al. [33] 3 C −20, −10, 0 2018 Yang et al. [11] 5 C 0 2018 Ren et al. [35] 2 C −5 2018 aRT refers to Room Temperature, where authors did not specify a value.",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 380
    },
    {
      "text": "aRT refers to Room Temperature, where authors did not specify a value. on the technique’s performance. Recently, it has been reported that\nwithout a reference electrode, plating detection via differential voltage\nanalysis is possible only when the Positive Electrode (PE) contributes\nnegligiblytothecellpotentialprofile,suchaswiththeuseofLiFePO4. [9]\nThis is in spite of the existence of works to the contrary demonstrating\nsuccessful use of the technique with mesocarbon microbead-Nickel\nCobalt (NC) [2] and graphite-Nickel Manganese Cobalt (NMC) [11] cells.\nIn this work, we investigate the technique’s characteristics in light\nof high charge rates—up to 9 _._ 1 mA _._ cm [−][2], equivalent to 5 _._ 0 C—at 0 [◦] C.\nIn doing so, we highlight issues with the voltage plateau for plating\nidentification in the presence of high cell temperatures and steep solid\nphase concentration gradients associated with fast charging. The results indicate that the technique is applicable at temperatures far above\n−20 [◦] C, thereby resolving suggestions to the contrary. We demonstrate\nconclusively through the use of a graphite-NC cell chemistry that even\nwhere the differential voltage signature is a composite of two complex\nindividual electrode potentials, both plating detection and quantification are possible with the voltage plateau technique in commercial\ncells. We discuss important considerations related to the accuracy of\nthe technique that we believe remain under-addressed following its **Table II. Test conditions, short-term tests with 0.1 mA.cm** **[−][2]** **discharging.** **Table III. Test conditions, medium-term & varied discharge rate**\n**tests.** Test Parameter/Cell ID MT1 MT2 DR1 DR2\naCooling N-cvn. N-cvn. Cdn. Cdn.\nCharge current density 3 _._ 6 7 _._ 3 5 _._ 5 5 _._ 5\n(mA _._ cm [−][2] ) Charge nominal C-rate 2 _._ 0 4 _._ 0 3 _._ 0 3 _._ 0\nCharge current (A) 15 _._ 00 30 _._ 00 22 _._ 50 22 _._ 50\nbCell capacity, _Q_ meascell 7532 _._ 59 7461 _._ 00 7492 _._ 07 7448 _._ 56\n(mAh)",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 545
    },
    {
      "text": "Normalised _Q_ meascell (%) 100 _._ 43 99 _._ 48 99 _._ 89 99 _._ 31\nEOC criterion, _Q_ EOCcell 6026 _._ 07 5968 _._ 80 5993 _._ 66 5958 _._ 85\n(mAh) Discharge current density 0 _._ 1 0 _._ 1 0 _._ 4 1 _._ 8\n(mA _._ cm [−][2] ) cParallel cycler channels 1 2 2 2 aN-cvn. = Natural convection, Cdn. = Conduction.\nbMeasured on charge at 0 _._ 2 mA _._ cm−2 (0 _._ 1 C) using a single BCS-815\nchannel.\ncNumberofparallel-connectedBCS-815channelsusedforcyclingafter\n_Q_ meascell measurement. evolution from qualitative indicator to quantitative tool; namely the\nunderestimation of plating by neglecting CI of Li [0] during the charge\nprocess. The results provide strong evidence in support of the theory\nthat the absence of a high voltage plateau is not indicative of an absence of plating. Furthermore, we probe increased discharge rates as a\nstrategy for increasing the practicality of the technique and study their\ninfluence on the accuracy of plating estimates. Finally, we propose and\ndemonstrate a method for increasing the sensitivity of the technique\nfor quantification, extending the scope of its use. **Experimental** 17 commercial cells were fast charged under a combination of different rates, cooling scenarios and cycle counts. Tables II and III summarize the experimental details. All testing was performed on commerciallyavailablehighenergyKokam7 _._ 5 Ah ( _Q_ nom )cellswithmodel\nnumber SLPB75106100. All cells were drawn from the same batch\nand exhibited a standard deviation between normalized charge capacities of _<_ 0 _._ 9%. Although nominally NMC-graphite, Inductively Coupled Plasma Optical Emission Spectroscopy (ICP-OES) has shown\nthat the PE is rather LiNi0.4Co0.6O2. Moreover, the NE is reportedly\n4 _._ 4% larger in surface area than the positive. The maximum",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 491
    },
    {
      "text": "Test Parameter/Cell ID A B C D E F G H I J K L M\naCooling N-cvn. N-cvn. N-cvn. N-cvn. Cdn. Cdn. Cdn. Cdn. Cdn. Cdn. Cdn. Cdn. Cdn.\nCharge current density 2 _._ 7 3 _._ 6 5 _._ 5 7 _._ 3 1 _._ 8 2 _._ 7 3 _._ 6 4 _._ 6 5 _._ 5 6 _._ 4 7 _._ 3 8 _._ 2 9 _._ 1\n(mA _._ cm [−][2] ) Charge nominal C-rate 1 _._ 5 2 _._ 0 3 _._ 0 4 _._ 0 1 _._ 0 1 _._ 5 2 _._ 0 2 _._ 5 3 _._ 0 3 _._ 5 4 _._ 0 4 _._ 5 5 _._ 0\nCharge current (A) 11 _._ 25 15 _._ 00 22 _._ 50 30 _._ 00 7 _._ 50 11 _._ 25 15 _._ 00 18 _._ 75 22 _._ 50 26 _._ 25 30 _._ 00 33 _._ 75 37 _._ 50\nbCell capacity, _Q_ meascell 7460 _._ 61 7526 _._ 66 7691 _._ 6 7629 _._ 17 7452 _._ 57 7457 _._ 02 7465 _._ 89 7458 _._ 22 7465 _._ 53 7474 _._ 49 7445 _._ 89 7468 _._ 83 7495 _._ 42\n(mAh)",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 430
    },
    {
      "text": "Normalised _Q_ meascell (%) 99 _._ 47 100 _._ 36 102 _._ 55 101 _._ 72 99 _._ 37 99 _._ 43 99 _._ 55 99 _._ 44 99 _._ 54 99 _._ 66 99 _._ 28 99 _._ 58 99 _._ 94\nEOC criterion, _Q_ EOCcell 5968 _._ 49 6021 _._ 33 6153 _._ 28 6103 _._ 34 5962 _._ 06 5965 _._ 62 5972 _._ 71 5966 _._ 58 5972 _._ 42 5979 _._ 59 5956 _._ 71 5975 _._ 06 5996 _._ 34\n(mAh) cParallel cycler channels 1 1 2 2 1 1 1 2 2 2 2 3 3 aN-cvn. = Natural convection, Cdn. = Conduction.\nbMeasured on charge at 0 _._ 2 mA _._ cm−2 (0 _._ 1 C) using a single BCS-815 channel.\ncNumber of parallel-connected BCS-815 channels used for cycling after _Q_ meascell measurement.",
      "page_num": 3,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 296
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A727 **Figure 1.** Rendering of the pair of cooling rigs used for conduction cooling\ntests. manufacturer-recommended charge rate is 1 _._ 8 mA _._ cm [−][2] (1 _._ 0 C) in the\nrange 0 [◦] C to 40 [◦] C, whilst lower ( _V_ min) and upper ( _V_ max) cutoff voltages\nare 2 _._ 7 V and 4 _._ 2 V, respectively. [18]",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 136
    },
    {
      "text": "manufacturer-recommended charge rate is 1 _._ 8 mA _._ cm [−][2] (1 _._ 0 C) in the\nrange 0 [◦] C to 40 [◦] C, whilst lower ( _V_ min) and upper ( _V_ max) cutoff voltages\nare 2 _._ 7 V and 4 _._ 2 V, respectively. [18] Testing was conducted under two thermal scenarios, natural air\nconvection and conduction. For the natural convection tests, cells were\ncycled in an incubator (BINDER, KB 23) with a set point of 0 [◦] C. A fan\nspeed of 100% was required to reach the set point, but all cells were\nenclosed in plastic containers to maintain static ambient air. Short\nterm cell tests under natural convection conditions involved the following fast charge rates: 2 _._ 7 mA _._ cm [−][2] (1 _._ 5 C), 3 _._ 6 mA _._ cm [−][2] (2 _._ 0 C),\n5 _._ 5 mA _._ cm [−][2] (3 _._ 0 C) and 7 _._ 3 mA _._ cm [−][2] (4 _._ 0 C). All C-rates were calculatedusingnominalcellcapacity.ThreetypeKthermocouples(TCs)\n(accuracy ±1 _._ 5 [◦] C) were adhered to one face of each cell; one adjacent\nto the tabs, one at the geometric center and another at the corner opposite the tabs. Temperature closest to the tabs was recorded using the\nbattery cycler, while temperatures at all other locations, including a\nfourth TC measuring ambient (incubator) temperature, were recorded\nusing a data logger (Pico Technology, TC-08).\nFor the conduction tests, cells were cycled in the custom cooling rigs illustrated in Figure 1. Thermal paste with a conductivity of\n5 W _._ m [−][1] _._ K [−][1] was applied to both faces of the cells before they were\nclamped at 20% State of Charge (SOC) between aluminum cooling\nplates by torquing clamping bolts to 1 Nm. This resulted in a cell facial\npressure of 0 _._ 14 MPa that has been demonstrated to not significantly\ninfluence electrochemical behavior. [19] A water/propylene glycol (1:1)\ncoolant was maintained at a set point of 0 [◦] C and circulated with 100%\npump speed using a refrigerated bath circulator (Thermo Fisher Scientific, ARCTIC PC200-A25) through water blocks plumbed in parallel.\nHence, the cooling plates were in turn cooled by forced convection.\nThe rigs were contained within a temperature chamber (ESPEC, BPL3) with a set point of 0 [◦] C. Short term cell tests under conduction conditions involved fast charge rates from 1 _._ 8 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2]\n(1 _._ 0 C to 5 _._ 0 C) in 0 _._ 9 mA _._ cm [−][2] (0 _._ 5 C) increments. Type-K TCs were\nagain used; one on the sidewall containing the tabs and another on the\nopposite side wall.\nAll charge-discharge cycling was conducted using a battery cycler\n(Bio-Logic, BCS-815) where cell tab contact resistances had been\nminimized with tightly-clamped, polished brass tab clamps. Each test\nwas conducted on a pristine cell to eliminate the influence of any prior",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 811
    },
    {
      "text": "manufacturer-recommended charge rate is 1 _._ 8 mA _._ cm [−][2] (1 _._ 0 C) in the\nrange 0 [◦] C to 40 [◦] C, whilst lower ( _V_ min) and upper ( _V_ max) cutoff voltages\nare 2 _._ 7 V and 4 _._ 2 V, respectively. [18] Testing was conducted under two thermal scenarios, natural air\nconvection and conduction. For the natural convection tests, cells were\ncycled in an incubator (BINDER, KB 23) with a set point of 0 [◦] C. A fan\nspeed of 100% was required to reach the set point, but all cells were\nenclosed in plastic containers to maintain static ambient air. Short\nterm cell tests under natural convection conditions involved the following fast charge rates: 2 _._ 7 mA _._ cm [−][2] (1 _._ 5 C), 3 _._ 6 mA _._ cm [−][2] (2 _._ 0 C),\n5 _._ 5 mA _._ cm [−][2] (3 _._ 0 C) and 7 _._ 3 mA _._ cm [−][2] (4 _._ 0 C). All C-rates were calculatedusingnominalcellcapacity.ThreetypeKthermocouples(TCs)\n(accuracy ±1 _._ 5 [◦] C) were adhered to one face of each cell; one adjacent\nto the tabs, one at the geometric center and another at the corner opposite the tabs. Temperature closest to the tabs was recorded using the\nbattery cycler, while temperatures at all other locations, including a\nfourth TC measuring ambient (incubator) temperature, were recorded\nusing a data logger (Pico Technology, TC-08).\nFor the conduction tests, cells were cycled in the custom cooling rigs illustrated in Figure 1. Thermal paste with a conductivity of\n5 W _._ m [−][1] _._ K [−][1] was applied to both faces of the cells before they were\nclamped at 20% State of Charge (SOC) between aluminum cooling\nplates by torquing clamping bolts to 1 Nm. This resulted in a cell facial\npressure of 0 _._ 14 MPa that has been demonstrated to not significantly\ninfluence electrochemical behavior. [19] A water/propylene glycol (1:1)\ncoolant was maintained at a set point of 0 [◦] C and circulated with 100%\npump speed using a refrigerated bath circulator (Thermo Fisher Scientific, ARCTIC PC200-A25) through water blocks plumbed in parallel.\nHence, the cooling plates were in turn cooled by forced convection.\nThe rigs were contained within a temperature chamber (ESPEC, BPL3) with a set point of 0 [◦] C. Short term cell tests under conduction conditions involved fast charge rates from 1 _._ 8 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2]\n(1 _._ 0 C to 5 _._ 0 C) in 0 _._ 9 mA _._ cm [−][2] (0 _._ 5 C) increments. Type-K TCs were\nagain used; one on the sidewall containing the tabs and another on the\nopposite side wall.\nAll charge-discharge cycling was conducted using a battery cycler\n(Bio-Logic, BCS-815) where cell tab contact resistances had been\nminimized with tightly-clamped, polished brass tab clamps. Each test\nwas conducted on a pristine cell to eliminate the influence of any prior plating",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 813
    },
    {
      "text": "Testing was conducted under two thermal scenarios, natural air\nconvection and conduction. For the natural convection tests, cells were\ncycled in an incubator (BINDER, KB 23) with a set point of 0 [◦] C. A fan\nspeed of 100% was required to reach the set point, but all cells were\nenclosed in plastic containers to maintain static ambient air. Short\nterm cell tests under natural convection conditions involved the following fast charge rates: 2 _._ 7 mA _._ cm [−][2] (1 _._ 5 C), 3 _._ 6 mA _._ cm [−][2] (2 _._ 0 C),\n5 _._ 5 mA _._ cm [−][2] (3 _._ 0 C) and 7 _._ 3 mA _._ cm [−][2] (4 _._ 0 C). All C-rates were calculatedusingnominalcellcapacity.ThreetypeKthermocouples(TCs)\n(accuracy ±1 _._ 5 [◦] C) were adhered to one face of each cell; one adjacent\nto the tabs, one at the geometric center and another at the corner opposite the tabs. Temperature closest to the tabs was recorded using the\nbattery cycler, while temperatures at all other locations, including a\nfourth TC measuring ambient (incubator) temperature, were recorded\nusing a data logger (Pico Technology, TC-08).\nFor the conduction tests, cells were cycled in the custom cooling rigs illustrated in Figure 1. Thermal paste with a conductivity of\n5 W _._ m [−][1] _._ K [−][1] was applied to both faces of the cells before they were\nclamped at 20% State of Charge (SOC) between aluminum cooling\nplates by torquing clamping bolts to 1 Nm. This resulted in a cell facial\npressure of 0 _._ 14 MPa that has been demonstrated to not significantly\ninfluence electrochemical behavior. [19] A water/propylene glycol (1:1)\ncoolant was maintained at a set point of 0 [◦] C and circulated with 100%\npump speed using a refrigerated bath circulator (Thermo Fisher Scientific, ARCTIC PC200-A25) through water blocks plumbed in parallel.\nHence, the cooling plates were in turn cooled by forced convection.\nThe rigs were contained within a temperature chamber (ESPEC, BPL3) with a set point of 0 [◦] C. Short term cell tests under conduction conditions involved fast charge rates from 1 _._ 8 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2]\n(1 _._ 0 C to 5 _._ 0 C) in 0 _._ 9 mA _._ cm [−][2] (0 _._ 5 C) increments. Type-K TCs were\nagain used; one on the sidewall containing the tabs and another on the\nopposite side wall.\nAll charge-discharge cycling was conducted using a battery cycler\n(Bio-Logic, BCS-815) where cell tab contact resistances had been\nminimized with tightly-clamped, polished brass tab clamps. Each test\nwas conducted on a pristine cell to eliminate the influence of any prior plating With the exception of the different fast charge rates, all cells\nwere subjected to identical cycling since history is known to influence\nthe discharge voltage profile",
      "page_num": 4,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 751
    },
    {
      "text": "plating With the exception of the different fast charge rates, all cells\nwere subjected to identical cycling since history is known to influence\nthe discharge voltage profile [6] All charging was via a Constant Current Constant Voltage (CCCV) strategy, in spite of the alternatives that\nexist, because of its widespread usage Prior to beginning cycling, all\ncells were allowed a minimum of 10 hours to thermally equilibrate\nat the set point Cells were initially discharged at 0 _._ 4 mA _._ cm [−][2] (C/5)\nto _V_ min, allowed 1 hour to equilibrate, then charged (0 _._ 2 mA _._ cm [−][2]\n(C/10) Constant Current (CC), Constant Voltage (CV) until current\n_I <_ 0 _._ 1 mA _._ cm [−][2] (C/20)) to evaluate capacity, _Q_  Following _Q_ evaluation, all charges were from 0% to 80% SOC, in-line with current Society of Automotive Engineers (SAE) Level 3 fast charging standards\nfor Battery Electric Vehicles (BEVs) [20] Moreover, end-of-charge was\ndetermined via coulomb counting and end-of-discharge by terminal\nvoltagecutoff.Cellswererechargedatareferencerateof0 _._ 2 mA _._ cm [−][2]\n(the “reference charge”) and immediately discharged at 0 _._ 1 mA _._ cm [−][2]\nto _V_ min (the “reference discharge”) Following 1 hour of equilibration,\ncells were recharged at one of the fast charging rates given above\nand again immediately discharged at 0 _._ 1 mA _._ cm [−][2] to _V_ min For the\navoidance of doubt, immediate discharge following reference or fast\ncharging was used to avoid any relaxation time at this stage This is\ndesirable to minimize CI and to investigate the voltage plateau technique’s performance under practically-relevant conditions where time\nfor cell equilibration is often unavailable.\nTwo additional cells were charged following the above procedure\nunder conduction conditions at 5 _._ 5 mA _._ cm [−][2], but were discharged at\nthe higher rates of 0 _._ 4 mA _._ cm [−][2] and 1 _._ 8 mA _._ cm [−][2] to investigate the\neffect of accelerating detection",
      "page_num": 4,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 515
    },
    {
      "text": "For the\navoidance of doubt, immediate discharge following reference or fast\ncharging was used to avoid any relaxation time at this stage This is\ndesirable to minimize CI and to investigate the voltage plateau technique’s performance under practically-relevant conditions where time\nfor cell equilibration is often unavailable.\nTwo additional cells were charged following the above procedure\nunder conduction conditions at 5 _._ 5 mA _._ cm [−][2], but were discharged at\nthe higher rates of 0 _._ 4 mA _._ cm [−][2] and 1 _._ 8 mA _._ cm [−][2] to investigate the\neffect of accelerating detection A further two cells, referred to as\nMT1 and MT2, underwent medium term cycling under natural convection conditions to investigate the technique’s detection sensitivity.\nThe cells were subjected to consecutive fast charging at 3 _._ 6 mA _._ cm [−][2]\n(63 complete cycles) and 7 _._ 3 mA _._ cm [−][2] (64 complete cycles) with each\ndischarge at 0 _._ 1 mA _._ cm [−][2] followed by 1 hour of rest.\nWith the exception of the two cells which underwent medium term\ncycling, the following sampling frequencies, _f_ s, were used: reference\n0 _._ 2 mA _._ cm [−][2] charging at 1 Hz; reference 0 _._ 1 mA _._ cm [−][2] discharging,\nfast charging, and 0 _._ 1 mA _._ cm [−][2] discharging following fast charging\nall at 10 Hz The same _f_ s settings were used for the initial 13 (cell MT1)\nand 14 (cell MT2) complete cycles in medium term testing However,\nowing to battery cycler limitations, the sampling rate was reduced and\nall phases of the remaining cell MT1 and MT2 cycles were recorded\nat 1 Hz Owing to the noise associated with the data acquisition,\npost-processing was necessary and the parameters are provided here\nfor reproducibility All temperature data was smoothed with parameters { _method, window, iterations_ } = { _moving average,_ 0 _._ 5% _,_ 2}.\nWhenusedfordifferentialvoltageanalysis,voltagedatawassmoothed\nwith the same parameters All derivatives were computed by forward\nfinite differencing except for _Q_ d [2] _V_ d _Q_ [−][2] which was computed by differentiating a tenth-degree fitted polynomial to accommodate noise\nremaining in the smoothed _Q_ d _V_ d _Q_ [−][1] data.\nAlong with a pristine cell, those two cells which underwent\nmedium-term cycling were subsequently discharged to _V_ min and disassembled in a fume hood",
      "page_num": 4,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "All temperature data was smoothed with parameters { _method, window, iterations_ } = { _moving average,_ 0 _._ 5% _,_ 2}.\nWhenusedfordifferentialvoltageanalysis,voltagedatawassmoothed\nwith the same parameters All derivatives were computed by forward\nfinite differencing except for _Q_ d [2] _V_ d _Q_ [−][2] which was computed by differentiating a tenth-degree fitted polynomial to accommodate noise\nremaining in the smoothed _Q_ d _V_ d _Q_ [−][1] data.\nAlong with a pristine cell, those two cells which underwent\nmedium-term cycling were subsequently discharged to _V_ min and disassembled in a fume hood Their NE surface morphologies and material compositions were investigated using a combination of scanning\nelectron microscopy (Thermo Scientific Phenom ProX) and EnergyDispersive X-ray (EDX) analysis Scanning Electron Microscope\n(SEM) imaging was conducted with a magnification of 500 times and\nan acceleration voltage of 10 kV. **Results and Discussion** _**Reliable plating identification despite self-heating and con-**_\n_**centration gradients.—**_ Fast charging typically involves high current\ndensities which in turn induce large overpotentials. Heat generation via cell polarization in particular is then large, resulting in a\nrapid rise in cell temperature relative to the ambient and a reduction in cell impedance. Cell potential, current density and temperature\ndata during charging is provided in the Supplementary Material. The\nhighest cell surface temperature reached at the beginning of discharge",
      "page_num": 4,
      "chunk_index": 6,
      "section_name": "Content",
      "token_count": 332
    },
    {
      "text": "A728 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) **Figure 2.** Cell potential under galvanostatic discharge and a natural convection Boundary Condition (BC). Black curves represent discharge following 0 _._ 2 mA _._ cm [−][2]\ncharge, red curves represent discharge following fast charging at the current densities in each figure quadrant. In each quadrant, left insets show a magnified window\nat the beginning of discharge. Right insets show the difference in measured discharge capacity pre and post-fast charge. Ambient air temperature was 0 [◦] C. _�T_\nand _�V_ are are the difference in cell temperature and voltage respectively between the two discharges. under natural air convection was 23 _._ 1 [◦] C, immediately following\n7 _._ 3 mA _._ cm [−][2] charging. The high magnitude of the rise is due to a\ncombination of high current density, diminished conductivities at this\nlow ambient temperature and a low rate of heat transfer to the surroundings. Black dashed curves at the bottom of all quadrants in\nFigures 2 and 3 illustrate the difference in cell temperature between\nreference and post-fast charge discharges. Additionally, fast charging\ninduces large lithium concentration gradients in the electrode particle\nradial dimension. Consequently, faster charging results in a divergence\nof iSOC of the cell from average SOC (hereafter referred to as SOC),\nwhich contributes to the perception of a high voltage plateau. tials converge to the reference discharge potentials. This total convergence period can be lengthy, sometimes taking place over as much as\n∼1500 mAh of discharge capacity (see Figure 4a for conduction cooling). The length of this convergence period produces a feature similar\nto a second plateau at ∼750 mAh into the discharges. The difference\nin durations is greatest for the conductively cooled cells where _�T_ is\nforced to 0 [◦] C quickly and the low temperature slows solid-phase Li\ndiffusion.\nOn the basis of the terminal voltage profiles alone, it is unclear\nwhether the cause of the increased cell potential is a combined increase in cell temperature and iSOC, a potential plateau resulting from\na mixed potential with Li [0] stripping, or both. The similar effects of\ntemperature, _[dc]_ _dr_ [s] [variation and Li][0][ stripping therefore present a chal-]",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 520
    },
    {
      "text": "lenge for the programmatic, _a posteriori_ identification of plating on an\nEV BMS. The ambiguity is dangerous for two reasons. Firstly, a plated\ncell could be misidentified as a warm cell or a cell with iSOC ≫ SOC,\nconstituting a false negative diagnostic result and possibly dangerous\ncontinued use of the cell or EV. Secondly, the increased potential from\nlower impedance or high _c_ s [∗] [could be mistaken for a lithium stripping]\nplateau when no plating has occurred, constituting a false positive diagnostic result and possibly leading to premature cell replacement and\nadditional cost.\nFigure 3 presents results for the conduction cooling strategy only.\nHere, the highest cell surface temperature reached at the beginning of\ndischarge was 0 _._ 3 [◦] C, immediately following 2 _._ 7 mA _._ cm [−][2] charging.\nThe variation across all four fast charging rates was, at less than 0 _._ 2 [◦] C,\nwell within measurement error and just 1 _._ 3% of the variation observed\nacross convection tests. Moreover, post-fast charge discharge curves\nin Figures 2 and 3 are visually indistinguishable from each other, indicating that the raised cell potential curve feature occurs independently\nof the cell cooling strategy. _z_ i = _c_ s [∗]\n_c_ s _,_ max [−] [θ][0] [3]\nθ100 − θ0 where _c_ s [∗] [is the molar concentration of lithium at the particle surface,]\n_c_ s _,_ max is the maximum possible lithium concentration, θ0 and θ100 are\nthe electrode stoichiometries at 0% and 100% SOC respectively and\n_z_ i is iSOC.\nBoth of these charge characteristics—increased temperature and\niSOC—manifest early in all of the post-fast charge cell potential\ncurves of Figures 2 and 3 as a period of increased cell potential (red\ncurves) relative to the reference discharges (black curves). The iSOC\ndifference contributes only to the immediate difference in cell potential vs. the reference at the beginning of discharge because the\nsurface concentration falls immediately. The temperature effect contributes for longer, especially because inner layers cool more slowly\nthan the surface measurement indicates, but _�T_ is observed to always\nasymptote to 0 [◦] C within the initial 1000 mAh of discharge. As the\ndischarge progresses further and the cells which underwent fast charging have cooled, _[dc]_ _dr_ [s] [becomes relaxed and the post-fast charge poten-]",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A729 **Figure 3.** Cell potential under galvanostatic discharge and a conduction BC. Black curves represent discharge following 0 _._ 2 mA _._ cm [−][2] charge, red curves represent\ndischarge following fast charging at the current densities in each figure quadrant. Left insets show a magnified window at the beginning of discharge. Right insets\nshow the difference in measured discharge capacity pre and post-fast charge. Ambient air temperature was 0 [◦] C. _�T_ and _�V_ are are the difference in cell temperature\nand voltage respectively between the two discharges—note the different _T_ scale vs. Figure 2. The corresponding DV traces of Figures 4a (cooling via conduction) and 4b (cooling via natural convection) can decouple the influence of heightened cell temperature and _[dc]_ _dr_ [s] [inhomogeneity from]",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 219
    },
    {
      "text": "The corresponding DV traces of Figures 4a (cooling via conduction) and 4b (cooling via natural convection) can decouple the influence of heightened cell temperature and _[dc]_ _dr_ [s] [inhomogeneity from] the influence of plating, removing the ambiguity in identification. In\nDV analysis, inflections represent regions of relatively quick potential change for a given change in capacity. Therefore, troughs can be\nused to identify phase transitions (staging) in the electrode materials. Invariance in DV curves arises from potential plateaus across a\ncapacity window and can therefore be used to identify two-phase coexistence. d _V_ d _Q_ [−][1] data is in all cases normalized by multiplying it by\nthe measured capacity of that cell. This normalization facilitates comparisons with cells of different capacities, such as those tested in other\nworks. Since all full-cell curves represent 0 _._ 1 mA _._ cm [−][2] discharge, no\nohmic loss (IR) correction is required for comparison between full-cell\ncurves. In Figure 4b, during the initial 300 mAh (inset) of discharge\nno new inflection corresponding to a plateau end-point following fast\ncharging at any of the four rates was observed. This is especially evident when comparing to the black reference curves. The result does\nnot indicate the prior occurrence of plating and suggests that the terminal voltage deviation for these four cells is solely induced by thermal\nmeans and _c_ s gradients. The validity of correlating plateau absence\nwith plating absence is however explored later.\nIn contrast, in Figure 4a, the same magnified discharge window\n(inset) illustrates new DV inflections during discharge for cells which\nwere fast charged at the four high rates and conductively cooled.\nHence, the differential signatures indicate the presence of stripping\nplateaus, and by deduction, the prior occurrence of plating with all\nfour fast charge rates. The cell’s propensity to undergo lithium plating appears, as expected, to be sensitive to the aggressiveness of the\ncooling strategy. The thermal mass provided by the cooling plates and\nwater blocks may also have contributed to a delayed cell temperature",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 464
    },
    {
      "text": "rise and increased plating. Crucially, the ambiguity of interpreting the\ncell potential profile is avoided with identification of plating by DV\nanalysis. We therefore advocate its use not only for the quantification\nof plating, explored later, but also for its reliable identification under a\nwider set of circumstances than are possible by studying terminal voltage curves alone. This is especially so for programmatic use, where\nunambiguous and hence autonomous detection is facilitated only by\nuse of the DV method. For completeness, the Incremental Capacity\nAnalysis (ICA) method provides a similar identification benefit to the\nDV method. However, the DV method makes for easier graphical interpretation of reversible and irreversible Li [0] quantities.\nTo i) better understand the similarity between the discharge voltage\ncurves across both cooling scenarios, ii) better understand the extent\nto which internal layer (core) temperatures may be contributing to the\nvoltage plateau-like features, and iii) probe the reason for the ineffectiveness of the voltage curve identification method, we examine\nthe relative rates of heat transfer from and within the cell with a Biot\nnumber analysis. Bicdn = _[U]_ [cdn] _[L]_ [c][cdn] [4] _k_ cell = 31 _._ 21 × 10 [−][3] _<_ 0 _._ 1 ∴ ∇ _T_ is small Bicvn = _[h]_ [cvn] _[L]_ [c][cvn] [4a] _k_ cell = 2 _._ 59 × 10 [−][3] ≪ 0 _._ 1 ∴ ∇ _T_ is small",
      "page_num": 6,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 354
    },
    {
      "text": "A730 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019)",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 24
    },
    {
      "text": "A730 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) where Bicdn and Bicvn denote the Biot numbers, _U_ cdn\n(529 _._ 0 W _._ m [−][2] _._ K [−][1] ) and _h_ cvn (6 _._ 6 W _._ m [−][2] _._ K [−][1] ) the heat transfer\ncoefficients, and _L_ ccdn (3 _._ 95 × 10 [−][3] m) and _L_ ccvn (26 _._ 11 × 10 [−][3] m)\nthe characteristic lengths in the conduction and convection cooling\nscenarios, respectively. _k_ cell (66 _._ 95 W _._ m [−][1] _._ K [−][1] ) is the mass-averaged\nlumped cell thermal conductivity.\nSurface and average cell temperatures in the conduction scenario\nare lower in magnitude and variability relative to the convection scenario. However, the relative value of the conduction Biot number\n(31 _._ 21 × 10 [−][3] vs. 2 _._ 59 × 10 [−][3] for convection) suggests the presence\nof steeper thermal gradients for cells experiencing conduction. This is\nreasonable. Nonetheless, the absolute values of both Biot numbers, at\nless than 0 _._ 1, suggest that internal cell temperatures are within 5% of\neach other. [21] That is, by conventional thermal engineering standards,\nthermal gradients can in both scenarios be considered insignificant.\nHowever, Biot numbers less than 0 _._ 1 may not be enough to discount the influence of even slightly elevated core temperatures on the\nterminal voltage, owing to the lithium-ion battery’s extreme temperature sensitivity. We expect that core temperatures at the beginning of\ndischarges, prior to long slow discharge (cooling) periods, will certainly be influencing the discharge voltage profile. That is in spite of\nthe internal temperature gradients being small. In conclusion, identification of lithium stripping plateaus is difficult because _c_ s gradients\nexist, but also because even slightly elevated core temperatures have a\nmeaningful effect on the terminal voltage. Moreover, the results highlight that the influence of Li [0] oxidation on the terminal voltage cannot\nbe isolated in the voltage curve with an attempt to use aggressive cell\ncooling to attenuate the influence of temperature. Future experiments\nwith single-layer cells, providing improved control of thermal gradients, are planned. For now, it remains challenging to delineate the effects of core temperature and _c_ s gradients from each other. Combined,\nthey adjust the cell potential so extensively that plateau identification without differential techniques introduces risk of classification\nerror.\nReconstruction of the full-cell _Q_ d _V_ d _Q_ [−][1] profile from half-cell\ndata increases confidence that the newly observed inflections are not\nthe result of staging and demonstrates PE contributions and supports\ndegradation mode assignment in the following section of this work.\nd _V_ d _x_ [−][1] data for each of the PE and NE was obtained from [18] where\nit was recorded during charging of the electrodes. 43 sample points\nwith a mean sampling period of 0 _._ 022 ( _x_ in LixC6) were obtained for\nthe NE, while 41 sample points with a mean period of 0 _._ 024 ( _x_ in\nLixNi0 _._ 4Co0 _._ 6O2) were obtained for the PE. Full-cell discharge capacity in the range 0 mAh to 6000 mAh was mapped to the charge (PE)\nand discharge (NE) capacities of the electrodes used in half-cell measurements. That is, as a function of full-cell SOC the charge capacity\navailable in the PE, _Q_ pos, and charge capacity remaining in the NE,\n_Q_ neg, were obtained via Equations 5 and 6, respectively.",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 862
    },
    {
      "text": "_Q_ pos = − _z_ cell _s_ pos ( _C_ SEI - _u_ ) + 1 − _C_ SEI - θinitpos _Q_ nompos [5] θ100pos − θ0pos _s_ neg ( _u_  - _C_ SEI ) _c_ s _,_ maxpos _�_ θ100neg − θ0neg ⎞ ⎠ _Q_ nomneg [6] _z_ cell\n_c_ s _,_ maxneg _Q_ neg = ⎛ ⎝ 1 − φv _,_ w _pos_ [6a]\n1 − φv _,_ w _neg_ 1 − εpos\n1 − εneg **Figure 4.** a) Differential full-cell potential corresponding to discharges in\nFigure 3. Black curves are reference discharges, prior to any fast charging. b)\nDifferential full-cell potential corresponding to discharges in Figure 2. Black\ncurves are reference discharges, prior to fast charging. c) Differential half-cell\npseudo open-circuit potentials vs. Li/Li [+] measured at 23 [◦] C during half-cell\ncharging. [18] Pink curve is the calculated and normalized full-cell _Q_ d _V_ d _Q_ [−][1]\nprofile. _z_ cell = _Q_ cell [7]\n_Q_ nomcell where _z_ cell is full-cell SOC, _C_ SEI the capacity lost during initial Solid\nElectrolyte Interphase (SEI) formation and _u_ the fraction of PE utilization. θinitpos is the PE stoichiometry at the start of half-cell charging in [18]\nwhile θ0 _j_ and θ100 _j_, _j_ ∈{pos, neg}, are the electrode stoichiometries\nat 0% and 100% SOC respectively. _s_ pos and _s_ neg are half-cell capacity\nadjustment factors, both initially set to unity. _Q_ nompos and _Q_ nomneg are _�_ = _[v]_ [pos] _v_ neg",
      "page_num": 7,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 455
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A731 the measured half-cell charge capacities. _c_ s _,_ maxpos and _c_ s _,_ maxneg are the\nmaximum possible lithium concentrations. εpos and εneg are the electrode porosities, _v_ pos and _v_ neg the electrode layer volumes, and φv _,_ wpos\nand φv _,_ wneg the volume fractions of binder, filler and otherwise inactive material in each electrode layer, for the positive and negative electrodes, respectively. _Q_ cell (vector property) and _Q_ nomcell are the full-cell\ncharge withdrawn and nominal capacity, respectively. _Q_ pos and _Q_ neg\nwere provided to cubic smoothing spline functions that were fitted to\nthe half-cell d _V_ d _Q_ [−][1] data to obtain half-cell potential derivatives at\nthe same full-cell SOC points. This enabled the normalized full-cell\ndifferential voltage to be calculated by normalizing and subtracting\nthe d _V_ d _Q_ [−][1] profiles for each individual electrode, as per Equation 8. -   -   -   -   -   \nd _V_ d _V_ _Q_ [d] _[V]_ = _Q_ nom   - _Q_ nom [8] d _V_ d _V_ With feature assignment complete, it is clear that electrode staging is not taking place in the range 0 mAh to 240 mAh. Additionally,\nthe inflections present in the inset colored curves of Figure 4a following fast charging are not present in the reference curves prior to\nfast charging. By induction, these new inflections indicate the end of\nan Li [0] stripping process. Hence, even when commercial full-cell DV\nsignatures are complicated by combined contributions from both electrodes, plating identification by DV analysis is possible. Contrary to\nprior claims, the technique is not restricted to use with cells containing\nolivine or similar PE materials with high levels of _V_ - _x_ independence.\nThe belief that the technique functions only at very low temperatures,\nsuch as −20 [◦] C and below, is unequivocally inaccurate. Moreover,\nthe technique has been demonstrated to provide a useful indication\nof lithium plating following high rate charging and in the presence of\nsubstantial self-heating, extending its application scope to future EVs\nfeaturing Level 3 fast charging or higher.",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 528
    },
    {
      "text": "_**Absence of evidence is not evidence of absence.—**_ Figures 5a\n(3 _._ 6 mA _._ cm [−][2] fast charging) and 5b (7 _._ 3 mA _._ cm [−][2] fast charging)\nillustrate the normalized DV profiles of the two cells subjected to\nmedium term cycling. Two characteristics are prominent. Firstly, both\ncells show changes in thermodynamic behavior. Profile evolution\nthroughout the tests is evident, with the cell charged at the higher\nrate showing vastly more, owing to a greater degradation rate. Secondly, as illustrated in both insets, neither _Q_ d _V_ d _Q_ [−][1] profile shows\nany newly-formed inflections to indicate the end of a lithium stripping\nplateau. Hence, despite the low ambient temperature, high charge current densities and evident degradation, the voltage plateau technique\nprovides no indication of lithium plating having occurred. For those\nmedium term test cycles sampled at the lower value of _f_ s = 1 Hz,\nthe influence of sampling period on the ability to detect inflections\nwas considered. Of the nine inflections recorded in this work—all\nwith conductively cooled cells—the minimum inflection duration was\n190 _._ 4 mAh, equivalent to just over 30 minutes of discharging time.\nHence, the inflection period is typically long relative to the sampling\nperiod. With the reduced _f_ s, approximately 1800 samples would be\nrecorded during an inflection, and the reduced _f_ s is sufficient to detect\nan inflection. Moreover, since the smoothing window is defined as a\npercentage of dataset length, smoothing was applied at the same level,\nirrespective of the sampling frequency used.\nHowever, other characteristics of the DV signatures provide a\ncontrasting indication on plating occurrence. In Figure 5b, a nearcomplete disappearance and rightward shift of trough 1, denoted with\nthe upward-facing red arrow, is observable. The curve experiences a\nmajority shift to lower cell SOC and the gradual disappearance of\ntrough 4. Trough 5 experiences a continuous shift to more negative\nvalues and also to lower cell SOC. In DV analysis, LLI manifests\nas a lateral shifting of the curves to lower values on the capacity\naxis. [26] However, after normalizing to the reference discharge capacity,\nmean discharge capacity across all cycles is 99 _._ 07% with a standard\ndeviation σ of 0 _._ 15%. Hence, the curves show very little movement at\nthe capacity axis intersection, indicating minimal capacity fade.\nIf EOC for lithium-ion cells is imposed by a _V_ max criterion, the rising PE potential is typically the limiter on charge added. In this work\nthe cell is always recharged to a capacity limit corresponding to 80%\nSOC and the same quantity of charge capacity is withdrawn from the\nPE, and made available for discharge, irrespective of cycle number.\nHowever, the galvanostatic charge phase end point is imposed by the\n_V_ max criterion. Figure 6a illustrates the quantities of charge added until\nthat end point for each of the two cells. A plot of time until _V_ max shows\na similar trend. For both cells, _V_ max is reached increasingly early in the\ncharge process with more cycles, as indicated by the negative slopes\nof both curves. Since the NE potential is relatively invariant at high\niSOC and the PE potential gradient strongly positive, the declining\nCC phase charge quantities indicate PE slippage (stoichiometric drift)\nin the direction illustrated in Figure 6b. The slippage suggests the occurrence of LLI. The cell with unity State of Health (SOH) is given\nin Figure 6b (i), where the vertical offset between bars represents the\nPE potential as the EOC limiter and the NE potential as the End of",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 822
    },
    {
      "text": "d _Q_ = _Q_ nompos\ncell _,_ calcd d _Q_ - _Q_ nomneg\npos d _Q_ [8]\nneg The fit between calculated and measured full-cell _Q_ d _V_ d _Q_ [−][1] curves\nwas then improved by parameter adjustment. Firstly, PE and NE potential curves underwent shrinking by different amounts. This was\nachieved by introducing the non-zero, positive adjustment factors,\n_s j_, _j_ ∈{pos, neg}, into Equations 5 and 6. The physical meaning\nof the change is that PE and NE active mass fractions were previously overestimated. The result of the change is faster PE and NE\ncapacity depletion for each unit of full-cell discharge, and a shrinking\nof both electrode potential curves along the capacity axis. This had\nthe effect of introducing trough 1 into the calculated full-cell curve,\nFigure 4c, and additionally, of producing a more negative full-cell\ncurve, thereby improving Goodness of Fit (GoF). Secondly, electrode\nslippages were adjusted to minimize Residual Sum of Squares (RSS).\nThe result of slippage adjustment was to shift both the PE and NE\ndifferential curves to a higher full-cell SOC (leftward shift on the capacity axis), albeit by different amounts. Physically, this means that\nprior to parameter optimisation, experimental discharge from 80% of\nfull-cell capacity corresponded to a NE with more than the correct\namount of charge, and a PE with less than the correct amount. Following the optimisation, PE and NE degrees of lithiation at the beginning\nof full-cell discharge were such that d _V_ d _Q_ [−][1] features occurred at the\ncorrect points. The full-cell in this study had its discharge load applied\nat 80% SOC which introduced a region of highly negative d _V_ d _Q_ [−][1]\nthat is not present in the half-cell data, and thus is not present in the\ncalculated curve at 0 mAh. Although GoF could be improved beyond\nthe achieved 134 mV Root-Mean-Square Error (RMSE), it is sufficient\nfor feature assignment between the full-cell and individual electrodes.\nThe full-cell discharge rate is sufficiently low that this is possible with\nthe half-cell _Q_ d _V_ d _Q_ [−][1] curves. [22]",
      "page_num": 8,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 511
    },
    {
      "text": "When read from left to right, Figures 4a through 4c all correspond\nto full-cell discharging. Trough 1 (≈512 mAh, _x_ ≈ 0 _._ 56 in LixC6) is\nthe result of a high SOC NE phase transition from intercalation stage I\nto II. [23][,][24] The reduction in its intensity between reference and post-fast\ncharge curves is likely due to the large Li concentration gradient created in graphitic particles during fast charging. The gradient results\nin an Li _x_ C6 compound with different intercalation stages along the\nradial particle dimension, and the transition from stage I to II hence\nappearing to occur over a wider discharge window, reducing trough\nintensity. The rightward shifting of the trough is the result of the difference in _[dc]_ _dr_ [s] [at End of Charge (EOC) in the reference and fast charging] scenarios, discussed earlier. Higher _[dc]_ _dr_ [s] [values delay staging because] some graphite it saturated (Li1C6) and requires more capacity to be\nwithdrawn before reaching _x_ ≈ 0 _._ 56. For the same reason, there is a\nhorizontal offset between black reference and colored post-fast charge\ncurves in the insets.\nTrough 2 (≈1450 mAh, _x_ ≈ 0 _._ 50 in LixNi0 _._ 4Co0 _._ 6O2) is slight and\nis the result of a high SOC PE phase transition. Peak 3 is the result of\nphase equilibria in both electrodes and ends with the onset of staging\nin both. In the NE, this corresponds to a transition from stage II to III\n(≈3200 mAh, _x_ ≈ 0 _._ 31 in LixC6). [25] Troughs 4 (≈4155 mAh, _x_ ≈ 0 _._ 21\nin LixC6) and 5 (≈4720 mAh, _x_ ≈ 0 _._ 16 in LixC6) exist primarily from\nlow SOC NE contributions. They correspond to graphite transitions\nfrom stage IIIa to IIIb, and from stage IIIb to stage IV, respectively.",
      "page_num": 8,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 506
    },
    {
      "text": "A732 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) **Figure 6.** a) Charge added during the CC phase on each cycle for the two\ncells undergoing repeated fast charging. Negative slopes, _m_ MT1 and _m_ MT2,\nsuggest PE slippage for both cells. Slopes were calculated by simple linear\nregression. b) Electrode utilization at full SOH and reduced SOH following\nLLI, underlying DV curve shifts observed in Figure 5. **Figure 5.** 0 _._ 1 mA _._ cm [−][2] differential voltage signatures for a reference discharge (black curves) and for the following 63 discharges (colored curves)\nof two cells which underwent repeated fast charging. a) Cell MT1 cycled with\n3 _._ 6 mA _._ cm [−][2] fast charging. b) Cell MT2 cycled with 7 _._ 3 mA _._ cm [−][2] fast charging. Insets show a magnified window at the beginning of discharge. Discharge (EOD) limiter. Bar area (to scale) represents electrode capacity. Light gold colored areas are lithiated electrode material using\nlithium inventory nominally available for cycling. Dark gold colored\nareas represent the lithium inventory reserve. Dark gray (graphite)\nand light gray (NC) represent delithiated electrode material. During\ncharging, the fraction of LLI that is irreversible leads to a net per-cycle\nloss of lithium from the PE and a transition to the state depicted in\nFigure 6b (ii). The PE shifts downward, explaining the rightward shift\nof the full-cell DV curves observed in Figure 5. The lithium inventory\ndeclines, as represented by the reduction in light gold-colored area,\nowing to consumption via side reactions, primarily Equation 2. Moreover, at EOC although the charge corresponding to 80% SOC has been\npassed, the NE remains underlithiated because a fraction of the charge\nhas been channeled via the side reactions leading to LLI. This may\ncontribute to the reduction in trough 1 intensity as the NE struggles to\nreach the high degree of lithiation at which the trough occurs.",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 475
    },
    {
      "text": "The magnitude of the PE drift is unknown, but it is unlikely to be\nso far that at 80% SOC θ100pos is as low as 0 _._ 26. If θ100pos was already at\n0 _._ 26 following 63 cycles, or if charging had been conducted to 100%\nSOC from the beginning of the test, capacity loss would be evident as\nthe lithium inventory becomes exhausted. Continued cycling beyond\nthis point would lead to PE over-discharge and the possible collapse\nof the layered nickel cobalt dioxide structure. The probability of this\nis heightened in the particular case of the SLPB75106100 owing to\nthe absence of Mn. [27] The LLI-driven PE slippage strongly suggests\nthe occurrence of lithium plating, in contradiction to indications from\nthe discharge plateau technique. Although the majority of full-cell\nDV evolution can be explained by LLI, it is unlikely to be the only\nactive degradation mode. With large concentration gradients within\nparticles, Loss of Active Material (LAM) at both electrodes likely\nmakes an additional contribution, but it is not quantified here.\nFor the cell MT2 curve in Figure 6a, the sudden rise (cycle 3)\nmay be thermally-induced, while the sudden fall (cycle 32) is induced\nby slippage. At low cycle count, the cold cell reaches _V_ max nearly\nimmediately with application of the high charge current. By cycle\n3, the _V_ max criterion is avoided upon initial application of the charge\ncurrent. Self-heating may have driven cell core temperature above\na threshold, curtailing overpotential sufficiently. Other mechanisms\nare possible, but were not observable. As such, substantially more\ncharge can be added before _V_ max, and the CC charge phase duration is\nrelatively long. From cycle 32 onwards, galvanostatic phase duration\nhas reduced so much (owing to PE slippage) that the time available\nfor self-heating is insufficient to exceed the temperature threshold, and\nthe process reverts to the pre-cycle 3 state. A graphical explanation",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 445
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A733 **Figure 7.** Circular black markers indicate cell potential reaching _V_ max. Cell surface temperature, measured at a location adjacent to the tabs, is given by curve\ncolor. For cycles 3 to 31 inclusive, the temperature rise is sufficient to maintain _V < V_ max early in the charge. For all other cycles the majority of charge is instead\nadded in the potentiostatic phase. is provided by Figure 7. Furthermore, that the discharge capacity of\ncells MT1 and MT2 is not decreasing more substantially with cycling\nsuggests that cell kinetics are relatively unaffected. Large increases in\ninternal resistance would reduce the discharge capacity by causing the\n_V_ min to be reached sooner.\nDisassembly of the two cells yielded the NE images in Figures 8a\nand 8c, as well as their corresponding micrographs in Figures 8b and\n8d. Figure 8e presents the NE of a pristine cell for comparison, with\nits micrograph also provided in Figure 8f. The four circular marks\npresent on each electrode are believed to be artifacts of the cell assembly process. All three electrode sheets are similar in their coloring. Cell\nMT1’s NE exhibits small gray deposits around the electrode perimeter and adjacent to the copper tab—highlighted by the black braces.\nCell MT2’s NE exhibits a far more prominent line of deposits around\nthe entire perimeter. This feature was evident on electrodes throughout cell MT2’s stack. Additionally, in the lower middle of only this\nparticular NE sheet’s (present on both sides, one side shown only),\nthere was an additional area of deposits producing an “L” pattern. The\nreason for this feature’s occurrence is unknown. Preferential lithium\ndeposition at the electrode perimeter (the “edge effect”) is a widely acknowledged phenomenon, arising because of a tendency for the edge’s\nLi concentration to rise faster than in the bulk of the sheet. [28] The inner\nlayers of convectively cooled cells are marginally hotter than the outer\nlayers and therefore experience greater current densities. For that reason, they are more susceptible to lithium plating. On the other hand,\ntheir increased temperatures accelerate transport and kinetics and for\nthat reason, they are less susceptible to lithium plating. The outermost layers of cell MT2’s stack exhibited a difference in the amount\nof deposition between the end of the sheet with the tab (relatively\nmore) and the opposite end (relatively less). That deposition occurs\npreferentially near to the tab is unsurprising. As a result however, outermost layers appeared to have lower level of total deposition than\ninnermost layers, suggesting that in this example the effect from in",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 578
    },
    {
      "text": "creased current density dominates vs. that from increased kinetics and\ntransport.\nFigure 8b results from SEM imaging of an area of visibly unaltered\nNE sheet in cell MT1. i.e. an area where no deposition was observed\nwith the naked eye. The surface morphology is similar to that of the\npristine NE. Figure 8d results from imaging an area of cell MT2’s NE\nsheet immediately adjacent to where the gray deposits were discovered on the perimeter. Its newly-developed morphology differs greatly\nfrom that in deposit-free regions of cell MT1 and in the pristine NE.\nA drastic reduction in inter-particle porosity is evident and results\nfrom the apparent formation of a new layer. Similar morphological\nchanges have been observed following lithium plating elsewhere in\nthe literature. [29] For cell MT2, the EDX analysis was performed across an area\nat the edge of a NE sheet corresponding to a transitional region\nbetween graphite and the edge deposition. The results are presented in\nFigure 9 and indicate the presence of elemental carbon (blue, Atomic\nPercentage, at%, = 48 _._ 2%, certainty = 1 _._ 00), oxygen (yellow, at% =\n40 _._ 0%, certainty = 1 _._ 00), fluorine (purple, at% = 11 _._ 1%, certainty =\n0 _._ 99) and phosphorus (green, at% = 0 _._ 7%, certainty = 0 _._ 99). The\nPhenom ProX did not have the ability to detect lithium. The high at%\nof carbon is superseded by a high at% of oxygen as the surface morphology transitions from its pristine-like state to that of the newlyformed layer. The oxygen content suggests that the layer observed\nin Figure 8d results from oxide formation on reactive metallic lithium\nduring cell disassembly and exposure to air. Hence, the EDX and SEM\nanalyzes indicate the prior occurrence of lithium plating. The fluorine\nand phosphorus were likely deposited following solvent evaporation\nand precipitation of the hexafluorophosphate.\nCombined, DV signature shifting due to LLI, morphological\nchanges observed via SEM and oxidated layer discovery by EDX\non cell MT2’s NE all indicate that the metallic gray deposits found\non sheets in both cells are lithium plated during fast charging. The",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 495
    },
    {
      "text": "A734 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) **Figure 8.** a) NE of the cell cycled repeatedly with 3 _._ 6 mA _._ cm [−][2] charging showing a small amount of visible lithium plating near its perimeter, particularly at the\ntab. b) SEM micrograph of a location approximately in the center of the electrode in ‘a)’ illustrating a similar morphology to that of the pristine electrode. c) NE\nof the cell cycled repeatedly with 7 _._ 3 mA _._ cm [−][2] charging showing extensive lithium plating near its perimeter and at the end opposite the tab. d) SEM micrograph\nat a location near the perimeter of the electrode in ‘c)’ illustrating a substantially evolved morphology. e) NE of a pristine cell for reference. f) SEM micrograph of\nthe pristine NE given in ‘e)’ illustrating morphology at the beginning of life. results demonstrate that while the occurrence of lithium plating can\nbe identified with the voltage plateau technique using DV analysis, the\nabsence of plating cannot be reliably identified by the same method.\nThis is the case even if that cell SOC level at EOC is known to result\nin plating with a non-zero reversible component. [9] Moreover, it is the\ncase even when the quantity of deposited lithium is visually extensive, suggesting at the very least, that any minimum areal coverage\nthreshold can be higher than previously believed. [11][,][14] Hence, interpretation of the absence of a new _Q_ d _V_ d _Q_ [−][1] inflection (equivalent to\nthe absence of a plateau) as an absence of lithium plating creates the\npossibility of a false negative result. One cannot correctly claim that\nno plateau correlates with no plating. This is especially dangerous\nbecause, as shown, the plating can be extensive. Programmatic appli **Figure 9.** SEM micrograph and elemental mapping of a NE area following 63\ncycles of charging at 7 _._ 3 mA _._ cm [−][2] . Surface morphology of the high-carbon region (blue) noticably evolves moving rightwards to an area of localized lithium\nplating and high at% of oxygen (yellow).",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 492
    },
    {
      "text": "**Figure 9.** SEM micrograph and elemental mapping of a NE area following 63\ncycles of charging at 7 _._ 3 mA _._ cm [−][2] . Surface morphology of the high-carbon region (blue) noticably evolves moving rightwards to an area of localized lithium\nplating and high at% of oxygen (yellow). cation must therefore occur with the new knowledge that an absence\nof a plateau does not ensure continued operation will avoid cell failure\nfrom dendrite growth. BMS implementation of the technique without\nthis consideration presents a large safety concern.\nInvestigation of the cause of this behavior will be the subject of\nfuture work. However, five possible explanations are introduced here.\nTheories i and ii are predicated on the basis that Li [0] deposition occurred with a reversible component, but that the subsequent stripping\nwas undetectable. i.e. stripping did occur. Theories iii to v are predicated on the alternative basis that, at the beginning of discharge, there\nwas no reversibly-plated Li [0] available and hence a dearth of reactant\nfor the stripping process. i.e. stripping did not occur. i) Minimum coverage threshold: The areal coverage of Li [0] on NE particles is below a\nminimum threshold required for detection. This is unlikely, because\nfollowing only a single fast charge of the conductively cooled cell E\n(1 _._ 8 mA _._ cm [−][2], where the quantity of deposited Li [0] was likely much\nless than in cells MT1 or MT2), _Q_ d _V_ d _Q_ [−][1] inflections emerged. ii)\nIncreased Li [0] oxidation potential: Variations in cell temperature have\nrecently been shown to influence plateau length during relaxation. [11]\nSimilarly,increasedtemperaturecanincreaseordecreasetheoxidation\npotential of Li [0] during cell discharge according to the Nernst equation,\nwhere the direction is defined by the sign of the reaction quotient. In\ndoing so, the mixed potential could be adjusted upward to more a positive potential with respect to Li/Li [+], closer to the singular potential\nof oxidation by Equation 1. Hence, the stripping plateau’s departure\nfrom the normal terminal voltage profile is less. It is conceivable that\nit is so much less that no plateau is detected. iii) Reaction reversibility:\nIf the deposition reaction (Equation 2) was in this case wholly irreversible, then no plateau would appear because no reactant would be\navailable. This is an unlikely cause because the relatively large quantities of stripped lithium suggest a high degree of process reversibility\nacross a wide range of fast charging rates. iv) Fast chemical intercalation: High cell temperature resulting from self-heating may accelerate\nCI beyond a threshold. In doing so, deposited Li that could otherwise be recovered via stripping instead chemically intercalates during\nthe potentiostatic charge phase, leaving only irreversibly-deposited\nLi and no stripping plateau. v) Accelerated side reactions: High cell\ntemperature could accelerate side reactions between the Li [0] and electrolyte, forming SEI constituents and reducing or eliminating the",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 667
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A735 calculated according to Equation 9 where all discharge capacity to the\nend of a high-voltage plateau, specifically given by the minimum in\nthe _Q_ d _V_ d _Q_ [−][1] inflection, is assumed to be solely sourced from Li [0]\nstripping. [1][,][9][,][31] This is representative of the current state of knowledge,\nbut is not without challenge, [11] and its validity will be investigated in\na future work. Li _j_ = _[Q][ j][M]_ [Li] [9] _F_ where Li _j_, _j_ ∈{stripped, lost} is the mass of Li [0] stripped or lost.\n_Q j_ is, for stripped lithium, the discharge capacity until the end of the\nstripping plateau ( _j_ = stripped) and, for irreversibly lost lithium, is\nthe difference between pre and post fast charge capacity upon reaching\n_V_ min ( _j_ = lost). _M_ Li (6 _._ 94 g _._ mol [−][1] ) is the molar mass of lithium and\n_F_ the Faraday constant. Percentage capacity change was calculated\nusing each cell’s measured capacity.\nThe goal is to obtain an accurate a posteriori estimate of the amount\nof lithium plated across a charge-discharge cycles invovling fast charging, Liplated ∈ R [+] . Doing so enables programmatic, online SOH evaluation and additionally supports fast charging algorithm development.\nThe challenge lies in using measurements of stripping and irreversible\nloss to achieve that goal. If one quantifies only the reversibly stripped\nLi mass and neglects the irreversible component, as in Ref. 11, one\nnaturally underestimates the plated quantity. If one sums both, as in\nRef. 9, one employs Equation 10. ��Liplated�� = ����� _a_ γ=1 - - [�]\nListrippedγ ( _i_ dschg) − Lilostγ ��� [10] **Figure 10.** Bars illustrate cell capacity changes following a single fast charge\ncycle as a percentage of measured cell capacities. Quantities above/below bars\ndepict the corresponding masses of lithium in mg, i.e. Listripped and Lilost.\nCurves illustrate durations of the CC or CV charge phases, or the combined\nduration of both phases, during the fast charge at each rate. strippable Li [0] . This would leave no reactant available for the stripping\nreaction.",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 559
    },
    {
      "text": "strippable Li [0] . This would leave no reactant available for the stripping\nreaction. _**Plating quantification accuracy: theoretical analysis.—**_ Figure 10 illustrates the mass of discharge-phase oxidated Li [0] (Listripped ∈\nR [+] ) and the lithium mass irreversibly lost (Lilost ∈ R) for each conductively cooled cell subjected to a single fast charge. In theory, Lilost ≤ 0\nshould hold true, where negative values represent irreversible loss. In\npractice, Lilost _>_ 0 is reported in two cases; following 6 _._ 4 mA _._ cm [−][2]\nand 8 _._ 2 mA _._ cm [−][2] charging. That is to say, the total number of conductively cooled cells demonstrating capacity gain was two, out of a total\nof nine cells tested. The reason for these outlying results, representing\nan apparent capacity increase following fast charging, is unknown, but\nCoulombic Efficiency (CE) values above unity have been encountered\nbefore. [30] Cell temperature at EOD has returned to approximately the\nambient and is therefore unlikely to be influential. The effect may\nstem from the recovery of lithium stored in the NE overhanging regions or from an accumulation of cycler error in the coulomb counted\ncharge and discharge capacities. In all scenarios, lithium mass was",
      "page_num": 12,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 294
    },
    {
      "text": "where an update is made here so that Listripped is a function of the discharge current density, _i_ dschg. This dependency was suggested in the\nwork of Yang et al. (2018), [11] but on the observation of shifting d _V_ d _Q_ [−][1]\ninflections that were likely the result of graphite staging rather than\nplateau end points. In Figure 6b of their work, both inflections, at\n0 _._ 4 Ah (C/3 discharge) and at 0 _._ 95 Ah (1C discharge), exhibit trough\nintensities more similar to those produced by graphite staging from\nstages I to II than to those shallow, narrow troughs at plateau end\npoints. Moreover, if graphite NE stoichiometry limits are assumed as\nθ0neg = 0 _._ 04 _,_ θ100neg = 0 _._ 75, then these d _V_ d _Q_ [−][1] inflections occur at\n_x_ = 0 _._ 58 (C/3 discharge) and at _x_ = 0 _._ 54 (1C discharge). This assumption is reasonable since graphite is normally not fully lithiated in\ncommercial cells, and is capable of complete or near-complete delithiation without instability. I to II staging has been demonstrated to occur\nin that vicinity; _x_ = 0 _._ 50 (literature [23][–][25] ) and _x_ ≈ 0 _._ 56 (earlier in this\nwork). Also, in our work, all stripping plateau end points occurred\nprior to NE I to II staging in the range _x_ ≥ 0 _._ 59. This observation\nhighlights the benefits of a rigorous full cell DV feature assignment.\nNonetheless, this work’s Figure 11 demonstrates that there is a dependencyofListripped on _i_ dschg.Theresultsindicatethathigherdischarge\nrates obfuscate the plateau end point inflection and prevent its detection. That is, Listripped was not quantifiable at the two higher discharge\nrates used. This presents a challenge for practical online implementation of the technique where the conventional C/20 rate requires a\nsignificant period of time to reach the plateau end −25 _._ 7 minutes or\n2 _._ 7% of the total discharge duration. The remaining 97 _._ 3% (15 hours\n& 36 minutes) of discharge must then elapse to obtain the value of\nLilost. Without an improved understanding of how Listripped depends\nupon _i_ dschg, accelerating quantification by increasing discharge rates\nremains unreliable. It additionally highlights a new difficulty with reliable plating identification, since a false negative test result is possible\nif higher discharge rates are employed.\nTo further advance the estimation accuracy of Equation 10, consider the CI of deposited Li [0], otherwise known as Li [0] dissolution. CI\nis a diffusion process by which plated Li [0] intercalates into unsaturated\nC6 according to the irreversible reaction of Equation 11. If plating\nwas driven by Solid Diffusion Limitation (SDL), the host C6 may be\nan adjacent NE particle to the one which has become saturated. Li [0]\nundergoing CI is wholly neglected by both terms in Equation 10 if the\nCI process completes prior to discharge beginning. Partial completion",
      "page_num": 12,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 725
    },
    {
      "text": "A736 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) **Figure 11.** Differential voltage signatures of the three cells (cell IDs I, DR1 &\nDR2) charged at 5 _._ 5 mA _._ cm [−][2] and discharged at the different rates given in the\nfigure legend. Black curves represent discharges of the same cells following\n0 _._ 2 mA _._ cm [−][2] charge, prior to any fast charge/plating, for reference. is possible, and hence the rate of CI is important. _y_ Li [0] + Li _x_ C6 → Li _x_ + _y_ C6 _,_ for 0 ≤ _x_ + _y_ ≤ 1 [11] From the reduction in rate of LLI with cycling (exemplified by\n−42 _._ 6 mAh _._ cycle [−][1] to −8 _._ 7 mAh _._ cycle [−][1] ) upon shortening of the CC\nphase in convectively cooled cells in Figure 6, it can be inferred that\na majority of lithium plating occurs during the CC rather than CV\nphase. With conduction cooling for all cells in Figure 10, this CC\nphase deposition is likely to be amplified. As a result, CV phases\nbegin with a NE areal coverage of Li [0] . Short CV phase durations are\nconsidered incapable of facilitating substantial CI. [9] However, under\nfast charging conditions with relatively long CV phases and decaying\nplating current density, _i_ pl, according to Equation 12, the CV phase\nprovides an opportunity for substantial CI of deposited Li [0] . In-situ\nneutron diffraction experiments on graphite-NMC cells support the\ncoincidence of the CV phase start and CI of plated Li [0] . [32] lim [12]\n_t_ CV→ _t_ α _[i]_ [pl][ =][ 0] 0\n_i_ pl = _i_ chg − _i_ int ( _i_ chg) − _i_ **�** sr [12a]",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 469
    },
    {
      "text": "0\n_i_ pl = _i_ chg − _i_ int ( _i_ chg) − _i_ **�** sr [12a] where _t_ CV here is elapsed time in the CV phase and _t_ α the time at which\nlithium plating ceases because the charge process is no longer governed by a Charge Transfer Limitation (CTL) or SDL. _i_ chg is charge\ncurrent density applied by the battery cycler, _i_ int the charge current\ndensity constituting Li intercalation and _i_ sr, assumed zero here, is the\ncharge current density involved in side reactions other than lithium\nplating. The ratio _[i]_ _i_ [int] pl [is a function of] _[ i]_ [chg][. Since CI detracts from the] measurable quantities on the subsequent discharge, Equation 13 provides an improved estimate. ��Liplated�� = ���� - _a_ γ=1 - - [�]\nListrippedγ ( _i_ dschg) − Lilostγ + Lichemicalγ ( _t_ CV _, T_ ) ��� [13] - _t_ CV Lichemical = _A_ cell _M_ Li _N_ Li( _t, T_ ) _dt_ [13a]\n0",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 286
    },
    {
      "text": "_N_ Li( _t, T_ ) _dt_ [13a]\n0 where Lichemicalγ ∈ R [+] is the mass of plated lithium that chemically\nintercalated across _a_ number of cycles, _A_ cell is the cell’s electrochemically active surface area and _N_ Li the molar flux associated with chemical intercalation of the plated lithium. Lichemical magnitude cannot be\nmeasured during discharge since Li that was plated, chemically intercalated and subsequently deintercalated appears no differently from\nall other charge sourced by deintercalation. However, the theory presented by Petzl & Danzer that plating irreversibility is a maximum at\nhigh SOC in part because of increased CI suggests Lichemical is substantial in magnitude. [9] Lichemical can be quantified by i) modeling the rate of\nCI as a function of the parameters upon which it depends or ii) by using other non-destructive techniques to quantify the plating extent until\nthe CC charging phase end point, and subtracting the discharge-phase\nquantity obtained by application of Equation 10. Very recently, there\nhave been indications that in-situ charge-phase plating detection [33] and\nquantification [31] are possible.\nThe complexity of the process is high because charge rate influences parameters upon which Lichemical depends, ( _t_ CV _, T_ ). Results\nexist [32] indicating that the rate of CI is independent of the areal coverage of Li [0] but the literature on this is not in complete agreement. [16]\nFurther, it has been suggested that the CI rate depends on additional parameters [15] —plating morphology, NE material, distribution\nof NE particle size, NE porosity, electrolyte composition, internal\ncell pressure and the solid phase concentration gradient _[dc]_ _dr_ [s] [where] _r_ is the spatial dimension along NE particle radii. With the exception\nof ( _t_ CV _, T,_ _[dc]_ _dr_ [s] [), many or all of these parameters are or can be rea-]",
      "page_num": 13,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 451
    },
    {
      "text": "_r_ is the spatial dimension along NE particle radii. With the exception\nof ( _t_ CV _, T,_ _[dc]_ _dr_ [s] [), many or all of these parameters are or can be rea-] sonably assumed to be, identical across all cells tested in this work.\nTime for CI to occur is illustrated by the curves in Figure 10. _t_ CC\nfalls exponentially as _V_ max is reached earlier with higher _i_ . _t_ CV initially increases exponentially with increasing charge current density\nand thereafter plateaus when the phase constitutes the vast majority of\ntotal charge time ( _t_ CCCV _[t]_ [CV] [≥] [0] _[.]_ [94] _[,]_ [ 4] _[.]_ [6 mA] _[.]_ [cm][−][2][ ≤] _[i]_ [ ≤] [9] _[.]_ [1 mA] _[.]_ [cm][−][2][).] Total charge time therefore becomes insensitive to additional charge\nrate increases. Lichemical increases as charge current density does because _t_ CV increases. Similarly, higher values of current density lead to\nincreased heat generation and higher temperatures that accelerate CI.\nSince _t_ CV and _T_ are positively correlated with both the charge rate and\nthe quantity Lichemical, the faster the charging, the greater the amount\nby which Equation 10 underestimates Liplated. This is especially problematic because, under some circumstances, accurate plating quantification is more useful following higher rate charging when plating is\nmost likely, than under lower rate charging.\nIt is dangerous to ignore the chemically intercalated amount because underestimation of plating could lead to continued cell operation in spite of dendrite formation and the possibility of a short circuit.\nHence, this work advocates for an update of existing plating quantification methods by accounting for Lichemical whenever a potentiostatic\ncharge phase is employed. A future work will attempt to quantify\nLichemical. We hypothesize that as Liplated exceeds its true maximum, the\ncalculated (reported) value will decrease because Lichemical increases\n(long CV phase durations). Moreover, as charge rates are increased\nbeyond that at which Liplated is a maximum, the true amount of Liplated\ndeclines because the shortening CC phase duration allows less timefor plating. The trend of initial growth and later decline in �� _Q_ lost�� in\nFigure 10 supports this theory.",
      "page_num": 13,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 546
    },
    {
      "text": "_**Gradient-based sensitivity compensation.—**_ Diagnostics algorithms are required to be robust for plating quantification both by researchers and by programmatic methods on a BMS. Furthermore, fast\ncharging algorithm development would benefit from increased sensitivity to enable quantification of smaller amounts of lithium plated.\nThe DV inflection characterizing a stripping plateau end point typically involves one peak and one trough in close succession. The peak\noccurs immediately prior to the end of Li [0] stripping when the cell\npotential is falling at its lowest rate since the beginning of discharge.\nWhen the source of Li [0] becomes depleted, the NE potential transitions from mixed to the singular potential of de-plated LixC6 and the\nrate of cell potential decline increases, returning the cell potential to",
      "page_num": 13,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 157
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A737 that of a cell with no plated lithium. This is observed as the voltage\nplateau ending, and the _Q_ d _V_ d _Q_ [−][1] trough occurs when this decline\nis steepest. Both the peak and trough are hence real positive roots\nof _Q_ d [2] _V_ d _Q_ [−][2] . Determination of _Q_ stripped is a root finding problem in\nwhich the discharge capacity at the second root is being sought.\n_Q_ d _V_ d _Q_ [−][1] inflections can be considered to start and end as they\ndiverge and converge from/to the DV gradients of healthy cells undergoing discharge (e.g. reference discharges). As such, inflections here\nare considered to have started upon Equation 14 being satisfied and are\nconsidered to have ended when Equation 15 is satisfied. A criterion on\nthe first derivative is required for inflection end point determination\nbecause the second derivative criterion can be satisfied twice; firstly,\njust prior to the inflection’s trough and secondly, at the true inflection\nend point. The criteria were determined by visual inspection of the\nDV curves vs. their reference curves and then applied universally to\nevaluate start and end points in all tests. The criteria are specific to the\ncell chemistry and cell design, and are therefore empirical parameters\nneeding re-evaluation for other cells whose DV behavior may differ. start: _Q_ d [d] _Q_ [2] _[V]_ [2] _[<]_ [ 0] _[.]_ [281 VmAh][−][1] [14] end: _Q_ [d][2] _[V]_ d _Q_ _[>]_ [ −][2 V] [15] _[V]_ [d] ∧ _Q_ [d] _[V]_ d _Q_ [2] _[<]_ [ 0] _[.]_ [003 VmAh][−][1] d",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 455
    },
    {
      "text": "d _Q_ [2] _[<]_ [ 0] _[.]_ [003 VmAh][−][1] d The problem of root finding is therefore simplified by knowledge\nof the start and end points of the interval in which the inflection lies,\nthe “inflection range”. These are given in terms of _Q_ discharged, where\nthe start point is denoted _�_ s and the end point _�_ e. These start and end\npoints are unique to each dataset. 10 [th] degree polynomials were fitted\nto the _Q_ d _V_ d _Q_ [−][1] curves in the inflection range because numerical differentiation of the data produces excessive noise, in spite of the raw\n_V_ data having been smoothed. Resulting GoF was high at ≤35 mV\nRMSE (mean = 24 mV) in all cases. Differentiation of those polynomials yielded nine 9 [th] degree polynomials describing _Q_ d [2] _V_ d _Q_ [−][2] .\nFor each dataset, the number of real roots lying in the inflection range\nwas determined by obtaining the eigenvalues of the companion matrices. Two positive real roots were found in the range _�_ s to _�_ e for\neach fast charging scenario, except 1 _._ 8 mA _._ cm [−][2] fast charging where\nno real roots were discovered. The values of the real positive roots\nneed not be known at this stage. Knowledge of the number of such\nroots occurring in the range _�_ s to _�_ e is sufficient to determine if the\nconventional stripping quantification method can be applied. As such,\na method such as Sturm’s theorem may be used here if numerical root\nfinding is unfeasible.\nPlotting the first derivatives provides additional insight. Figure 12a\nillustrates a DV profile (purple) representing a stripping process occurring following 1 _._ 8 mA _._ cm [−][2] charging. However, no typical peaktrough formation and corresponding roots are present since, for this\nlow level of Li [0] stripping, the high voltage plateau was never so high as\nto be able to fall substantially at its end point. Physically, this suggests\na lesser contribution from the Li [0] to the mixed NE potential, and a relatively greater contribution from LixC6. In such a case, stripping quantification is necessary for plating quantification, but the conventional\nmethod is not robust, produces an indeterminate result and demonstrates the limited sensitivity of the technique. Although DV profiles\nare available for all rates given in the lower subplot (i.e. legend of\nFigure 12b), only a representative sample are shown in Figure 12a.\nThis is so because from 3 _._ 6 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2] all DV curves\nare extremely similar and their minima cluster in approximately the\nsame location on the graph, making it difficult to read.\nTo compensate for this limitation and obtain an estimate of _Q_ stripped,\nit is noted that a positive linear relationship exists between _Q_ stripped as\nmeasured to inflection minima and the discharge capacity to the end of\nthe inflections, _�_ e. Figure 12b visually exemplifies this relationship,\nwhich is substantiated by a Pearson Correlation Coefficient (PCC),\nρ [PCC] Qstripped _,�_ e [, of 0] _[.]_ [98,][ −][1][ ≤] [ρ][PCC][ ≤] [1.][ ρ][PCC][ values approaching][ −][1]\nindicate a strong, negative linear correlation, while ρ [PCC] values approaching 1 indicate a strong, positive linear correlation, and a ρ [PCC]",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 825
    },
    {
      "text": "**Figure 12.** a) Normalised 1 [st] derivatives of beginning-of-discharge cell potential for conductively-cooled cells E, F, H and M, as well as convectively-cooled\ncell A (red curve), following fast charging at the rates given in the legend. Circular markers represent the minima used to calculate _Q_ recovered via stripping\n(gray bar magnitudes in Figure 10). Square markers represent inflection start\npoints and triangular markers inflection end points. Data between start and end\npoints is illustrated with a solid line while data outside of the endpoints is illustrated with a dashed line. b) Capacity to inflection end, _�_ e, can be used to\npredict (mean) _Q_ stripped to inflection minima assuming a normal distribution of\n_Q_ stripped about a mean of _[�]_ [e][−] 1 _._ [157] 03 _[.]_ [01] . The variables exhibit a good linear corre\nlation. The trend line, fitted to all non-purple markers, has been used to predict\nthe value of _Q_ stripped for 1 _._ 8 mA _._ cm [−][2] charging, which is represented with the\npurple marker. value of 0 indicates no linear correlation. ρ [PCC] Qstripped _,�_ e [=] [cov(] _[Q]_ [stripped] _[, �]_ [e] [)] [16] σ _Q_ stripped σ _�_ e where cov is the covariance of _Q_ stripped and _�_ e. Simple linear regression is therefore justified and has been performed on the data. Since\nstripping inflection troughs are less severe, evidenced by the lack of a\nminimum, for lower quantities of _Q_ stripped, the DV recovery period (until the curve asymptotes) is less. Hence, _Q_ stripped may be considered the\nindependent (i.e. explanatory) variable and _�_ e the dependent (i.e. response) variable. The regression model is therefore _�_ e = _mQ_ stripped + _c_\nwhere _m_ and _c_ represent regression line slope and offset, respectively.",
      "page_num": 14,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 466
    },
    {
      "text": "A738 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019)",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 24
    },
    {
      "text": "A738 _Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) The model implication is that the transition from mixed to singular NE\npotential is longer because of increased quantities of stripped Li [0] . That\nis, the stripping inflection end points contain information on the extent\nof stripping, and may be used to estimate _Q_ stripped when the conventional technique fails. Because prediction of the (mean) independent\nvariable _Q_ stripped using _�_ e is desired, _Q_ stripped is regressed on _�_ e. That\nis, the regression minimizes the sum of the squares of residuals in a\nway that minimizes the error in predicted mean _Q_ stripped (horizontal\ndistances between markers and the trend line in Figure 12b).\nUsing only the data obtained in conductively cooled tests this regression is possible only in the range 2 _._ 7 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2],\nsince no _Q_ stripped data point exists for the 1 _._ 8 mA _._ cm [−][2] case. Although conductively cooled reference discharge data (black curves,\ninset in Figure 4) provides voltage gradient information for the case\nof _Q_ stripped = 0, they were obtained with iSOC ≈ SOC, and hence\nexhibit a _Q_ offset that introduces an offset (error) into the calculated\nvalue of _�_ e. i.e. their use would underestimate the discharge capacity to the end point. Crucially, the desired information is available\nfrom _Q_ d _V_ d _Q_ [−][1] curves obtained in convectively cooled fast charging\ntests. These curves exhibited no stripping inflections and were obtained with near identical iSOC to that in the conductively cooled fast\ncharging scenarios. This is clear in Figure 12a where there is only a\nvery small horizontal offset between the start of convective (red) and\nconductive (other colors) curves. The case of 2 _._ 7 mA _._ cm [−][2] charging\nwas chosen because the temperature rise was the smallest of all convective fast charges, and thus most closely matches the conductively\ncooled cell temperature. Using this data, _�_ e could be calculated for\nthe case of _Q_ stripped = 0, represented with the red star in Figure 12b.\nAs a result, regression could be performed on conductively cooled\ndata in the range 2 _._ 7 mA _._ cm [−][2] to 9 _._ 1 mA _._ cm [−][2] and on the convectively cooled data point (red star). Finally, calculation of _Q_ stripped at\n_i_ = 1 _._ 8 mA _._ cm [−][2] is possible by rearranging the regression model\nsuch that _Q_ stripped = _[�]_ [e] _m_ [−] _[c]_ [. The value calculated is given by the pur-]",
      "page_num": 15,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 656
    },
    {
      "text": "ple star. This interpolation produces an estimate of _Q_ stripped = 66 mAh\n(17 _._ 1 mg) in the case of _i_ = 1 _._ 8 mA _._ cm [−][2] . This value is retrospectively\ngiven as the white-colored bar in Figure 10. It serves as demonstration of a novel method of increasing the sensitivity of the stripping\nquantification method, extending its application scope to lower levels\nof Li [0] stripping.\nThe question naturally arises of when the conventional method\nof relying on inflection minima for _Q_ stripped quantification fails. It\nis possible to estimate the threshold by considering the relationship between _Q_ stripped and the number of real positive roots in the\n_Q_ d [2] _V_ d _Q_ [−][2] inflection range. This relationship is linear (ρ [PCC] Qstripped _,_ ξ [=]\n−0 _._ 95, _R_ [2] = 0 _._ 88). The threshold is defined by the _Q_ stripped value at\nwhich one repeated real positive root exists and _Q_ d [2] _V_ d _Q_ [−][2] touches\nbut does not cross the horizontal axis. This threshold is represented\nin Figure 12b as the gray box border. _Q_ stripped values lying within the\nbox are obtainable only with _�_ e data. Those lying outside of the box\nare obtainable by conventional determination of inflection minima. **Conclusions** Through experimental testing of commercial graphite-NMC cells,\ndeficiencies in state-of-the-art lithium plating identification and quantification methods were investigated and solutions proposed. Because\niSOC and _T_ variations following fast charging strongly influence the\ncell terminal voltage, voltage vs. capacity ( _V_ - _Q_ ) plots were shown not\nto be reliable for plating identification in the context of fast charging.\nDV analysis was instead shown to reliably identify stripping plateaus\nirrespective of iSOC and _T_ . Increasing cooling system power did little\nto alleviate the problem because limiting the temperature rise exacerbates the formation of concentration gradients and causes iSOC to\ninfluence the voltage profile to a greater extent.\nThe application scope of the technique was shown to be far wider\nthan previously believed. Unambiguous identification of stripping\nplateau end points with NC electrodes demonstrated that the PE contribution to cell potential need not be negligible for the identifica",
      "page_num": 15,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 519
    },
    {
      "text": "tion of lithium plating. The technique can successfully be applied at\ntemperatures as high as 0 [◦] C and with core cell temperatures even\nhigher. The technique can therefore be employed under the conditions of EV fast charging when additional consideration is given. DV\nanalysis and electrode microscopy validated the hypothesis that an absence of lithium stripping plateaus is not indicative of an absence of\nlithium plating. Therefore, the belief that no stripping plateau represents healthy, plating-free cell operation was shown to be a converse\nerror. Traditionally, longer stripping plateaus have been considered to\nrepresent more dangerous scenarios with more lithium plating having\noccurred. However, the results highlight that the reverse may sometimes be true, since longer stripping plateaus represent good plating\nprocess reversibility. Dangerous processes such as lithium dendrite\nformation and earlier thermal runaway rely on the occurrence of irreversible plating. These dangerous processes are therefore inhibited\nwhen the plating process exhibits good reversibility, as indicated by\nthe presence of a long stripping plateau.\nThe relationship between fast charging rate and chemical intercalation was investigated. The results suggest that lithium plating quantification without consideration for lithium chemically intercalated\nduring CV phase charging causes underestimation of the plated quantity. The amount by which Liplated is underestimated increases at the\nhigher charging rates that render the plating both more likely and more\nextensive (dangerous). Moreover, the error involved in treating stripping quantification as plating quantification has been highlighted. The\ndependency of _Q_ stripped on the discharge rate was investigated and further work is required to better understand the underlying mechanisms.\nWhere lithium plating quantities are relatively small, _Q_ d _V_ d _Q_ [−][1] inflections were shown to not exhibit minima, limiting the sensitivity of\nthe technique. _Q_ d _V_ d _Q_ [−][1] stripping inflection end points were demonstrated to contain valuable information and to exhibit a statistically\nsignificant correlation with _Q_ stripped. _�_ e has therefore been suggested\nfor estimation of _Q_ stripped when _Q_ stripped is so low in magnitude that\n_Q_ d _V_ d _Q_ [−][1] stripping inflections do not exhibit minima. As a result,\nthe application window of the technique has been widened to include\nlower levels of lithium plating.\nThe field of in-situ lithium plating identification and quantification by the voltage plateau method remains underdeveloped. Valuable\nfuture work includes i) quantification of Lichemical. Novel plating quantification techniques, such as that presented in Ref. 31, could enable\nexperimental quantification of Liplated during charging. Differencing\nwith respect to Liplated as calculated by the voltage plateau method\nwould enable Lichemical estimation. ii) If GoF was to be improved\nbetween the calculated and experimental full cell DV profiles, then\ndegradation mode quantification could be improved for cells MT1 and\nMT2, similar to that in Refs. 3, 34. The result could be compared with\nLLI quantities estimated in this work by the voltage plateau method,\nand the method’s accuracy further studied. Lastly, further work is required to better understand the increases in capacities of some cells\nfollowing charging and the influence on estimation of irreversible LLI\nowing to plating.",
      "page_num": 15,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 707
    },
    {
      "text": "**Acknowledgments** The authors are thankful for the financial support provided\nby the Engineering and Physical Sciences Research Council\n(EPSRC) under the Translational Energy Storage Diagnostics\n(TRENDS) project, part of the industrial strategy challenge fund\nEP/R020973/1. The authors are also thankful for the funding provided by the EPSRC and Jaguar Land Rover through an industrial\nCASE award. Finally, the authors thank Max Naylor-Marlow for his\nassistance performing SEM imaging and EDX. **ORCID** Ian D. Campbell [https://orcid.org/0000-0002-5465-6449](https://orcid.org/0000-0002-5465-6449)\nMohamed Marzook [https://orcid.org/0000-0003-4430-7322](https://orcid.org/0000-0003-4430-7322)",
      "page_num": 15,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 191
    },
    {
      "text": "_Journal of The Electrochemical Society_, **166** (4) A725-A739 (2019) A739 Monica Marinescu [https://orcid.org/0000-0003-1641-3371](https://orcid.org/0000-0003-1641-3371)\nGregory J. Offer [https://orcid.org/0000-0003-1324-8366](https://orcid.org/0000-0003-1324-8366) **References**",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 110
    },
    {
      "text": "**References** 1. V. Zinth, C. Von Lüders, M. Hofmann, J. Hattendorff, I. Buchberger, S. Erhard,\nJ. Rebelo-Kornmeier, A. Jossen, and R. Gilles, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2014.07.168)_, **271**, 152\n(2014).\n2. M. C. Smart and B. V. Ratnakumar, _[Journal of The Electrochemical Society](http://dx.doi.org/10.1149/1.3544439)_, **158** (4),\nA379 (2011).\n3. D. Anseán, M. Dubarry, A. Devie, B. Y. Liaw, V. M. García, J. C. Viera, and\nM. González, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2017.04.072)_, **356**, 36 (2017).\n4. M. C. Smart, B. V. Ratnakumar, L. Whitcanack, K. Chin, M. Rodriguez, and\nS. Surampudi, _[IEEE Aerospace and Electronic Systems Magazine](http://dx.doi.org/10.1109/MAES.2002.1145732)_, **17** (12), 16 (2002).\n5. M. C. Smart, B. V. Ratnakumar, L. D. Whitcanack, K. B. Chin, S. Surampudi,\nH. Croft, D. Tice, and R. Staniewicz, _[Journal of Power Sources](http://dx.doi.org/10.1016/S0378-7753(03)00154-X)_, **119-121**, 349 (2003).\n6. J. Fan and S. Tan, _[Journal of The Electrochemical Society](http://dx.doi.org/10.1149/1.2190029)_, **153** (6), A1081 (2006).\n7. B. V.Ratnakumar andM. C.Smart.LithiumPlatingandLithiumintercalationkinetics\nas a function of Electrolyte Composition. In _Proceedings of the 216th ECS Meeting_ .\nThe Electrochemical Society, 2009.\n8. R. V. Bugga and M. C. Smart, Lithium Plating Behavior in Lithium-ion Cells. In _ECS_\n_Transactions_, **25**, 241 (2010).\n9. M. Petzl and M. A. Danzer, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2013.12.060)_, **254**, 80 (2014).\n10. M. A. Danzer, M. Bauer, S. Schindler, and M. Petzl, Detection and Characterization\nof Lithium Plating in Commercial Cells. In _Advanced Automotive Battery Conference_,\nMainz, 2016.\n11. X.-G. Yang, S. Ge, T. Liu, Y. Leng, and C.-Y. Wang, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2018.05.073)_, **395**,\n251 (2018).\n12. S. F. Schuster, T. Bach, E. Fleder, J. Müller, M. Brand, G. Sextl, and A. Jossen,",
      "page_num": 16,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 789
    },
    {
      "text": "_[Journal of Energy Storage](http://dx.doi.org/10.1016/j.est.2015.05.003)_, **1**, 44 (2015).\n13. Q. Liu, C. Du, B. Shen, P. Zuo, X. Cheng, Y. Ma, G. Yin, and Y. Gao, _[RSC Advances](http://dx.doi.org/10.1039/C6RA19482F)_,\n**6**, 88683 (2016).\n14. T. Waldmann, B. I. Hogg, and M. Wohlfahrt-Mehrens, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2018.02.063)_,\n**384**, 107 (2018).\n15. T. Waldmann and M. Wohlfahrt-Mehrens, _[Electrochimica Acta](http://dx.doi.org/10.1016/j.electacta.2017.02.036)_, **230**, 454 (2017).\n16. C. Uhlmann, J. Illig, M. Ender, R. Schuster, and E. Ivers-Tiffée, _Journal of Power_\n_Sources_, **279**, 428 (2015). 17 S Tippmann, D Walper, L Balboa, B Spier, and W G Bessler, _Journal of Power_\n_Sources_, **252**, 305 (2014).\n18 M Ecker, T K D Tran, P Dechent, S Käbitz, A Warnecke, and D U Sauer, _Journal_\n_of the Electrochemical Society_, **162** (9), A1836 (2015).\n19 J Cannarella and C B Arnold, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2013.06.165)_, **245**, 745 (2014).\n20 J Pokrzywa SAE International standards work, including communication protocols and connectors, fast charge, batteries In _SAE International_  SAE International,\n2011.\n21 Y A Cengel and A J Ghajar, _Heat and Mass Transfer: Fundamentals & Applica-_\n_tions_, McGraw-Hill, New York, fourth edition, 2010.\n22 H M Dahn, A J Smith, J C Burns, D A Stevens, and J R Dahn, _Journal of the_\n_Electrochemical Society_, **159** (9), A1405 (2012).\n23 M Winter, J O Besenhard, M E Spahr, and P",
      "page_num": 16,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 580
    },
    {
      "text": "E Spahr, and P Novak, _[Advanced Materials](http://dx.doi.org/10.1002/(SICI)1521-4095(199807)10:10&lt;725::AID-ADMA725&gt;3.0.CO;2-Z)_, **10** (10),\n725 (1998).\n24 D Aurbach, B Markovsky, I Weissman, E Levi, and Y Ein-Eli, _Electrochimica_\n_Acta_, **45**, 67 (1999).\n25 T Ohzuku, Y Iwakoshi, and K Sawai, _[Journal of The Electrochemical Society](http://dx.doi.org/10.1149/1.2220849)_,\n**140** (9), 2490 (1993).\n26 C Pastor-Fernández, K Uddin, G H Chouchelamane, W D Widanage, and\nJ Marco, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2017.03.042)_, **360**, 301 (2017).\n27 M S Whittingham, _[Chemical Reviews](http://dx.doi.org/10.1021/cr020731c)_, **104** (10), 4271 (2004).\n28 M Tang, P Albertus, and J Newman, _[Journal of The Electrochemical Society](http://dx.doi.org/10.1149/1.3095513)_, **156** (5),\nA390 (2009).\n29 T Waldmann, J B Quinn, K Richter, M Kasper, A Tost, A Klein, and\nM Wohlfahrt-Mehrens, _[Journal of The Electrochemical Society](http://dx.doi.org/10.1149/2.0961713jes)_, **164** (13), A3154\n(2017).\n30 B Gyenes, D A Stevens, V L Chevrier, and J R Dahn, _Journal of the Electrochem-_\n_ical Society_, **162** (3), A278 (2015).\n31 J Wandt, P Jakes, J Granwehr, R A Eichel, and H A Gasteiger, _[Materials Today](http://dx.doi.org/10.1016/j.mattod.2017.11.001)_,\n**21** (3), 231 (2018).\n32 C von Lüders, V Zinth, S V Erhard, P J Osswald, M Hofmann, R Gilles, and\nA",
      "page_num": 16,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 577
    },
    {
      "text": "Hofmann, R Gilles, and\nA Jossen, _[Journal of Power Sources](http://dx.doi.org/10.1016/j.jpowsour.2016.12.032)_, **342**, 17 (2017).\n33 J Kowal, J Marscheider, D Kober, and A Gurlo, Detection of lithium plating by\ndifferent methods In _Advanced Battery Conference 2018_, Muenster, 2018.\n34 C R Birkl, M R Roberts, E McTurk, P G Bruce, and D A Howey, _Journal of_\n_Power Sources_, **341**, 373 (2017).\n35 D Ren, K Smith, D Guo, X Han, X Feng, L Lu, M Ouyang, and J Li, _Journal of_\n_The Electrochemical Society_, **165** (10), A2167 (2018).",
      "page_num": 16,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 199
    }
  ],
  "total_chunks": 56,
  "created_at": "2026-02-04 15:53:43"
}