{
  "filename": "IECON2014hysteresis_v05final_fontembedded.pdf",
  "chunks": [
    {
      "text": "F. Baronti [∗], N. Femia [§], R. Saletti [∗], and W. Zamboni [§] ∗\nDipartimento di Ingegneria dell’Informazione, Universit`a di Pisa, I-56122 Pisa, Italy\ne-mail: f.baronti@iet.unipi.it\n§\nDipartimento di Ingegneria dell’Informazione, Ingegneria Elettrica e Matematica Applicata (DIEM)\nUniversit`a degli Studi di Salerno, I-84084 Fisciano (SA), Italy\ne-mail wzamboni@unisa.it _**Abstract**_ **—The hysteresis in the state-of-charge (SoC) vs.**\n**open-circuit voltage characteristic of a lithium-iron-phosphate**\n**(LiFePO** 4 **, LFP) battery is modelled with two approaches. The**\n**first one is based on a first-order charge relaxation equation, the**\n**second one is the Preisach model implemented with the Everett**\n**function. The advantages and drawbacks of the methods are**\n**discussed. Simulation results are compared for a 20 A h LFP**\n**cell, stimulated with various SoC evolutions, allowing us to draw**\n**minor loops in the SoC-OCV plane. The results are also compared**\n**to experimental data.** I. INTRODUCTION",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Comparing Open-Circuit Voltage Hysteresis Models for Lithium-Iron-Phosphate Batteries",
      "token_count": 313
    },
    {
      "text": "I. INTRODUCTION The design of the energy storage systems necessary in\nmany applications of the industrial fields, such as electric\ntransportation and utility grids, is becoming more and more\nattracted by the Lithium-ion (Li-ion) batteries [1]. Among the\ndifferent variants of Li-ion batteries, lithium iron phosphate\n(LiFePO4 or briefly LFP) is one of the most promising for\nElectric Vehicle (EV) or hybrid EV applications, offering\nhigh safety with a reasonable cost, lower than other lithiumbased batteries. LFP batteries are characterised by a flat OpenCircuit Voltage (OCV) when the State-of-Charge (SoC) ranges\nfrom 20 % to 80 %. Moreover, OCV exhibits a pronounced\nhysteresis between the charge and discharge curves [2]–[3].\nAn accurate estimation of the battery SoC contributes to\nincrease the safety and life expectancy of the battery, as well as\nto maximize the driving range of EVs and to reduce costs. SoC\nestimation is indeed a fundamental function in an advanced\nBattery Management System (BMS) [4]-[5]. SoC indicates the\nresidual energy of the battery and it is usually expressed as a\npercentage of the battery capacity. Its knowledge allows one to\nkeep the battery within the optimal operating conditions and\nto evaluate the remaining runtime of the overall system ( _e.g._,\nthe driving range of an EV). An accurate characterization of\nthe hysteresis and affordable models of the phenomenon are\nrequired in order to obtain a precise estimation of the SoC and\nparameters for an LFP battery with a model-based observer,\nsuch as a filter [6]-[9].\nStarting from the experimental data showing hysteresis in\nthe SoC-OCV characteristic of a 20 A h LFP cell, two deeply\ndifferent modelling approaches are compared in this paper.\nThe first one is the so-called _One-State Hysteresis_ (OSH)\nmodel, based on a fist-order relaxation equation. The battery Fig. 1. Cell circuit output loop. The hysteretic voltage vH depends on the\nSoC history. static hysteretic response to a variation of SoC is contained\nin the hysteresis major loop and follows the forcing term\nin a “delayed” way (in fact, “delay” is the original meaning\nof the Greek-derived word “hysteresis”) [3], [8]. The second\nmodel is the classical Preisach model, originally proposed in\n1935 for magnetic materials [10] and then formalized as a\nfully-general mathematical tool in [11]. The Preisach model\nhas been effectively proposed and used for NiMH batteries",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "Comparing Open-Circuit Voltage Hysteresis Models for Lithium-Iron-Phosphate Batteries",
      "token_count": 565
    },
    {
      "text": "[12] and for Li-ion batteries [13]. The Preisach operator\nis implemented by means of the so-called Everett function,\nidentified with a well-defined characterization procedure of\nthe battery (first-order reversal (FOR) branches). The aim of\nthis work is to draw a comparison of the two models. II. MODELLING SOC − OCV HYSTERESIS _A. Equivalent Electric Circuit of a Li-ion Battery_ Let us consider a cell having a nominal capacitance Qn and\nlet us call v the cell voltage and i the cell current, with the\npassive sign convention. We also assume the cell temperature\nconstant and equal to the room temperature T . The cell SoC is\ndefined by a linear transformation of the charge Q stored in the\nbattery, such that SoC(Q = Qn) = 1 and SoC(Q = 0) = 0,\nwhere Qn is the normalisation battery capacity.\nThe equivalent electrical model of a Li-ion cell that includes\nthe hysteresis voltage is shown in Fig. 1 [3]. The circuit is\nbased on a model widely adopted in the literature [14] and\nit has been modified adding a voltage source accounting for\nhysteresis. The cell voltage is: v = OCVav + vH + R0i + vRC1 + vRC2, (1)",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "Comparing Open-Circuit Voltage Hysteresis Models for Lithium-Iron-Phosphate Batteries",
      "token_count": 283
    },
    {
      "text": "in which OCVav is the average OCV as a function of SoC,\nwhile R0, Rk and Ck are the cell parameters (k = 1, 2), and\nvRCk is the solution of the following first-order equation: RCk 1 dt = − RkCk vRCk + C [i] dvRCk . (2)\nCk 3.35 3.3 3.25 3.2 3.15 3.1 3.05 3 It is worth noticing that the relaxation phenomena also occur\nwhen the battery current i is equal to zero. In the following,\na static analysis of hysteresis is carried out, so that we can\nsafely assume vRCk = 0.\nFinally, the voltage source vH in Fig. 1 represents the hysteretic voltage as a function of SoC, which is not necessarily\na single-valued function. _B. Hysteresis_ In order to model vH, two widely assessed methods are\nused: the first one is the so-called _One-State Hysteresis_ (OSH)\nmodel [3], [8]. The hysteretic voltage is obtained by solving a\nfirst-order relaxation equation characterized by one relaxation\nparameter. The alternative approach adopted is the Preisach\nmodel [10], [13].\nBefore introducing the hysteresis models, we make the\nfollowing assumptions: it is possible to define vH as a function\nof the cell SoC, a function that depends on the SoC actual\nvalue and the SoC history. It is also possible to define a\nmaximum hysteresis loop which “contains” any evolution\nand, thus, trajectory in the plane SoC − vH (state-space for\nhysteresis). The maximum hysteresis loop is defined by its\nupper bound OCVup(SoC) and its lower bound OCVlw(SoC).\nWe also define the average open circuit voltage OCVav(SoC)\nas: OCVav(SoC) = [OCV][up][(][SoC][) +][ OCV][lw][(][SoC][)] . (3) 2 The OCVav as defined in (3) is calculated from the experimental data and is plotted in Fig. 2. It is finally useful to define\nthe non-negative function E(SoC) representing the maximum\nhysteresis value to be added or subtracted to the average value\nOCVav: E(SoC) = [OCV][up][(][SoC][)][ −] [OCV][lw][(][SoC][)] . (4) 2 The function E(SoC) is plotted in Fig. 3. _C. One-State Hysteresis Model_",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 580
    },
    {
      "text": "_C. One-State Hysteresis Model_ Any SoC variation causes the hysteresis term vH to vary\nwith inertia. One way to represent the inertia in SoC is to use\na first-order relaxation equation, as it happens for the voltage\nrelaxation in an RC circuit. In this case we have to take into\naccount that SoC variations might be negative, whereas time\nvariations are positive in the time domain equations. With this\nidea in mind, we can write the differential equations describing\nthe model in the SoC − vH plane when dSoC ≥ 0: dvH\nfor dSoC ≥ 0, (5)\ndSoC [=][ −][γ][ [][v][H][ −] [E][(][SoC][)]] |Col1|Col2|Col3|Col4|Col5|Col6|\n|---|---|---|---|---|---|\n|||||||\n|||||||\n|||||||\n|||||||\n|||||||\n||||||OCV|\n||||||up<br>OCV|\n||||||lw<br>OCV|\n||||||av|\n|||||||\n||||||| H dt [=][ −][sgn(][d][SoC][)] [d][SoC] dt 2.95\n0 0.2 0.4 0.6 0.8 1 state of charge SoC Fig. 2. Hysteresis major loop and average open circuit voltage defined by\n(3), as functions of SoC [3]. 25 20 15 10 5 0\n0 0.2 0.4 0.6 0.8 1 state of charge SoC Fig. 3. Maximum positive hysteresis, defined according to (4) as a function\nof SoC [3]. being γ - 0 and vH = +E the steady-state solution.\nConversely, when dSoC < 0, the steady-state solution is\nvH = −E, and the relaxation equation must be written as: dvH\nfor dSoC < 0. (6)\ndSoC [=][ γ][ [][v][H][ +][ E][(][SoC][)]] In (5)-(6), [1] /γ is an adimensional constant (a sort of “ _state-_\n_of-charge constant_ ”) analogous to the time constant used in\nthe time domain. Joining (5) and (6) we finally obtain: dvH\n(7)\ndSoC [=][ −][sgn(][d][SoC][)][γv][H][ +][ γE][(][SoC][)][.] In order to obtain a time domain equation from (7), we\nmultiply both members by [d][SoC] dt [, obtaining:] dvH",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "dvH [SoC] γvH + γ [d][SoC]\ndt dt E(SoC) (8)\ndt",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 28
    },
    {
      "text": "Considering that i = Qn [d][SoC] dt [, we have:] [SoC] = sgn(i) [i]\ndt Q . (9)\nQn sgn(dSoC) [d][SoC] [i] = [|][i][|] Qn Q In order to identify the Preisach operator, one possibility is\nto identify the Preisach function μ. We follow an alternative\napproach, using the so-called Everett function associated to\nthe first-order reversal (FOR) hysteresis branches depicted in\nFig. 4. The FOR branches are minor hysteresis loops that 3.4 3.3 3.2 3.1 3 2.9 2.8\n0 0.2 0.4 0.6 0.8 1 state of charge (SoC) Fig. 4. First-order reversal (FOR) branches measured (in discharge) with a\nPCT characterization of a 20 A h LFP cell. explore the hysteretic phenomenon with loops of decreasing\namplitude from branch to branch. In our case, ten FOR\nbranches are measured: they are uniformly-spaced with an\nincrease of approximately 10 % in SoC from branch to branch\n(from full charge state SoC = 100 % down to 10 %), with a\nSoC discretization step of 5 %. Temperature is kept constant\nat 298 K (more details on the experimental procedure will\nbe given in the following Section). It is worth noting that\nthe branches are very close to one another, but they do not\noverlap. Measuring FOR branches closer to each other would\nbe desirable, but the experiment is highly time-consuming and\nwould be unpractical. On the basis of the FOR branches, we\ndefine the so-called Everett function E as a function of the\nswitching thresholds α and β, as it is done in [11]: E(α, β) = [OCV][α][ −] [OCV][αβ], (13) 2 which is half of the output increment at point β along a FOR\nbranch starting in α. The function could easily be rewritten in\nthe following way: Substituting (9) into (8) we get: H dt [=][ −|] Q [i][|] E(SoC) (10)\nQn dvH [i][|] γ vH + sgn(i) γ [|][i][|] Qn Qn and, defining τH = γ [Q] |i [n] | [, we finally obtain:] dvH [v][H] + sgn(i) [E][(][SoC][(][t][))] τH τH H dt [=][ −] [v] τH [H] . (11)\nτH A circuit interpretation of (11) is given in [3].",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 599
    },
    {
      "text": "A circuit interpretation of (11) is given in [3]. _D. Preisach Hysteresis Model based on Everett Function_ The basic idea of the Preisach model is that the hysteretic\nresponse can be seen as the superposition of elemental relays’\nresponses. The elemental relay γαβ has two states: “up”\n(γαβ = +1) and “down” (γαβ = −1). Two switching\nthresholds allow the relay to change its state: SoC = α is the\nswitch-up threshold, while SoC = β is the “down” switching\nthreshold. When SoC goes beyond α, then the relay’s response\nswitches to +1. Conversely, when SoC goes below β, its\nresponse turns to −1. Between these thresholds, the state\ndepends on the SoC history. If we write the superposition\nof the relays responses in the integral form, we obtain that\nthe OCV can be expressed as a function of the independent\nvariable SoC(t) as: OCV(t) = μ(α, β)γαβ {SoC(t)} dαdβ, (12)\nα≥β where the elemental relays are distributed according to the\ndensity function μ, also called Preisach function.\nPreisach theory is well assessed in the magnetic community.\nOne of the main results of this theory prescribes that hysteresis\nmust fulfill a necessary and sufficient condition in order to\nbe represented by the so-called Preisach operator reported in\n(12). This condition consists of two properties: _congruency_ and\n_wiping out_ [11]. Such properties are extensively described in [11]. Here, we recall them very briefly.\nThe _wiping out_ property refers to the circumstance that only\nthe input “dominant” extrema are stored, while all the others\nare “wiped out” by the dominant ones. In other words, only a\nsubset of the complete sequence of input extrema contributes\nto the state of the system. In fact, _wiping out_ is also the\nmost common mechanism for memory state updating and\nit can confidently be assumed as satisfied in the case of a\nbattery. Conversely, the _congruency_ property could only be\nassumed as an _approximation_ in the battery case (and, more\ngenerally, in all practical cases of interest). Congruency means\n_invariance_ of minor loops between the same input extrema if\nsubjected to a vertical shift. The smaller the shift, the better\nthe approximation. In [13] it is shown that _congruency_ is better\napproximated when SoC is the input and OCV the output (and\nnot _vice versa_ ), leading to write the superposition integral as\nin (12). α - α",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 600
    },
    {
      "text": "α - α dβ [′] β β [′] - α\nE(α, β) = (14)\nβ [′][ μ][(][α][′][, β][′][)][ dα][′][.] Geometrically, the value of the integral in (14) is associated\nto the upper-left vertex of the triangular domain of integration\nT (α, β).\nThe direct use of (14) would require the numerical evaluation of the integral as well as the determination of μ by\nderiving twice the experimental data. Geometrical considerations [11] prove that the integral (14) can be rewritten as a",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 133
    },
    {
      "text": "linear combination of the Everett function’s values: OCV(t) = 2 [E(αk, βk−1) −E(αk, βk)] −E0 (15) k where all the appearing αi and βj are the dominant extrema constituting the hysteresis state of the battery and\nE0 = E(100 %, 0 %). The main benefit associated with the\nintroduction of the Everett function is that the output is a\nlinear combination of a set of Everett function values, which\nmeans a low computational burden. III. RESULTS _A. Experiments on a LFP Battery_ Pulsed Current Tests (PCT) have been performed on a LFP\ncell having a rated capacity of 20 A h and charge/discharge\ncutoff voltages of 3.65 V and 2.85 V, in order to obtain\nthe relationship between OCV and SoC [3], [15]. The cell’s\nambient temperature T is kept constant at 298 K in a thermal\nchamber. Each PCT is preceded by an initialization procedure,\nincluding a complete discharge/charge cycle. Then, the battery\nis fed by a sequence of constant-current (CC) pulse steps\n(with duration 30 min) determining a 5 % variation of SoC,\nseparated by rest steps (with duration 1 h), in which the current\nis set to zero, so that the terminal voltage can relax toward\nits asymptotical value. The CC pulse value is C/10 = 2 A\n(one tenth of the rated capacity expressed in ampere-hours).\nAs soon as the charge/discharge cutoff voltage is reached,\ncharging/discharging proceeds in constant-voltage (CV) mode.\nThese final conditions define the full-charge (SoC=100 %)\nand full-discharge (SoC=0 %) states and their corresponding\nOCV values, OCV(100 %) and OCV(0 %). A few tens\nof millivolts spreading of these values is observed among\ndifferent experiments, so that OCV(0 %) and OCV(100 %)\nare defined by averaging the measured values. TABLE I\nSOC EVOLUTIONS. Label SoC evolution (%) (a) 100-0-100\n(b) 100-25-75-25-100\n(c) 100-40-60-40-100",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 500
    },
    {
      "text": "(a) 100-0-100\n(b) 100-25-75-25-100\n(c) 100-40-60-40-100 Using the aforementioned procedure, three experimental\nPCTs, described in Table I, are carried out. In all the cases,\nthe OCV experimental points are defined as the cell terminal\nvoltage value reached at the end of each rest step [2], [3].\nSoC value is determined by integrating current samples with\nthe trapezoidal integration rule, and normalizing the charge\nobtained to the rated capacity. The current integral is reset in\ntwo points, when the battery reaches the full-charge and fulldischarge states as defined above. The SoC-OCV characteristic\nof the LFP cell is rather flat, with OCV variation less than\n0.2 V in the SoC range from 10 % to 90 %. Furthermore, the\nsame kind of test has been used to obtain the FOR branches\nin Fig. 4, useful for the identification of the Preisach model. _B. Simulation Results_",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 229
    },
    {
      "text": "_B. Simulation Results_ The two models described above have been used to reproduce the battery static OCV evolution, when the ΔSoC state\nof charge steps defined in the experiments are applied as a\nfunction of time. Three simulations are performed with the\nsame charge variation profiles obtained with PCT described\nin Table I. The simulation initial condition is SoC = 100 %,\n_i.e._, Qn = 20 A h.\nThe hysteresis parameter γ in the OSH model is considered\nconstant and it has been computed as a fitting parameter,\nby minimising the rms error between the simulation results\nand the experimental ones. The value that leads to the best\nachievable results is γ = 17.45. Obviously, this procedure is\nvery sensitive with respect to the data to be fitted, and the\npredictive capability of the method is thus limited in this case.\nOn the contrary, Preisach model is identified on the basis of\na very well defined training procedure, which ensures high\nrepeatability and robustness.\nNumerical results are reported in Fig. 5-Fig. 7. The values\nsimulated with both OSH and Preisach models are plotted\ntogether with the experimental results. The first plot in each\nfigure column shows the hysteretic behaviour in the SoC-OCV\nplane. The evolution of the OCV is represented as a “time\nsimulation” (point-by-point OCV) in the second plot of each\ncolumn. These plots allow us to distinguish the behaviour\nof branches that partially overlap. Finally, the last plot in\neach column shows the point-by-point error for both models.\nTable II collects the rms errors for OSH and Preisach model\n(e [OSH] rms [and][ e] rms [P] [, respectively) and peak errors (][e][OSH] max [and][ e] max [P] [,]\nrespectively) in the three cases analyzed.\nThe results of the two methods are approximately equivalent\nin terms of rms error, as shown in Table II: they are always\nwithin a few percent. For the case (a), both OSH and Preisach\nmodels exhibit a pronounced local error in the full-discharge\nzone. The error is mainly due to the definition of OCV at\nSoC = 0 % reported above. However, this is not an issue\nbecause a large OCV variation corresponds to a very small\nSoC charge around full-discharge. Thus, the model prediction\ndoes not lead to large SoC estimation errors in this zone.\nApart from the peak error at full-discharge, the errors with\nwhich both the models reproduce the hysteretic behaviour of\nthe battery are satisfactorily low. TABLE II\nSIMULATION ERRORS NORMALIZED AT ΔOCV = 0.489 V",
      "page_num": 5,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 584
    },
    {
      "text": "TABLE II\nSIMULATION ERRORS NORMALIZED AT ΔOCV = 0.489 V Case e [OSH] rms e [P] rms e [OSH] max e [P] max\n(a) 1.23 % 2.52 % 5.18 % 12.08 %\n(b) 0.90 % 1.13 % 0.56 % 2.79 %\n(c) 0.71 % 0.57 % 1.10 % 1.18 % IV. CONCLUSIONS The One State Hysteresis (OSH) and Preisach models have\nbeen used to describe the hysteresis in the state-of-charge vs.\nopen circuit voltage characteristic of a lithium-iron-phospate",
      "page_num": 5,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 157
    },
    {
      "text": "3.3 3.2 3.1 3 2.9 3.36 3.34 3.32 3.3 3.28 3.26 2.8 |Col1|Col2|Col3|Col4|Col5|Col6|Col7|\n|---|---|---|---|---|---|---|\n||||||||\n|||||Expe|iment|iment|\n|||||OSH<br>Preisa|ch||\n||||||||\n|||||||| 0 0.2 0.4 0.6 0.8 1 SoC 3.3 3.2 3.1 3 |Col1|Col2|Col3|\n|---|---|---|\n||||\n||||\n||||\n||||\n||Exper<br>|iment|\n||OSH<br>Preisa|ch| 3.36 3.34 3.32 3.3 3.28 3.26 3.24\n0 0.2 0.4 0.6 0.8 1 SoC 2.9 2.8 |Col1|Col2|Col3|Col4|Col5|\n|---|---|---|---|---|\n||||||\n||||||\n|Ex<br>|Ex<br>|periment<br>|||\n|Ex<br>|Ex<br>|periment<br>|periment<br>|periment<br>|\n|O<br>Pre|O<br>Pre|H<br>isach||| 0 10 20 30 40 Points 14 3.24 |Experimen<br>OSH|t|Col3|\n|---|---|---|\n|Preisach|||\n||||\n||||\n||||\n|||| 0 10 20 30 40 50 Points 3 2.5 2 1.5 1 0.5 12 10 8 6 4 2 |O|Col2|SH|Col4|Col5|\n|---|---|---|---|---|\n|O|O|SH|SH|SH|\n|P|P|reisach|||\n||||||\n||||||\n||||||\n|||||| |OSH|Col2|Col3|\n|---|---|---|\n|Preisach|||\n||||\n||||\n||||\n|||| 0\n0 10 20 30 40 Points Fig. 5. Evolution (a): major loop. (Top) Response to SoC history in the\nSoC–OCV plane. (Middle) Point-by-point response to SoC history. (Bottom)\nPoint-by-point error. 0\n0 10 20 30 40 50 Points Fig. 6. Evolution (b): two nested minor loops. (Top) Response to SoC history\nin the SoC–OCV plane. (Middle) Point-by-point response to SoC history.\n(Bottom) Point-by-point error.",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 585
    },
    {
      "text": "3.36 3.34 3.32 3.3 3.28 |Col1|Col2|Col3|t|Col5|Col6|\n|---|---|---|---|---|---|\n|||Experimen<br>OSH|t|t|t|\n|||Preisach||||\n|||||||\n|||||||\n|||||||\n||||||| 0 0.2 0.4 0.6 0.8 1 SoC 3.36 3.34 3.32 3.3 3.28 |Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|\n|---|---|---|---|---|---|---|---|\n|||Expe<br>OSH|riment|riment|riment|riment|riment|\n|||Preis|ach|||||\n|||||||||\n|||||||||\n|||||||||\n||||||||| 0 5 10 15 20 25 30 35 Points 2.5 2 1.5 1 0.5 0 |Col1|Col2|Col3|H<br>isach|Col5|Col6|Col7|Col8|\n|---|---|---|---|---|---|---|---|\n|||OS<br>Pre|H<br>isach|H<br>isach|H<br>isach|H<br>isach|H<br>isach|\n|||||||||\n|||||||||\n|||||||||\n||||||||| 0 5 10 15 20 25 30 35 Points Fig. 7. Evolution (c): two nested minor loops. (Top) Response to SoC history\nin the SoC–OCV plane. (Middle) Point-by-point response to SoC history.\n(Bottom) Point-by-point error. battery. Both methods exhibit low rms errors with respect to\nexperimental data in the three cases analyzed.\nThe OSH model is attractive for its simplicity and capability\nof capturing battery hysteretic effects with the use of a very\nsimple relaxation equation and a single relaxation parameter.\nNevertheless, the heuristic procedure used to find the relaxation parameter weakens this approach. On the other side,\nPreisach model implemented in terms of Everett function is\ncharacterized by a simple, well defined and reliable identification procedure based on the first-order reversal branches\nextraction. One of the most promising feature of the Preisach\napproach is the computationally affordable implementation\nthat relies on rather simple operations (trapezoidal integration)\non a well defined set of experimental data. The low computational complexity makes this last method very promising\nfor an embedded implementation on low-cost BMS embedded\nplatforms. REFERENCES",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 564
    },
    {
      "text": "REFERENCES [1] M. S. Whittingham, “History, Evolution, and Future Status of Energy\nStorage,” _Proc. IEEE_, Vol. 100, pp. 1518–34, May 2012. [2] M. A. Roscher, O. Bohlen, and J. Vetter, “OCV Hysteresis in LiIon Batteries including Two-Phase Transition Materials,” _International_\n_Journal of Electrochemistry_, Vol. 2011, Article ID 984320, 2011. [3] F. Baronti, W. Zamboni, N. Femia, R. Roncella, R. Saletti, “Experimental Analysis of Open-Circuit Voltage Hysteresis in Lithium-IronPhosphate Batteries,” _Proc. of IEEE IECON 2013_, pp. 6726–31, 2013. [4] H. Rahimi-Eichi, U. Ojha, F. Baronti, and M.-Y. Chow, “Battery\nManagement System: An Overview of Its Application in the Smart Grid\nand Electric Vehicles,” _IEEE Ind. Electron. Mag._, Vol. 7, No. 2, pp. 4-16,\n2013. [5] L. Lu, X. Han, J. Li, J. Hua, and M. Ouyang,, “A review on the key\nissues for lithium-ion battery management in electric vehicles,” _Journal_\n_of Power Sources_, Vol. 226, pp. 272288, 2013. [6] R. Restaino and W. Zamboni, “Comparing particle filter and extended\nkalman filter for battery State-Of-Charge estimation,” _Proc. of the_\n_IECON 2012 - 38th Annual Conference on IEEE Industrial Electronics_\n_Society_, pp. 4018-4023, 2012. [7] R. Restaino and W. Zamboni, “Rao-blackwellised particle filter for\nbattery state-of-charge and parameters estimation,” _Proc. of the IECON_\n_2013 - 39th Annual Conference on IEEE Industrial Electronics Society_,\npp. 6783–6788, 2013. [8] G. L. Plett, “Extended Kalman filtering for battery management systems\nof LiPB-based HEV battery packs: Part 2. Modeling and identification,”\n_J. Power Sources_, Vol. 134, No. 2, pp. 262–76, 2004.",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 541
    },
    {
      "text": "[8] G. L. Plett, “Extended Kalman filtering for battery management systems\nof LiPB-based HEV battery packs: Part 2. Modeling and identification,”\n_J. Power Sources_, Vol. 134, No. 2, pp. 262–76, 2004. [9] F. Baronti, W. Zamboni, N. Femia, R. Roncella, S. Rosi, S. Roberto,\nH. Rahimi Eichi, and M.-Y. Chow, “Parameter Identification of Li-Po\nbatteries in electric vehicles: a comparative study,” _Proc. of the IEEE_\n_International Symposium on Industrial Electronics_, pp. 1-7, 2013. [10] F. Preisach, “ Uber die magnetische Nachwirkung,” [¨] _Zeitschrift f¨ur physik_,\nVol. 94, No. 5-6, pp. 277-302, 1935. [11] I. D. Mayergoyz, _Mathematical Models of Hysteresis_, Springer, 1991. [12] X. Tang, X. Zhang, B. Koch, D. Frisch, “Modeling and estimation of\nnickel metal hydride battery hysteresis for SOC estimation,” _Proc. of the_\n_IEEE International Conference on Prognostics and Health Management,_\n_2008 (PHM 2008)_, pp. 1–12, 2008. [13] F. Baronti, N. Femia, R. Saletti, C. Visone, W. Zamboni, “Hysteresis Modelling in Li-ion Batteries,” _IEEE Trans. Magn._, doi\n10.1109/TMAG.2014.2323426, in press, 2014. [14] M. Chen and G. Rincon-Mora, “Accurate Electrical Battery Model Capable of Predicting Runtime and I-V Performance,” _IEEE Transactions_\n_on Energy Conversion_, Vol. 21, pp. 504–511, 2006. [15] A. Eddahech, O. Briat, and J.-M. Vinassa, “Thermal characterization\nof a high-power lithium-ion battery: Potentiometric and calorimetric\nmeasurement of entropy changes,” _Energy_, Vol. 61, pp. 432–439, 2013.",
      "page_num": 7,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 522
    }
  ],
  "total_chunks": 17,
  "created_at": "2026-02-04 14:04:56"
}