{
  "filename": "Lithium Plating Detection Methods in Lithium-ion Battery_09092020.pdf",
  "chunks": [
    {
      "text": "1",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 1
    },
    {
      "text": "U. Janakiraman [a], Taylor R. Garrick [b] and M.E. Fortier [a] a Battery Cell Engineering, General Motors, Warren, MI 48093, USA\nb Global Virtual Powertrain & Electrification, General Motors, Warren, MI 48093, USA Lithium-ion batteries (LiB) offer a low-cost, long cycle-life and high energy density\nsolution to the automotive industry. There is a growing need of fast charging batteries for\ncommercial application. However, under certain conditions of high currents and/or low\ntemperatures, the chance for Li plating increases. If the anode surface potential falls below\n0 V versus Li/Li [+], the formation of metallic Li is thermodynamically feasible. Therefore,\ndetermination of accurate Li plating curve is crucial in estimating the boundary conditions\nfor battery operation without compromising life and safety. There are various\nelectrochemical and analytical methods that are employed in deducing the Li plating\nboundary of the Li-ion batteries. The present paper reviews the common test methods and\nanalysis that are currently utilized in Li plating determination. Knowledge gaps are\nidentified, and recommendations are made for the future development in the determination\nand verification of Li plating curve in terms of modeling and analysis. **Introduction**",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "**Lithium Plating Detection Methods in Li-ion Batteries**",
      "token_count": 269
    },
    {
      "text": "**Introduction** Li-ion batteries (LiBs) have been widely used in various applications like electric\nvehicles and energy storage systems, which require great durability and safety. For\npractical applications, fast charge capability of the battery is desired, such as 15 min\ncharging to 80% state of charge (SOC). However, certain charging conditions are known\nto provoke Li plating which can impact safety. [[1-6]] Li plating is an undesired side reaction\non the anode side of Li-ion batteries. Li ions are reduced to metallic Li instead of\nintercalating into the anode crystal structure. Deposition of metallic Li also enables\ndendrite formation. This occurs where the local anode potential drops down to 0 V vs.\nLi/Li [+] . In the presence of local inhomogeneity of the graphite anode surface, Li plating\ncan be localized [[7, 8]] . It can also be induced by slow intercalation kinetics and high SEI\n(Solid Electrolyte Interface) film resistances in the anode, due to low temperatures or high\ncurrent rates [[9, 10]] as well as by a slow diffusion processes [[11, 12]] . A poorly designed cell or\nwrong charging protocols may also cause Li plating. Anode material type influences Li\nplating due to the differences in equilibrium potential; Li titanate is the least affected by Li\nplating and hard carbon is better than graphite [[10, 13]] . Similarly, electrolyte composition\nalso affects the low-temperature performance of Li-ion batteries [[9, 14-16]] . In general, the\ndeposited metallic Li is reversible. However, during oxidation, Li dendrites can lose\ncontact with the active material, leading to dead Li in the cell [[17]] . Furthermore, the plated\nmetallic Li is highly reactive and forms and irreversible SEI with the electrolyte [[18, 19]] . Both,\nthe dead Li as well as its SEI, lead to a fast capacity fade of the battery. Therefore,\nmeasurement of cell capacity and resistance serve as the direct way to detect Li plating.\nDifferent studies suggest that metallic Li deposited on a graphite electrode is partly\nreversible. It has been reported that deposited Li can re-intercalate into the graphite during\nrelaxation of the electrode. [[11, 20]] Oxidation (‘stripping’) of metallic Li was observed during",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "**Lithium Plating Detection Methods in Li-ion Batteries**",
      "token_count": 509
    },
    {
      "text": "2 discharge processes. Both processes of Li recovery (re-intercalation as well as stripping)\ncan be directly observed in the cell potential. [[21-23]] Methods for detection of Li plating can be divided into the following categories: (1)\nMeasurement of anode potential vs Li/Li [+] with a reference electrode [[24-27]] . (2) Battery\ndestructive physical analysis and imaging of anode. [[28, 29]] (3) Electron Paramagnetic\nResonance (EPR) [[30, 31]] and Nuclear Magnetic Resonance (NMR) [[32, 33]] to detect a\nparticular range of resonance frequency corresponding to metallic Li. (4) High precision\nmeasurement of coulombic efficiency [[34, 35]] in which the plot of coulombic inefficiency per\nhour versus time fall on the same curve for different tests if cell aging is dominated by SEI\ngrowth. Deviation from this curve indicates Li plating. (5) Measurement of cell\nthickness [[36-39]] . Li metal deposition induces larger volume change than Li [+ ] intercalation\ninto graphite, estimated to be 0.37 cm [3] /Ah [[36]] . Thickness change becomes irreversible\nwhen Li plating occurs. (6) Measurement of graphite lithiation degree via in-situ Neutron\nDiffraction [[40]] . (7) Detection of a distinct voltage plateau after charging [[9, 21-23, 41-44]] . In\naddition to the above techniques, there are several new methods evolved in the recent years\nsuch as (8) AC impedance analysis [[45]] in which the plot of interfacial impedance versus\nSOC decreases with increasing SOC when Li plating occurs (9) Accelerated Rate\nCalorimetry [[46]] which measures the heat of reaction in the presence of plated Li (10)\nAcoustic Time of Flight [[47]] detection of transmitted ultrasonic waves as it changes with\ncell thickness during Li plating and (11) Mass Spectrometry Titration [[48]] to quantify the\nSEI components. The details of these different methods will be discussed in this review\narticle.",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 458
    },
    {
      "text": "The most common Li plating detection method is the detection of voltage plateau due\nto Li stripping process which thereby indicates the occurrence of Li plating during charging.\nThe voltage plateau can occur either at the beginning of discharge or of relaxation after\ncharging. Among the above methods, voltage plateau is the most feasible method for online\ndetection of Li plating in real-world applications, as it is nondestructive and does not\nrequire special and expensive equipment. Prior works demonstrated the feasibility of\nadopting voltage plateau as a method for Li plating detection. Therefore, mathematical\nmodels have been extensively applied to predict performance and life of LiBs and gain\nfundamental insights into the internal cell characteristics. [[49-56]] Several works have been\nreported to study Li plating during overcharge [[57, 58]] or during charge at high rates and/or\nlow temperatures [[33, 59]], and to study the capacity loss induced by Li plating [[60]] . Most of\nthese models only considered Li plating process and neglected Li stripping process; thus,\ncannot capture the voltage plateau behavior. Hein and Latz [[61-64]] attempted to simulate Li\nstripping and the associated voltage plateau behavior, using a 3D microscopic model. It is\nshown that Li metal distribution is highly nonuniform in the anode. In this review, we are offering an overview of the various Li plating detection and\nanalysis methods, including mathematical models that are used for simulating the\nelectrochemical characterization of the Li plating event.",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 315
    },
    {
      "text": "3 **Discussion** Three Electrode Diagnostics During charging at low temperatures, high rates, and high states of charge, the\ndeposition of metallic Li on anodes occurs which leads to rapid battery aging and failure. [[11, ] 19, 21, 34, 65-69] This Li deposition on anodes can be detected in battery cells with a reference\nelectrode. [[19, 65, 68, 70]] However, commercial cells in automotive or consumer electronics\napplications do not contain a reference electrode. Recently, much work has been done using\na three-electrode setup (i.e. anode, cathode, and reference.) [[68, 70-72]] Bhardwaj [[70]] used a Li reference electrode built into a cell to investigate a charging\nstrategy to avoid Li deposition on anodes. Zhang [[68]] utilized a reference electrode while\ninvestigating a stepwise charging procedure with reduced current at the beginning of\ncharging followed by a higher current. Itou [[71]] collected electrodes from aged cells and\nreconstructed them together with a Li reference electrode and were able to determine the\nresistances of the anode and the cathode versus the reference separately. Waldmann [[73]]\nconstructed three-electrode cells from commercial 18650s with the addition of a Li\nreference electrode. This allowed for the measurement of the anode potential against the\nLi reference during charging of the reconstructed cells and determination of Li deposition.\nWaldmann observed from anode potential measurement that Li deposition on anodes in\ncommercial cells is possible even at ambient temperature and low charge rates. Koch [[74]] has also done work on three electrode setups. These offer the ability to\nmonitor the onset of Li plating in an electric vehicle and link with controller logic in a\nbattery management system. However, to date, this type of reference electrode setup has\nnot been seen in a vehicle application. Commercial cells in automotive or consumer\nelectronics applications do not contain a reference electrode. Moreover, the location of a\nreference electrode should be carefully controlled to measure resistances at each electrode\nand solid-state diffusion rates. Measurement of Coulombic Efficiency There are two kinds of Li plating, reversible and irreversible. Reversible Li plating\ndescribes deposited Li that is in electrical contact with the negative electrode. Therefore,\nreversibly plated Li is stripped during the discharge step, i.e. 𝑄𝑠𝑡𝑟𝑖𝑝𝑝𝑖𝑛𝑔 = 𝑄𝑟𝑒𝑣,𝑝𝑙𝑎𝑡𝑖𝑛𝑔 [CE1]",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "𝑄𝑠𝑡𝑟𝑖𝑝𝑝𝑖𝑛𝑔 = 𝑄𝑟𝑒𝑣,𝑝𝑙𝑎𝑡𝑖𝑛𝑔 [CE1] This reversible part does not cause any capacity loss because it is just another way of\ncharging the graphite electrode. In contrast, irreversibly plated Li exhibits only fragile\nelectrical contact with the negative electrode. Such Li may become electrically isolated\nfrom the graphite electrode during the stripping process. Irreversible plating, i.e. dead Li,\nis thus mainly responsible for the capacity losses during low temperature charging with\nhigh currents. [[21]]",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 160
    },
    {
      "text": "4 There are additional capacity losses due to the formation of surface films on the\nplated Li. At first, Li is plated directly on the electrode surface. [[75]] The plated Li can grow\nthrough the SEI and react with the electrolyte. [[11]] Subsequent surface film formation causes\ncapacity losses which are not distinguishable from irreversible plating. Moreover, the\nformation of such surface films can also cause electrical isolation of deposited Li. [[59]] The\ncharge corresponding to irreversible plating 𝑄𝑟𝑒𝑣,𝑝𝑙𝑎𝑡𝑖𝑛𝑔 includes the capacity loss caused\nby surface film formation. It is generally assumed that capacity losses due to SEI formation\nare negligible at low temperatures. The capacity loss during a charge/discharge cycle is\nsimply the difference between the charge throughput during charge Qch and discharge Qdc,\ni.e. Qirrev.plating = Qch - Qdc. The total charge during Li plating is Qplating = Qrev.plating +\nQirrev.plating. The reversibility “R” of the plating process, R = Qrev.plating/Qplating. The amount\nof Li plating, nplating = Qplating/F (Faraday constant F = 96485.3399 C mol [-1] ) [[76]] as Li plating\nis a one-electron process (Li [+] + e [-] → Li). The mass of plated Li mplating is then calculated\naccording to mplating = nplating MLi (molar mass of Li MLi = 6.94 g mol [-1] ). [[76]]",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 357
    },
    {
      "text": "Reversibility “R” of the plating process can be determined by the quantitative\ndetection method. The reversibility shows maxima at medium SOC and decreases towards\nhigh SOC. At high SOC, the following processes can take place: formation of fragile Li\ndeposit, subsequent chemical intercalation of some of the plated Li, and surface film\nformation on the residual plated Li. These processes lead to poor electrical pathway and\neventual isolation of fragile Li deposit during Li stripping. Such dead Li cannot be stripped\nand is therefore electrochemically inactive, i.e. the reversibility is reduced. At low SOC,\nan unknown degradation mechanism leads to capacity losses in addition to Li plating. At a\ngiven SOC, reversibility is reduced with decreasing temperature. Li plating increases at\nlower temperatures due to kinetic polarization effects. Thus, more plated Li is prone to lose\nits electrical contact with the graphite electrode, which aggravates irreversible plating and\nreduces the reversibility. The coulombic efficiency CE describes the ratio between\ndischarge and charge during one cycle, i.e. CE = Qdc/Qch. It typically illustrates capacity\nlosses during charging, e.g. SEI formation at ambient temperatures. CE at low temperatures\ncan be understood by the following equation, CE = (Qch-Qirrev.plating)/Qch. Thus, the\ncoulombic efficiency exhibits a contrary SOC dependence compared to irreversible plating\nfor constant temperature. In a plot of SOC vs CE, a linear SOC dependence of the plated\nLi mass is observed for low to medium SOC values. Decreasing temperature leads to\nhigher Li plating growth rates and shifts the plating initiation point to lower SOC which\nmeans that the plating process starts earlier. Both results are attributed to increased kinetic\neffects. This method is suitable for all cathode materials without a pronounced voltage\nplateaus in the discharge profile. It is crucial that the stripping plateau is clearly identifiable\nand not overlain by plateaus of the cathode material. High Precision Coulometry As we saw in the previous section, when Li plating occurs during cycling, the\ncoulombic efficiency of the cell will decrease. Based on this premise, Li plating should be\ndetectable as small changes to the coulombic efficiency of cells cycling at different rates.\nThis implies that the detection limits for Li plating will be dictated by the precision and\naccuracy of measurements of the coulombic efficiency. A High Precision Charger [[34, 77]]\nshould therefore have a high degree of sensitivity for detecting Li plating in any cell type\nunder standard cycling conditions. Burns _et al_ carried out the High Precision Coulometry",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 556
    },
    {
      "text": "5 (HPC) study on a 3.4 Ah Panasonic 18650 (NCA/graphite) cells at different charge rates.\nThey cycled the cells at 25°C and between 2.8 and 4.2 V at charge rates of C/10, C/5, C/3,\nC/2 or 1C and a discharge rate of C/10 on the High Precision Charger. A class “A”\nresistance temperature detector (RTD) (US Sensor, PPG101A1) was attached to the cells\nto measure variations in cell temperature at high rates. After cycling, cells were discharged\nto 0 V (to ensure safety while opening) and opened to look for evidence of Li plating on\nthe negative electrode. The coulombic efficiency (CE) was time normalized to compare\ncells that are in the time (h) dependent regime. The coulombic inefficiency normalized over\ntime (CIE/h) shows all cells at low rates fall on the same curve indicating, they are in a\npurely time dependent degradation regime which agrees well with the previous work from\nSmith _et al_ . [[78, 79]] However, when charging at 1C or higher the CIE/h becomes worse than\nthose cells in the time dependent regime indicating the occurrence of Li plating. Based on\nthe work of Smith _et al_ . [[78, 79]] it was shown that normally parasitic reactions are\npredominantly time dependent and cycle independent. The only exception is parasitic\nreactions on Silicon negative electrodes which are expected to be strongly cycle dependent\ndue to the large volume changes during each cycle. Therefore, the increase in CIE/h must\nbe attributed to Li plating as it is a cycle dependent degradation mode. As can be seen in\nFigure 1, with increasing rate, the amount of Li plating/stripping increases, and the CIE/h\ngets worse. Figure 1. Capacity and Coulombic efficiency and inefficiency per hour (CIE/h)\nversus time for pouch cells cycling at 30°C during cycling with a two-step charge process from C/50 to 5C charge rates. Reprinted from J. C. Burns _et al_, _Journal of The_ _Electrochemical Society_, **162** (6) A959-A964 (2015). [[34]] (CC BY, [https://creativecommons.org/licenses/by/4.0).](https://creativecommons.org/licenses/by/4.0)",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 526
    },
    {
      "text": "6 From this data it can be seen when Li plating occurs it causes an increase in the\ndegradation rate of the cells. The cells charged at a 5C rate lessen their capacity loss rate\naround 200 hours (near 170 mAh of remaining capacity) which is likely due to the large\ndifference in over potential of the negative electrode relative to the positive electrode.\nWhen the cell is reaching the upper cutoff potential of 4.2 V, the state of charge of the\ngraphite is significantly less than in the early cycles (hence the lower full cell capacity). As\ngraphite is not being charged to as high an electrode state of charge, the voltage curve of\nthe graphite no longer reaches 0 V vs Li/Li [+] to initiate Li plating even with the same\noverpotential from the high current. Figure 2 shows the results for CIE/h as a function of charge rate at different\ntemperatures. Coulombic efficiency and CIE/h are taken as an average over the final ∼50\nhours of cycling while fade is taken as a linear fit to the capacity versus time data over that\nsame final ∼50 hours. Figure 2 shows that the CIE/h for cells cycled at lower rates at a\ngiven temperature is a constant. At lower temperature this constant is smaller as the\ndegradation rate is less (than at higher temperature) due to the slower rate of parasitic\nreactions. However, as the rate is increased, the CIE/h begins to deviate from the low-rate\nconstant value and becomes larger (worse). This leads to “kinks” in the CIE/h versus rate\ncurves where CIE/h is constant during the time dependent regime and then increases with\nrate during the charge rate dependent regime (where Li plating occurs). The “kinks”\nindicate the charge rate at which Li plating begins at that temperature. There are measurable\ndifferences in the fade rates (especially when the efficiency becomes very poor at high\nrates) but the difference in fade rates is so small that it is much easier to resolve the onset\nof plating by examining the CIE/h. They confirmed Li plating in their study, by opening\nthe cells after cycling at different rates at ∼50% state of charge and inspecting the anodes,\nin an argon-filled glove box. Figure 2. Charge C-rate vs CIE/h to 5C charge rates at different temperatures. Reprinted from J. C. Burns _et al_, _Journal of The Electrochemical Society_, **162** (6) A959-A964 (2015). [[34]] [(CC BY, https://creativecommons.org/licenses/by/4.0)](https://creativecommons.org/licenses/by/4.0)",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 577
    },
    {
      "text": "7 Figure 2 shows a clear indication of the Li plating as opposed to the Li deposition/stripping\ncurve from the dV/dt or dV/dQ plots. At 12°C, the “kink” in the CIE/h curve occurs\nbetween C/5 and C/2 which implies that the cell charged at C/5 should not show Li plating\nwhile the cell charged at C/2 should show small amounts and then the higher. Thus, high\nprecision coulometry when coupled with a robust thermal chamber is an effective and nondestructive tool for Li plating determination. Voltage Relaxation and dV/dt",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 134
    },
    {
      "text": "Voltage Relaxation and dV/dt In the plot of cell voltage against time, the occurrence of voltage plateau is ascribed\nto stripping of deposited Li metal and thus indicates that Li is plated during charging. The\nvoltage plateau can occur either at the beginning of discharge or of relaxation after charging.\nAmong the various methods, voltage plateau is the most feasible method for online\ndetection of Li plating in real-world applications, as it is nondestructive and does not\nrequire special and expensive equipment. Smart _et al_ . [[9, 41]] were among the first to apply\ndischarge voltage plateau after low temperature (-40 °C) charging as a tool for Li plating\ndetection and proposed that the length of plateau can be used as a measure of deposited Li\nmetal amount. Petzl and Danzer [[21]] presented a differential voltage approach to detect and\nquantify Li plating. In their tests, a cell was charged with 1C rate at < -20 °C and discharged\nimmediately after charging. A voltage plateau appeared at the beginning of discharge. Later,\nUhmann _et al_ . [[22]] proposed to detect voltage plateau during relaxation (rest time after\ncharging) rather than during discharge, which is advantageous as the cell has no net current\nat open-circuit, making the plateau more pronounced and easier to detect. The advantage\nof analyzing dV/dt during post charge relaxation is that data could be easily collected\nimmediately after charging, or by turning off a fraction of the vehicle LiB packs during the\nfirst few minutes of driving. In their work by Uhlmann _et al_ . [[22]] the Open Circuit Voltage\n(OCV) after charge showed plated Li can chemically intercalate into graphite when the cell\nis at rest. The process of Li plating followed by intercalation into graphite gives rise to a\ncharacteristic ‘dual plateau’ OCV feature, which is highlighted in Figure 3. [[80]] This plateau\nwas interpreted as mixed potential resulting from the interplay of Li intercalation and\ndissolution of deposited metallic Li on the anode surface. The first potential plateau during\nrelaxation corresponds to the mixed potential of the plated Li and lithiated graphite (LixC6).\nAs the plated Li chemically intercalates, the mixed Li/LixC6 potential transitions to a pure\nLixC6 potential after a threshold amount of surface Li has been depleted. This phenomena\nis more prominent as a voltage derivative (Figure 3, Dotted line), which is first proposed\nby Schindler _et al_ . [[23]] While differential OCV (dV/dt) have been used by many groups to\nstudy Li plating, the experimental study was either limited to cold temperatures (≤ 0°C) or\ncharging to high graphite states of charge (SOC). [[22]] However, EV battery control systems\nrequire a technique that indicates initiation of Li plating at high charge rates (C-rates) and\nat moderate temperatures typically used for fast charge.",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 641
    },
    {
      "text": "8 Figure 3: Graphite voltage relaxation after significant Li plating. Reproduced with\npermission from K. Zachary M., M. Eric J. and M. Bryan D., ACS Energy Lett. **5**, 1750 `−` 1757 (2020). [[82]] Copyright © 2020 from American Chemical Society. The voltage relaxation method was adopted by many other researchers. [[23, 42, 43]] .\nBauer _et al_ . [[42]] applied this method to study the impacts of charging temperature on Li\nplating and found that the duration of voltage plateau was longer at lower charging\ntemperatures. This work is closer to real-world applications as the tested cell is a\ncommercial large-size (16Ah) cell and at practical temperatures (-7.5 °C ~ +27.5 °C).\nLuders _et al_ . [[43]] further applied the voltage relaxation method along with in-situ neutron\ndiffraction to examine the impacts of charge rate on Li plating, with a 1.95Ah 18650 cell\ncharged at -2 °C. The increase of Li plating amount during cell relaxation was estimated\nfrom the gain in graphite lithiation degree measured by neutron diffraction and it was found\nto be proportional to the duration of voltage relaxation plateau. These results indicate that\nthe time to reach dV/dt peak can be used for assessing the Li plating amount in different\ntests. The rate of Li stripping is affected by the capability of Li [+] intercalation into graphite\nand by the rate of Li [+] diffusion and migration from the separator to the foil. In addition to voltage relaxation (dV/dt), another widely reported technique for\nelectrochemical Li detection is differential voltage analysis of the discharge profile (dV/dQ\nor dQ/dV). In the plot of derivative of voltage over capacity (dV/dQ), a distinct peak\nappeared at the beginning of discharge. This peak indicates the end of Li metal stripping,\nand the discharge capacity at the dV/dQ peak corresponds to the total amount of Li plated\nduring charging. This method can estimate the amount of plated Li based on the length of\nthe plateau. [[21, 23]] While dV/dt method require a rest period after charge, dV/dQ must have\nimmediate discharge to maximize the signal corresponding to Li stripping. The former is\neasier to implement whereas the latter can give false positive plating signals [[81]] .\nConsidering the above challenges, dV/dt method is found to be the more commercially\nfeasible technology. However, all the electrochemical methods discussed here have",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 553
    },
    {
      "text": "9 limitation to detect localized deposition due to averaging effects, which will be discussed\nlater in this article. Li Plating Modeling Due to the detrimental effects that Li plating can have on battery performance, a\npush to develop mathematical methods to predict the onset of metallic Li growth has been\nseen in recent years. These numerical approaches through modeling offer a way to quantify\nthe amount of plated Li which may offer a clearer picture into the extent of Li plating\ncompared to the experimental in-situ and ex-situ methodologies, and offer the ability to be\nloaded into controllers [[82, 83]] to provide an electrochemical model for in-vehicle\napplications. Arora and White may have been the first to propose a set of equations that\ndescribe the Li deposition reaction at overcharge. [[57]] These equations were coupled with\ntraditional porous electrode theory as detailed by Newman and colleagues. [[84-91]]\nRegarding Li transport in a Li ion battery, Li is assumed to transport from the solid\nmatrix of one active material (such as the anode) governed by transport properties of the\nactive material and reacts at the interface between the active material and the electrolyte\ngoverned by the electrochemical kinetics. Li salt in the electrolyte diffuses from one porous\nelectrode, through a separator, to another porous electrode, governed by the liquid phase\ntransport of the electrolyte. At the interface of the second electrode (such as the cathode)\nand the electrolyte, the Li reacts and intercalates into the solid phase. Traditional porous\nelectrode theory governs these reaction and transport phenomena as is briefly detailed\nbelow. It is assumed that Ohm’s law holds in the solid phase of a porous electrode 𝑖1 = −𝜎𝑒𝑓𝑓 𝑑𝜙1 𝑑𝜙1 𝑖1 = −𝜎𝑒𝑓𝑓 𝑑𝑥1 [M1] with boundary conditions such that charge is maintained and current flows from one porous\nelectrode to another. When considering an electrochemical cell in one dimension, at the interface\nof one porous electrode and current collector: 𝜎1 𝑑𝜙1 [M2] [= 𝑖][𝑎𝑝𝑝] 𝑑𝜙1 𝜎1 1 [M2] 𝑑𝑥 [= 𝑖][𝑎𝑝𝑝] At the interface of the second porous electrode and current collector: 𝜎1 𝑑𝜙1 [M3] [= −𝑖][𝑎𝑝𝑝] 𝑑𝜙1 𝜎1 1 [M3]",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "𝜎1 1 [M3] 𝑑𝑥 [= −𝑖][𝑎𝑝𝑝] Charge is maintained in the solution phase of each porous electrode, 2𝜅𝑒𝑓𝑓2,𝑎𝑅𝑇 𝑖2 = −𝜅𝑒𝑓𝑓 𝑑𝜙2 2 𝑑𝑥 [+ ] ~~[(]~~ ) (1 +\n𝐹 𝑑ln𝑓 [𝑑ln𝑐][2] [M4]\n𝑑ln𝑐2 ~~[)]~~ [ (1 −𝑡][+][)] 𝑑𝑥 as well as the separator, 2𝜅𝑒𝑓𝑓2,𝑠𝑅𝑇 0 = −𝜅𝑒𝑓𝑓,𝑠 𝑑𝜙2 2 𝑑𝑥 [+ ] ~~[(]~~ ) (1 +\n𝐹 𝑑ln𝑓 [𝑑ln𝑐][2] [M5]\n𝑑ln𝑐2 ~~[)]~~ [ (1 −𝑡][+][)] 𝑑𝑥 The material balance in the solution phase of a porous electrode is governed by Fick’s law:",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 306
    },
    {
      "text": "10 𝑑𝜖2𝑐2 𝑑\n𝑑𝑥 [(−𝐷][𝑒𝑓𝑓][2] 𝑑𝑐2 2 𝑑𝑥 [+] 𝑑𝑖2 2 2 = − 2 2 + 𝑖 2 [M6] 𝑑𝑡 𝑑𝑥 [(−𝐷][𝑒𝑓𝑓][2] 𝑑𝑥 [+] 𝐹 ~~[)]~~ [ −] 𝑛𝐹 𝑑𝑥 As well as the separator: 𝑑𝜖2,𝑠𝑐2 𝑑 𝑑𝑐2 2 2 = − 𝑑𝑡 𝑖2𝑡+ 2 + 𝐹 ~~[)]~~ [ −] 𝑠𝑖\n𝑛𝐹 𝑑\n𝑑𝑥 [(−𝐷][𝑒𝑓𝑓][2,𝑠] 𝑑𝑐2 2,𝑠 2 = − 2 [M7] 𝑑𝑡 𝑑𝑥 [(−𝐷][𝑒𝑓𝑓][2,𝑠] 𝑑𝑥 ~~[)]~~ The material balance in the solid phase is calculated in a pseudo second dimension, hence why it\nis commonly referred to as a P2D model. Spherical particles are typically assumed and the solid\nphase Li concentration is modeled in 1D in the radial direction where: = −\n𝑑𝑡 𝑑𝑐1 𝑑𝑡 [=] 𝑑(𝐷1 𝑑𝑟 [M8] 𝑑𝑟 𝑑𝑐1 𝑑𝑟 ~~[)]~~ 𝑑𝑐1,𝑎 [M9]",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 442
    },
    {
      "text": "𝑟𝑝 [M10]\n3𝜖2,𝑎 −𝐷1,𝑎 𝑑𝑐1,𝑎",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "𝑑𝑟 [|] r=0 [= 0]",
      "token_count": 38
    },
    {
      "text": "𝑠𝑖𝑗𝑎 𝑛𝐹 Finally, the electrochemical reactions are governed by the Butler-Volmer equation: 𝛼𝑎𝐹𝜂 −𝛼𝑐𝐹𝜂 𝑖2 = 𝑖0 (𝑒𝑥𝑝 ~~(~~ 𝑎 𝑅𝑇 ~~[)]~~ [ −𝑒𝑥𝑝] ~~[(]~~ 𝑐 [M11] 𝑅𝑇 ~~[)]~~ [)] Most treatment of Li plating using an electrochemical model use the set of equations listed above,\nwith various modifications for the plating physics. Arora and White proposed a set of equations that describe the Li deposition reaction\nat overcharge. [[57]] The rate of the Li deposition reaction is charge-transfer-kinetic controlled\nand can be expressed by a Butler-Volmer expression as follows 𝑖𝑘 = 𝑖0,𝑘 [𝑒𝑥𝑝 (𝛼𝑎,𝑐𝐹 [𝜂] [)][ −𝑒𝑥𝑝] [(] −𝛼𝑐,𝑘𝐹 𝜂 )] [M12] 𝛼𝑎,𝑐𝐹 −𝛼𝑐,𝑘𝐹 𝑖𝑘 = 𝑖0,𝑘 [𝑒𝑥𝑝 ( 𝑅𝑇𝑎,𝑐 [𝜂][𝑠,𝑘][)][ −𝑒𝑥𝑝] [(] 𝑅𝑇𝑐,𝑘 𝜂𝑠,𝑘)] [M12] A number of different approximations can be made to simplify the computational processes\nwhile including the Li deposition side reaction. The cathodic Tafel expression can be used\nto describe the rate expression if either the deposition reaction is considered to be\nirreversible or if the amount of Li deposited is very small and reacts quickly with the\nsolvent. In that case, the rate expression will be 𝑖𝑘 = 𝑖0,𝑘𝑒𝑥𝑝 ~~(~~ −𝛼𝑐,𝑘𝐹 𝜂 ) [M13] 𝑎,𝑐 𝑅𝑇 [𝜂][𝑠,𝑘][)][ −𝑒𝑥𝑝] [(] −𝛼𝑐,𝑘𝐹 𝑐,𝑘 𝜂 ) [M13]",
      "page_num": 11,
      "chunk_index": 2,
      "section_name": "𝑑𝑟 [|] r=rp [=]",
      "token_count": 597
    },
    {
      "text": "𝑐,𝑘 𝜂 ) [M13] 𝑅𝑇 𝑠,𝑘 Alternatively, the surface overpotentials may be sufficiently low so that the reaction can be\nexpressed adequately using the linear approximation 𝑖𝑘 = 𝑖0,𝑘 (𝛼𝑎,𝑘+𝛼𝑐,𝑘)𝐹 𝜂 [M14] 𝑅𝑇 𝑠,𝑘",
      "page_num": 11,
      "chunk_index": 3,
      "section_name": "𝑑𝑟 [|] r=rp [=]",
      "token_count": 112
    },
    {
      "text": "11 Arora and White [[57]] assumed that the Li deposition reaction is semi-reversible in that at\nleast part of the deposited Li can dissolve during discharge. Some of the Li may react with\nthe electrolyte to form insoluble product. In the above equations, 𝑖0,𝑘 is the exchange\ncurrent density and 𝜂𝑠,𝑘 is the local value of the surface overpotential defined as 𝜂𝑠,𝑘 = 𝜙1 −𝜙2 −𝑈𝑘 −𝐹𝑗𝑛,𝑘𝑅𝑓𝑖𝑙𝑚 [M15] where 𝑈𝑘 is the open-circuit potential. The potential variables 𝜙1 and 𝜙2 represent the potentials\nin the solid and solution phases, respectively, and 𝑖0,𝑘, 𝛼𝑎,𝑘, and 𝛼𝑐,𝑘 are the kinetic parameters.\nBased on the above equations and assumptions, the following kinetic expressions can be derived 𝛼𝑐,1𝐹 𝑅𝑇 [[][𝜙][1][ −𝜙][2][ −𝑈][𝑘] [−] 𝑗𝑛,1 = 𝑖0,1 𝐹 [[[𝑒𝑥𝑝(] 𝛼𝑎,1𝐹 𝑅𝑇 [[][𝜙][1][ −𝜙][2][ −𝑈][𝑘] [−𝐹𝑗][𝑛,𝑘][𝑅][𝑓𝑖𝑙𝑚][])] −[𝑒𝑥𝑝(−] 𝐹𝑗𝑛,𝑘𝑅𝑓𝑖𝑙𝑚])]] [M16] and 𝛼𝑐,2𝐹 𝑅𝑇 [[][𝜙][1][ −𝜙][2][ −𝑈][2][ −] 𝑗𝑛,2 = 𝑖0,2 𝐹 [[[𝑒𝑥𝑝(] 𝛼𝑎,2𝐹 𝑅𝑇 [[][𝜙][1][ −𝜙][2][ −𝑈][2][ −𝐹𝑗][𝑛,2][𝑅][𝑓𝑖𝑙𝑚][])] −[𝑒𝑥𝑝(−]",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 594
    },
    {
      "text": "𝑅𝑇 [[][𝜙][1][ −𝜙][2][ −𝑈][2][ −𝐹𝑗][𝑛,2][𝑅][𝑓𝑖𝑙𝑚][])] −[𝑒𝑥𝑝(−] 𝐹𝑗𝑛,𝑘𝑅𝑓𝑖𝑙𝑚])]] [M17] where 𝑗𝑛,1 and 𝑗𝑛,2 correspond to the rates of Li intercalation and Li deposition reactions.\nThe normal component of the current density is related to the pore wall flux by 𝑖𝑛 = 𝐹𝑗𝑛.\nThe open circuit potential 𝑈2 is equal to zero in this work because the potential is measured with\nrespect to a Li metal reference electrode in solution at the same local electrolyte concentration. The interplay between the Li insertion reaction and the Li deposition reaction is governed by each\nset of kinetic parameters, resulting in the following equations governing the exchange current\ndensities: 𝑖0,1 = 𝐹(𝑘𝑎,1)𝛼𝑐,1(𝑘𝑐,1)𝛼𝑎,1(𝑐10 −𝑐1)𝛼𝑎,1(𝑐1)𝛼𝑐,1(𝑐2)𝛼𝑎,1 [M18] 𝛼𝑐,1(𝑘𝑐,1) 𝛼𝑎,1(𝑐1 𝑖0,1 = 𝐹(𝑘𝑎,1)𝛼𝑐,1(𝑘𝑐,1)𝛼𝑎,1(𝑐10 −𝑐1)𝛼𝑎,1(𝑐1)𝛼𝑐,1(𝑐2)𝛼𝑎,1 [M18] 𝑖0,2 = 𝐹(𝑘𝑎,2)𝛼𝑐,2(𝑘𝑐,2)𝛼𝑎,2(𝑐2)𝛼𝑎,2 [M19] 𝑖0,2 = 𝐹(𝑘𝑎,2)𝛼𝑐,2(𝑘𝑐,2)𝛼𝑎,2(𝑐2)𝛼𝑎,2 [M19]",
      "page_num": 12,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 577
    },
    {
      "text": "𝑖0,2 = 𝐹(𝑘𝑎,2)𝛼𝑐,2(𝑘𝑐,2)𝛼𝑎,2(𝑐2)𝛼𝑎,2 [M19] where 𝑖0,1 is the exchange current density for the insertion reaction and 𝑖0,2 is the exchange\ncurrent density for the Li deposition reaction. Considering a volumetric change due to Li\ndeposition at the particle level, the exchange current density for the Li deposition reaction\nis directly related to the growth rate of a Li film on the particle surface: 𝜕𝛿𝑓𝑖𝑙𝑚 𝑖𝑛,2𝑀 𝛼𝑐,2(𝑘𝑐,2) = −\n𝜕𝑡 𝑖𝑛,2𝑀 [M20]\n𝜌𝐹 where 𝛿𝑓𝑖𝑙𝑚 is the film thickness composed of solid Li and other products and 𝑀 and 𝜌 are\nthe molecular weight and density of Li and products. Tang [[92]] observed that Li deposition occurs preferentially at the edges of the\nelectrodes and that extending the negative electrode past the edge of the positive electrode",
      "page_num": 12,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 293
    },
    {
      "text": "12 can hamper this method of Li plating. A simplified mathematical model was used to\nsimulate this behavior and probe the conditions under which this deposition occurs. This\nwork is a critical extension of the traditional porous electrode model and considered edge\neffects in the electrodes. Through this work, it was determined that the extension of the\nnegative electrode beyond the edge of the positive electrode provides the excess capacity\nat the critical location and prevents the Li plating from occurring. Tang [[92]] assumed small\ncurrents and linearized the Bulter-Volmer expression: 𝑖2 = 𝑖0 𝐹 [𝜂 ] [M21] 𝑖2 = 𝑖0 𝑅𝑇𝐹 [𝜂 ] [M21] and considered the exchange current density, 𝑖0, as a function of concentration of Li in the solid\nphase and electrolyte: 𝑖0 = 𝐹𝑘(𝑐10 −𝑐1)𝛼𝑎(𝑐1)𝛼𝑐(𝑐2)𝛼𝑎 [M22] 𝑖0 = 𝐹𝑘(𝑐10 −𝑐1)𝛼𝑎(𝑐1)𝛼𝑐(𝑐2)𝛼𝑎 [M22] Although a galvanostatic charge means that the total current applied to the electrode is\nconstant with time, the current density along the electrode is non-uniform. This means that\na constraint of the system is an integral boundary and is defined as ∮electrode 𝑖𝑛𝑑𝑠= 𝐼𝑠𝑒𝑡𝑙+ [M23] where 𝑙+ is the length of the positive electrode, and 𝐼𝑠𝑒𝑡 is the average applied current\ndensity in amperes per meter squared, determined by diving the theoretical capacity of the\npositive electrode by the time of charge 𝐼𝑠𝑒𝑡 = 𝐹 𝐶+𝜌+𝑤+Δ𝑦 [M24] 𝐶+𝜌+𝑤+Δ𝑦 + + 𝑦 [M24] 𝑡𝑐ℎ𝑎𝑟𝑔𝑒",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 519
    },
    {
      "text": "𝑡𝑐ℎ𝑎𝑟𝑔𝑒 Other groups [[33, 93, 94]] have proposed using two different Butler-Volmer equations\nto build on the work of Arora [[57]] and White, many of which assume that the open circuit\nvoltage of the Li plating reaction is zero, even though it is known that Li deposits prior to\n0V vs. a Li reference electrode [[95-103]] .\nRen [[93]] and colleagues proposed separate kinetics equations for Li plating and Li\nstripping, with the Li stripping reaction having the same kinetics as the Li plating reaction.\nWhen the overpotential is less than 0, Li plating will occur governed by Eq. M25 𝑗𝑛,2 = 𝑖0,2 [[𝑒𝑥𝑝(] 𝛼𝑎,2𝐹𝜂𝐿𝑖) −𝑒𝑥𝑝(− 𝛼𝑐,2𝐹𝜂𝐿𝑖 ~~)~~ ] [M25] 𝑖0,2 𝛼𝑎,2𝐹𝜂𝐿𝑖 𝑗𝑛,2 = 0,2𝐹 [[𝑒𝑥𝑝(] 𝑎,2𝑅𝑇 𝐿𝑖) −𝑒𝑥𝑝(− 𝑐,2𝑅𝑇 𝐿𝑖 ~~)~~ ] [M25] When the overpotential is greater than 0 and some quantity of Li that can be removed is\npresent, Li stripping will occur governed by Eq. [M26] 𝑗𝑛,3 = 𝑖0,2 [[𝑒𝑥𝑝(] 𝛼𝑎,2𝐹𝜂𝐿𝑖) −𝑒𝑥𝑝(− 𝛼𝑐,2𝐹𝜂𝐿𝑖 ~~)~~ ] 𝛽𝑛𝐿𝑖,𝑟𝑒𝑣 [M26] 𝐹 [[𝑒𝑥𝑝(] 𝐿𝑖) −𝑒𝑥𝑝(− 𝑅𝑇 𝛼𝑐,2𝐹𝜂𝐿𝑖 𝑖0,2 𝛼𝑎,2𝐹𝜂𝐿𝑖 𝐹 [[𝑒𝑥𝑝(]",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 595
    },
    {
      "text": "𝐹 [[𝑒𝑥𝑝(] 𝐿𝑖) −𝑒𝑥𝑝(− 𝑅𝑇 𝛼𝑐,2𝐹𝜂𝐿𝑖 𝐿𝑖 ~~)~~ ] 𝑅𝑇 𝛽𝑛𝐿𝑖,𝑟𝑒𝑣 [M26]\n1+𝛽𝑛𝐿𝑖,𝑟𝑒𝑣 In Eq. M26, 𝛽𝑛𝐿𝑖,𝑟𝑒𝑣 [is a correction term limiting the reaction to the amount of reversible ]\n1+𝛽𝑛𝐿𝑖,𝑟𝑒𝑣 Li. 𝛽 is a large value, set to 1000 in Ref. [[93]], such that the correction term is equal to 1",
      "page_num": 13,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 222
    },
    {
      "text": "13 when a significant amount of plated Li is present, and 0 when 𝑛𝐿𝑖,𝑟𝑒𝑣 = 0. In both Eq. M25\nand Eq. M26 𝑖0,2 = 𝐹𝑘2(𝑐2) [𝛼][𝑎,2] [M27] and 𝜂𝐿𝑖 is consistent with Eq. M15. More recently, Baker and Verbrugge have developed a Multi-Species, MultiReaction (MSMR) Model [[104-108]] for porous intercalation electrodes that has been applied\nto plating and dissolution of Li in a Li ion cell [[108]] . In the latter work, a set of equations was\nderived to describe the overcharge of a Li ion cell. Two critical additions to published\nmodels were added to address Li plating. First, the handling of Li deposition and\ndissolution electrochemical reactions was addressed. Secondly, the plated Li in system can\ndirectly interact with the vacant sites in the anode, which will impact the system response.\nBy including these theoretical developments with the MSMR model, the authors were able\nto illustrate Li intercalation and plating within a single particle model. One critical\nobservation regarding the thermodynamics of the Li plating reactions shows that the open\ncircuit voltage of the plating reaction with respect to a Li reference cannot be zero, as\ncommonly assumed. Rather, it is only zero when the surface coverage of plated Li is large\nenough for the Li to interact with the electrolyte in the same manner as a bulk metallic Li\nelectrode. Consequentially, when small surface coverages of Li on the surface of the anode\nparticles exists, the plated Li interacts with the anode active material, resulting the OCV of\nthe plated Li being positive, which the authors detail in Eq. 11 in Ref. [[108]] . This provides\nan update to the historical assumption of Li deposition at 0V vs a Li reference.\nIn the Multi-Species, Multi-Reaction (MSMR) Model [[104-108]] a few parameters can\nbe associated with the physical chemistry of the intercalation material enabling a\nquantitative fit of the open-circuit potential. In this model, different galleries of intercalated\nLi are assumed to be in thermodynamic equilibrium, so that their open circuit potentials\nare equal to some common equilibrium potential of the intercalation material. For each\ngallery 𝑗 𝜔𝑗 𝐹 [ln (] 𝑋𝑗−𝑥𝑗 [M28] 𝑥𝑗 ~~[)]~~ 𝑈1 = 𝑈𝑗0 + 𝑅𝑇",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 595
    },
    {
      "text": "𝑈1 = 𝑈𝑗0 + 𝑅𝑇 0 + 𝑅𝑇 𝑥𝑗 = 𝐹\n𝑅𝑇 [(𝑈1−𝑈] 𝑗 𝑋𝑗 , 𝑥(𝑈1) = ∑𝑥𝑗 [M29] 1+𝑒𝑥𝑝 ~~[~~ ]\n𝜔𝑗 0) 0)/𝜔𝑗] 𝑑𝑥 𝑛 𝐹 𝑗=1 𝑑𝑈1 [= −∑] 𝑅𝑇 𝑑𝑥 𝑛𝑗=1 𝑅𝑇 𝜔𝑗 (1+𝑒𝑥𝑝[𝑗 𝑅𝑇 [𝐹] [(𝑈][1][1][−𝑈][𝑗][𝑗] 0)/𝜔𝑗𝑗]) [M30] 𝑋𝑗𝑒𝑥𝑝[ [𝐹] 𝑅𝑇 [(𝑈][1][−𝑈][𝑗] [𝐹] 𝑅𝑇 [(𝑈][1][−𝑈][𝑗] 𝑅𝑇 1 𝜔𝑗 (1+𝑒𝑥𝑝[ [𝐹] −β𝐹 𝑅𝑇 ~~[𝜂]~~ [𝑠] ], 𝑗1 = ∑𝑖𝑠,𝑗 [M31] 𝑖𝑠,𝑗 = 𝑖0,𝑗 [𝑒 (1−β)𝐹 𝑅𝑇 ~~𝜂~~ 𝑠 −𝑒 𝜂𝑠 = 𝜙1 −𝜙2 −𝑈1(𝑥) [M32] 2 0 ~~[)]~~ 𝜔𝑗𝛽𝑗 (𝑋𝑗 −𝑥𝑗) 𝜔𝑗(1−𝛽𝑗)\n( 𝑐2\n𝑐02 1−𝛽𝑗 [M33] 𝑟𝑒𝑓 𝑖0,𝑗 = 𝑖0,𝑗 (𝑥𝑗) 𝑟𝑒𝑓\n(𝑥𝑗)",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "14 where 𝑈1 is the open circuit voltage of the intercalation reaction, 𝜔𝑗 is a thermodynamic\nparameter fit to the open circuit voltage, 𝑋𝑗 is the maximum mole fraction of species 𝑗, 𝑥𝑗\nis the mole fraction of Li in the solid phase, and 𝛽𝑗 is the symmetry factor for the 𝑗th\nintercalation reaction. The kinetics for the intercalation reaction are then governed by Eq.\nM31, a modification of Eq. M12 using the symmetry factor 𝛽𝑗.\nThe kinetics of the Li plating reaction are then given by −βLi𝐹 𝑅𝑇 ~~[𝜂]~~ [𝑠] ] [M34] 𝑗2 = 𝑖0,𝐿𝑖 [𝑒 where (1−βLi)𝐹 𝑅𝑇 ~~𝜂~~ 𝑠 −𝑒 1−𝛽𝐿𝑖 [M35] 0 [)] 𝑟𝑒𝑓 𝛽 0,𝑗 𝑎𝐿𝑖 𝑐2\n𝑐20 𝑖0,𝐿𝑖 = 𝑖0,𝑗 𝛽𝐿𝑖 ( where 𝑎𝐿𝑖 is the activity coefficient of Li and is related to the Li surface concentration and\nis defined as 𝑎𝐿𝑖 = 1 −𝑒 [−Θ] [M36] where Θ corresponds to the ratio of the concentration of surface Li compared to a reference\nvalue. Combining Eq. M34 – M36 and replacing Θ with 𝑈2, the open circuit voltage of the\nplating reaction yields a kinetics expression that is a function of potentials, electrolyte\nconcentration, and thermodynamic properties: 𝐹\n𝑅𝑇 ~~[(]~~ [−𝛽][𝐿𝑖][)(𝜙][1][−𝜙][2][)] ] [M37] 𝑐2\n𝑐20 1−𝛽𝐿𝑖 - 𝐹 [𝑒 𝑅𝑇 𝑟𝑒𝑓 𝑗2 = 𝑖0,𝐿𝑖 ( 𝐹\n𝑅𝑇 ~~[(]~~ [1−𝛽][𝐿𝑖][)(𝜙][1][−𝜙][2][)] −𝑒 0 ~~[)]~~ 𝑅𝑇 ~~[𝑈]~~ [2] 𝑒",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 600
    },
    {
      "text": "𝑅𝑇 ~~[𝑈]~~ [2] 𝑒 This treatment removes the need for a correction term as seen in Eq. M36 which must be\narbitrarily set.\nElectrochemical modeling techniques are all based on a set of highly non-linear\nequations that describe the transport phenomena and electrochemical physics within the\nbattery. While Thevenin [[109-123]] models or electrochemical impedance spectroscopy\nmodels [[124-127]] (EIS) are popular for fast predictions for electrical performance, they do not\nenable the user to couple the Li plating physics necessary for analysis. Retaining aspects\nof the porous electrode model is necessary for Li plating simulation. In order to speed up\nsolution times, many different approximations have been made to simplify the equations\nand associated solutions depending on the accuracy and speed necessary in a given\napplication.\nThe prevailing approach for increasing speed for electrochemical models without\nsacrificing accuracy is to use various mathematical techniques to speed up the solution time\nfor the partial differential equations, or to convert the partial differential equations into a\nform that can be integrated faster through the use of numerical solvers. Subramanian [[128-] 132] developed various reduction methods that enabled real-time simulations. White has\napplied various methods such as orthogonal decomposition [[133]], state-space\nreformulation [[134, 135]], reducing the system of partial differential equations to ordinary\ndifferential equations [[135, 136]], and applying polynomial representations of the Li ion",
      "page_num": 15,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 317
    },
    {
      "text": "15 concentration in the solid phase [[137]] . In recent years, the popularity of these models [[138-149]]\nhas increased due to their relative speed and accuracy.\nDue to the development of fast and accurate reduced order models, the potential\nexists for real time Li plating estimation within a micro-controller. Zhao [[150]] utilized a\nreduced order model [[151-153]] to consider Li plating evolution. In this work, the ion\nconcentration in the electrode was reduced using a polynomial approach, the ion\nconcentration in the electrolyte was reduced using the state-space approach, and the\nelectrochemical kinetics (i.e. Butler Volmer Equation) was linearized. Similar to previous\napproaches, the overall electrochemical reaction was split between the Li intercalation and\nLi deposition reactions 𝑗𝑡𝑜𝑡𝑎𝑙𝐿𝑖 = 𝑗 [𝐿𝑖] + 𝑗𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 [M38] 𝑗𝑡𝑜𝑡𝑎𝑙𝐿𝑖 = 𝑗 [𝐿𝑖] + 𝑗𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 [M38] 𝑗𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 = 𝑎𝑠𝑖0,𝑝 [𝑒𝑥𝑝 ~~(~~ 𝛼𝑎,𝑝𝐹𝜂𝑝) −𝑒𝑥𝑝(− 𝛼𝑐,𝑝𝐹𝜂𝐿𝑖 ~~)~~ ] [M39] 𝑡𝑜𝑡𝑎𝑙𝐿𝑖 = 𝑗 [𝐿𝑖] + 𝑗𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 𝛼𝑎,𝑝𝐹𝜂𝑝 𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 = 𝑎𝑠𝑖0,𝑝 [𝑒𝑥𝑝 ~~(~~ ) −𝑒𝑥𝑝(−\n𝑅𝑇",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 583
    },
    {
      "text": ") −𝑒𝑥𝑝(−\n𝑅𝑇 𝑗𝑝𝑙𝑎𝑡𝑖𝑛𝑔𝐿𝑖 = 𝑎𝑠𝑖0,𝑝 [𝑒𝑥𝑝 ~~(~~ 𝑎,𝑝 𝑝) −𝑒𝑥𝑝(− 𝑐,𝑝 𝐿𝑖 ~~)~~ ] [M39] 𝑅𝑇 𝑅𝑇 where 𝑖0,𝑝 is the exchange current density of the Li deposition reaction and was fit as a\nfunction of temperature, 𝛼𝑎,𝑝 and 𝛼𝑐,𝑝 are the dimensionless anodic and cathodic charge\ntransfer coefficients and were assumed to be 0.33 and 0.67 respectively, due to the\nassumption of semi-reversibility with the Li deposition reaction. 𝜂𝑝 was calculated\nsimilarly to Eq. M15. The authors calculated the Li plating reaction rate (Figure 3d in Ref. [150]) and illustrate the increase in plating rate at lower temperatures, consistent with\nexperimental studies. [[45, 63, 93, 154-158]] Choe has applied this reduced order model to\ninvestigate degradation with the intent of mitigating aging and Li plating due to fast\ncharging. [[140, 150-152, 159-163]] This type of approach could be utilized in a battery management\nsystem or charge controller to avoid Li plating completely, or to allow for a quantifiable\namount of Li plating that could be electrochemically removed later. Various research groups have approached integration of a full order model or\nreduced order model into a micro-controller. Perkins [[58]] developed a control-oriented cell\ndegradation model by deriving a reduced-order model for the Li plating deposition reaction\noccurring on overcharge. This work illustrated the differences in accuracy between a fullorder model and the reduced order model, while allowing for a 5000x increase in solver\nspeed, illustrating the theoretical capability of loading a ROM onto a micro-controller.",
      "page_num": 16,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 485
    },
    {
      "text": "Various research groups have approached integration of a full order model or\nreduced order model into a micro-controller. Perkins [[58]] developed a control-oriented cell\ndegradation model by deriving a reduced-order model for the Li plating deposition reaction\noccurring on overcharge. This work illustrated the differences in accuracy between a fullorder model and the reduced order model, while allowing for a 5000x increase in solver\nspeed, illustrating the theoretical capability of loading a ROM onto a micro-controller. Florentino [[164]] extended Perkin’s work and explored the use of controllers for\nmanaging battery cell performance using reduced order electrochemical models. In this\nwork, model predictive control was utilized as a smart sensor and applied to a balancing\narchitecture. As a smart sensor, the model predictive controller is transparent during the\noperation of a cell, provided that the cell does not enter into a state that would result in\naging or Li plating. Once a condition is detected that would result in the cell being prone\nto Li plating, the model predictive controller intervenes and ensures that the cell does not\nenter said state. Subramanian [[129, 131, 132, 165-171]] has spent decades focused on modeling methods, and\nhas more recently focused on reformulating [[129, 131, 132, 169]] models for increased\ncomputational efficiency, developing battery management systems [[168, 171]] using physics\nbased reformulated models, and applying nonlinear model predictive control [[170, 171]] to Li 𝛼𝑐,𝑝𝐹𝜂𝐿𝑖",
      "page_num": 16,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 337
    },
    {
      "text": "16 ion batteries. Subramanian’s work has illustrated the tradeoff between computational\ncomplexity and accuracy, the need for reduced order models in production in both the\nautomotive and grid storage space, and has provided ample proof that physics based models\nare the next step in bridging the gap between scientific understanding of aging phenomena\nand the tools that are used for controls every day. Real-Time Estimation of Li-Ion Concentration in Both Electrodes of a Li-Ion Battery Cell To detect Li plating, the first adopted approach was based on two-electrode\nmodels [[172]] where the Li-ions transport rates in and out of the electrodes were used as\nindicators of the same. However, the approach doesn’t estimate the accurate Li-ion\nconcentration. This limitation was overcome by using the extended model and cascaded\nobservers. [[173]] Dey _et al_ [[175]] expressed the insertion and extraction rates of the Li-ions as 𝜕𝐶𝑃𝑎𝑣𝑔 𝜕𝐶𝑁𝑎𝑣𝑔 𝐸𝑃 = ~~|~~ 𝑎𝑣𝑔 ~~|~~, 𝐼𝑁 = ~~|~~ 𝑎𝑣𝑔 ~~|~~ [R1] 𝜕𝑡 𝜕𝑡 where 𝐸𝑃and 𝐼𝑁are the Li-ion extraction rate from positive electrode and insertion rate into\nnegative electrode, 𝐶𝑃𝑎𝑣𝑔 and 𝐶𝑁𝑎𝑣𝑔 are the volume-averaged Li-ion concentrations in the\npositive and the negative electrodes, respectively, and given as 𝐸𝑃 = ~~|~~ ~~|~~, 𝐼𝑁 = ~~|~~\n𝜕𝑡 ~~4~~ 1 [∫] 0𝑅+ 4𝜋𝑟 [2] 𝐶𝑠+\n3 ~~[𝜋]~~ [𝑅][+3] 𝐶𝑃𝑎𝑣𝑔 = 0𝑅+ 4𝜋𝑟 [2] 𝐶𝑠+ (𝑟, 𝑡)𝑑𝑟 [R2] 𝐶𝑁𝑎𝑣𝑔 = 1 𝑅−\n~~4~~ 0 4𝜋 [2] 𝐶𝑠\n3 ~~[𝜋]~~ [(𝑅)][−3] [ ∫]",
      "page_num": 17,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 581
    },
    {
      "text": "1 𝑅−\n~~4~~ 0 4𝜋 [2] 𝐶𝑠\n3 ~~[𝜋]~~ [(𝑅)][−3] [ ∫] 0𝑅− 4𝜋 [2] 𝐶𝑠−(𝑟, 𝑡)𝑑𝑟 [R3] Li plating is detected when the extraction rate 𝐸𝑃 exceeds the maximum possible extraction\nrate (𝐸𝑃,𝑚𝑎𝑥 ) and 𝐼𝑁 drops below the minimum possible insertion rate (𝐼𝑁,𝑚𝑖𝑛 ). Their\nrecommend ways to collect 𝐸𝑃 and 𝐼𝑁 data are: (1) Monte Carlo simulation studies on the\nbattery model on varying different operating conditions, different levels of measurement\nnoise, and different levels of modeling uncertainties or (2) experimental studies on a\nphysical battery under different operating conditions [[8, 43]] . Then, choose the maximum and\nminimum of 𝐸𝑃 and 𝐼𝑁 as the limits. State and Capacity Estimation were performed for\nconstant current and dynamic discharge conditions. The capacity fade is simulated by\nadding a side reaction current component into the plant-model. The simulation scenario used for this case study is C/10 charging at ambient\ntemperature, 20°C. To illustrate the Li plating condition in simulation scenario a step like\nadditive C/5 charging input current component was used to the positive electrode of the\nplant-model. This additive input current causes a sudden change in current density in the\npositive electrode, while the current density in the negative electrode is kept constant. This\nessentially represents a loss in active Li-ions, as the Li-ion extraction rate from the positive\nelectrode would be higher than the insertion rate in the negative electrode. In this case study,\nthe positive electrode current density increases at t = 600 s. Using this approach, the bulk\nSOC could be tracked even after the occurrence of the plating. Dey _et al_ l also studied the effect of measurement noise via simulation by using\ndifferent noise levels in the all three measurements (voltage, temperature, and current). It",
      "page_num": 17,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 491
    },
    {
      "text": "17 is found that the scheme generates reasonable estimates approximately up to 25mV voltage\nmeasurement noise and 50mA current measurement noise. Above those ranges, the steadystate estimation error goes significantly higher reducing the effectiveness of the scheme.\nOther than measurement noise, measurement bias was also considered. For voltage and\ncurrent measurements, the scheme performs satisfactorily up to 5mV and 12mA\nmeasurement bias. Beyond these values, the performance of the scheme degrades. Above\n0.5 °C noise level in the temperature measurement, the estimates tend to diverge after a\ncertain point when the signal-to-noise ratio gets smaller. The simulation results are yet to\nbe correlated with the experimental measurement. Electrochemical Impedance Spectroscopy Li-ion battery comprises of a series of multiple processes including Li-ion diffusion\nin the electrolyte, migration through the SEI layer, charge transfer through the\nelectrode/electrolyte interface, solid-state diffusion in the bulk of active material and\nelectron transfer external to the battery via the current collectors [[39, 40, 174]] . These processes\nintroduce impedance to the charge flow and cause a voltage drop between the two\nelectrodes. Electrochemical Impedance Spectroscopy (EIS) is an efficient tool to identify\nthese processes since each of them has a different time constant or frequency range of\nexcitation. [[36, 175]]",
      "page_num": 18,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 296
    },
    {
      "text": "In a recent publication, from Koleti _et al_ studied the impedance analysis on a\ncommercially available 18650-type Li-ion cells with a rated capacity of 3.1Ah [[175]] . EIS is\nshown in Figure 4a. in which the high-frequency region (761 Hz) is caused by the ionic\nconduction through the electrolyte and electronic conduction through the current collectors\nwhose impedances are represented by ZEL and ZΩ respectively. In the mid-frequency region,\ncharge transfer limitations (CTL) are caused by the electrode-electrolyte interfaces, ZCTL\nand the ion migration through the SEI layer, ZSEI. The low-frequency part is usually\ncharacterized by a 45 ° slope, arising from the solid diffusion limitations (SDL) in the\nelectrodes. Figure 4b. shows the equivalent circuit of a Li-ion battery. In figure 4b, the\nimpedance due to solid diffusion limitations are referred to as ZSDL,NE or ZSDL,PE, and the\ncorresponding electrode surface potential is represented by VNE,S or VPE,S; NE and PE\nstands for negative and positive electrodes, respectively. Figure 4c shows the EIS plots of\nthe same cell at different SOC levels. As it can be observed [[39, 40, 175, 176]], during\ncharge/discharge, impedance in the mid-frequency range varies with SOC. Both ZCTL and\nZSEI contribute to this range. As no significant change in the SEI layer thickness is expected\nin a single charge/discharge cycle [[177, 178]] the mid-frequency impedance variations can be\nattributed largely to the ZCTL. The electrochemical models that describes the CTL through\nthe Butler-Volmer equation [[21, 155, 179, 180]] also support this rationale. At low and high and\nhigh lithiation levels (0% and 100%), ZCTL is high and reduces as the lithiation level moves\ntowards 50%. Therefore, the impedance changes in the mid-frequency region comes\nmainly from the ZCTL and tracking the battery impedance should indicate the way ZCTL is\nchanging while the battery is being charged or discharged. The impedance measured at the\ntransition frequency (referred as ftr which is marked with “*” in Figure 4c) at which\nimpedance changes to 45° slope allows quantifying the total impedance from both the high\nand the mid-frequency regions. Since the impedance from the high-frequency region is\nnearly constant (as seen from Figure 4c), tracking the transition frequency impedance\n(referred as ZTR) allows tracking the impedance from the charge transfer limitations, ZCTL).",
      "page_num": 18,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "18 𝑍𝑇𝑅= 𝑍Ω + 𝑍𝑆𝐸𝐼 + 𝑍𝐸𝑙 [E 1] Where Z  = Z  1 + Z  2 and ZCTL = ZCTL,NE + ZCTL,PE Here, ZΩ1 _and_ ZΩ2 are Ohmic resistances at the NE and PE respectively; ZCTL _,_ NE\nand ZCTL, _P_ E are impedance due to charge transfer limitations at negative and positive\nelectrodes, respectively. Figure 4d presents the ZTR profile against the battery SOC where\nZTR drops initially as battery SOC raises from 0% and reaches a near flat level in the mid Figure 4: Battery Impedance (a) EIS plot at 50% SOC (b) Equivalent electrical\ncircuit diagram representation of the battery impedance (c) EIS plots at different SOC\nlevels and (d) Impedance and resistance at the transition frequency, ftr. Reprinted from\nU.R. Koleti _et al., Journal of Power Sources_ **451**, 227798 (2020). Copyright (2020) with permission from Elsevier.\nThe method to track the ZTR and thus ZCTL while charging/ discharging is similar\nto the hybrid pulse power characterization (HPPC) test often used in developing equivalent\ncircuit models [[181-184]] . Charge current is interrupted every 1% SOC increase for a\npredefined time period. The step-change in the current and the associated voltage change\nduring the interruption is used to calculate the real part of ZTR (referred as RTR) based on\nOhms law. As seen from Figure 4c, the imaginary part of the impedance is significantly\nlower than the resistive part (RTR) irrespective of the SOC level. RTR is found to be within\n1% of the total value of ZTR irrespective of the SOC level. Therefore, variations in ZTR\ncan be tracked using the calculated RTR value. To identify the charge interruption time\nperiod, as discussed within Ref. [[175]] the time constant (τ) of an equivalent RC network that",
      "page_num": 19,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 475
    },
    {
      "text": "19 produces the semi-circle in the mid-frequency region can be used. The value of τ is\ncalculated with the frequency (referred as fmax which is marked with circles in Figure 4c)\nat which the imaginary part of the impedance attains a maximum level in the mid-frequency\nregion using τ = (2π _fmax_ ) [-1] . An interruption time of 2τ s shall recover the voltage drop due\nto the RC network by 87% of the maximum value. While charging at low C-rates or during high ambient temperatures, differences\nbetween the lithiation levels of the electrode surface and the bulk are known to reduce [[21-]",
      "page_num": 20,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 140
    },
    {
      "text": "While charging at low C-rates or during high ambient temperatures, differences\nbetween the lithiation levels of the electrode surface and the bulk are known to reduce [[21-] 23, 155, 179] due to the improved diffusion in the electrodes,. Therefore, charging conditions\nthat allow lithiation levels closer to their average can produce a ZTR profile similar to\nFigure 4d where the lithiation differences in the electrode particles are deemed to be\nnegligible. Conversely, at high C-rates of charging or at low temperatures, the lithiation\nincrease on negative electrode because of reduced solid diffusion. Therefore, at high Crates ZCTL decreases at a lower SOC level compared to charging at low C-rates or high\ntemperatures. With further charging, lithiation tends to increase towards a full lithiation\nlevel, as the negative electrode voltage comes closer to Li reference potential much before\nthe battery reaches 100% SOC. Besides, the potential drop due to charge transfer\nlimitations increases with increasing C-rate or decreasing temperature. The negative\nelectrode potential can fall below the Li reference where Li plating commences. Once Li\nplating begins, electrode lithiation rise and ZCTL decreases since the charging current is\nnow divided into intercalating current and Li plating current. Additionally, as discussed\nwithin Ref. [[93]] and [[33]], the Li plating reaction at the NE also follows the Butler-Volmer\nequation that introduces a new branch of impedance in parallel to the existing ZCTL,NE.\nSimilar to intercalating current that faces ZCTL,NE, Li plating current faces an impedance\nreferred here as ZCTL,Li. As a result, the overall impedance at the NE drops after the onset\nof Li plating. On this basis, tracking the ZTR will allow detecting the onset of Li plating\nduring the charge event. In the case of a charging event without Li plating, ZTR follows\nthe curve from Figure 4d where it faces continuously decreasing reduction at lower SOC\nlevels to reach a near flat level in the mid-SOC range and then accelerate as SOC rises\ntowards 100%. In the case of a charging event with Li plating, ZTR faces a second\ndowntrend after the onset of Li plating because of the introduction of parallel impedance\n(ZCTL,li) across the existing ZCTL,NE. Detecting this second downward trend by tracking the\nZTR shall, therefore, indicate the onset of Li plating. Figure 5 shows ZTR as a function of\nrate for test temperature of 20°C.",
      "page_num": 20,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 541
    },
    {
      "text": "20 Figure 5. ZTR profiles without thermal cooling (a) ZTR profiles at different Crates and (b) temperature profiles measured on the cell surface. Reprinted from U.R. Koleti _et al., Journal of Power Sources_ **451**, 227798 (2020). Copyright (2020) with permission from Elsevier. Three test cases are considered, A, B and C representing test temperatures of 10,\n20 and 30°C with active cooling and tested with the charge C-rates 0.2C, 0.5C, 0.75C, 1C,\n1.25C. The EIS plots at different SOCs (Figure. 4b) and ZTR profiles in test cases A, B\nand C are taken at constant ambient temperatures in which impedances from Ohmic, SEI\nlayer and electrolyte are assumed to remain constant. However, in practical applications,\ntemperature rise during a charging event is inevitable which can increase the Ohmic",
      "page_num": 21,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 209
    },
    {
      "text": "21 resistance and decrease the impedances due to electrolyte, CTL and SEI layer. [[36, 40, 54, 175, ] 182] Tracking the ZCTL and thus detecting Li plating may, therefore, become difficult in such\ncases. To track the ZTR under the scenarios of minimal cooling, the cells from test case D\nare charged in a large room maintained at 20 ± 2 ° C, but with no active thermal\nmanagement. In each charge event, different C-rates are applied with pulse interruption\nprocedure starting from 0.2C to 1.25C. Figures 5a and 5b shows the ZTR profiles and cell\nsurface temperature variations on a cell at different charging C-rates. The ZTR profile at\n0.2C where the temperature rise is within +1 ° C is similar to the one observed with active\ncooling. With the increase of C-rate, the effect of Li plating on ZTR profiles is clearly\nobserved even with a temperature rise higher than 8 ° C for charge rates  1C. The ability\nto detect Li plating using the ZTR profiles while temperature is also changing can be\nexplained as follows. As seen from the inset plot in Figure 5b for 1C charge rate, the\nmajority of the temperature rise (circa 5 ° C rise of the total 8.2 ° C) occurred during the\nfirst 10 min of the charging process and then the rate of temperature increase is reduced to\ncirca 3.2 ° C rise over the next 39 min. The authors ascribed the applicability of EIS method\nfor Li plating under minimal cooling as follows: since Li plating typically occurs towards\nthe end of CC charging where temperature changes are not assumed to be significant,\ntemperature influence on the internal processes may be limited. Therefore, for the selected\ncell type and C-rates, Li-plating detection using the ZTR profiles is possible even under\nenvironmental conditions where temperature is increased during the charge process. Cell Thickness Measurement",
      "page_num": 22,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 436
    },
    {
      "text": "Cell Thickness Measurement Bitzer and Grule [[36]] successfully employed cell thickness measurement to detect\nLi plating. It is based on the concept of anode (and cell) volume expansion. During the LiB\ncharge/discharge process, the active materials vary in volume, depending on the degree of\nLi-ion intercalation. Graphite anodes, for example, gain about 10% in volume while\nchanging from the de-lithiated elementary state to fully lithiated LiC6 [[185]] . On the other\nhand, the cathode materials have a much smaller dilatation coefficient, for example, it is\nabout 1% for NMC [[186]] . Therefore, generally the thickness of LiB is governed by the anode\nvolume change. One exception is Li titanate anode (LTO), which has a negligible volume\nchange of only 0.1% - 0.3% [[186, 187]] . During charging, Li occupies the interstitials into the\ngraphite lattice. Hence, the volume of the intercalation compound is smaller than the\nvolume of the two separate materials. Li plating on the anode surface instead of\nintercalating into the anode leads to an additional gain in the overall volume. On the\ncontrary, the de-intercalation from the cathode has no significant effect on the cell\nthickness. For 1 Ah of charge from the cathode to the anode, the amount of Li transferred\nis: 𝑛𝐿𝑖(1𝐴ℎ) = 𝐶 [C 1]\n𝑒.𝑁𝐴 [ = 37.31 𝑚𝑚𝑜𝑙] nLi: amount of Li substance [mol], NA: Avogadro constant [1/mol], e: elementary charge [As]; C: transferred charge [As]. When the anode is fully charged, every six carbon atoms\nof graphite takes one Li atom. Thus for 1 Ah of charge an amount of 6.nLi = 223.9 × 10 [-3]\nmol of carbon is consumed. With the molar volume of carbon in hexagonal structure of\n5.31×10 [-6 ] m [3] mol [-1] its volume is 1.189 cm [3] . According to the literature, carbon-based anode",
      "page_num": 22,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 500
    },
    {
      "text": "22 materials expand about 10% due to the intercalation of Li [[185]] . Thereby charging 1 Ah\ncauses a volume change of: △𝑉𝐶(1𝐴ℎ) = 𝛼𝐿𝑖𝐶6. 𝑛𝐿𝑖 (1𝐴ℎ). 6. 𝑉𝑚,𝐶 = 0.12 𝑐𝑚 [3] [C 2]  VC: Change of the carbon volume due to Li intercalation [m [3] ], 𝛼𝐿𝑖𝐶6 coefficient of\nexpansion changing from C to LiC6 =10%, Vm,C: molar volume of carbon [m [3] mol [-1] ]. Given\nthe molar volume of Li is, Vm,Li = 13.02 × 10 [-6] m [3] mol [-1] the volume of Li corresponding to\n1 Ah of charge is 0.49 cm [3] . In the case of Li metal disposition on anode surface, instead of\nintercalation, the resulting expansion equals the volume of the Li in metallic form minus\nthe volume the anode would gain due to the intercalation, as shown in Equation (2). 𝑉𝑒𝑥𝑝(𝐶𝑝𝑙) = 𝐶𝑝𝑙 [C 3]\n𝑒.𝑁𝐴 [ (𝑉][𝑚,𝐿𝑖] [− 𝛼][𝐿𝑖𝐶][6][. 6. 𝑉][𝑚,𝐶][)]",
      "page_num": 23,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 389
    },
    {
      "text": "𝐶𝑝𝑙 [C 3]\n𝑒.𝑁𝐴 [ (𝑉][𝑚,𝐿𝑖] [− 𝛼][𝐿𝑖𝐶][6][. 6. 𝑉][𝑚,𝐶][)] Vm,Li: molar volume of Li [m [3] mol [-1] ], Vm,C: molar volume of carbon [m [3] mol [-1] ]; Cpl: amount\nof plated Li. According to Equation [C3], an amount of 1 Ah of plated Li causes a gain in\nvolume of Vexp (1 Ah) = 0.37 cm [3] . Using this equation, it is possible to calculate the\nthickness of plated Li, knowing the surface area of electrode in the LiB. Thus, accurate\nmeasurement of cell thickness can serve to identify the onset of Li plating. Change of cell\nthickness during standard cycling showed that the volume change due to Li intercalation\ninto graphite takes place in three steps with different slopes which is highly reproducible.\nWhen the battery is charged with high enough high current to cause Li plating, cell\nthickness increase could be observed. If the cell is at rest after plating, part of the plated Li\nintercalates into the graphite, causing some decrease in thickness. However, if excessive\ncurrent is used, then the thickness growth persists indicating irreversible plating. However, there are some practical challenges that affect the measurement accuracy.\nDue to cell inhomogeneity, dendritic deposition and gas evolution, the actual measured\nvalue is expected to be larger. Charging the cell with continuous currents leads to shifts in\nthe  cell thickness vs Ah curve. Similarly, measurement temperature can interfere with\naccuracy. However, at a temperature increase of 1 K at the cell surface the thermal\nexpansion is smaller than the resolution of the dial thickness indicator. In addition to the\ntemperature effect, the measurement point of thickness causes also affects measurement\naccuracy. Due to an existing inhomogeneity within every cell, the position of the\nmeasurement point plays a crucial role. Many pouch cells are known to start plating in a\nnarrow area next to the cell’s margin. When choosing the wrong measurement point, the\nexperiment could therefore fail to detect the onset of Li plating. The best point is always\ncell specific and must be determined prior to the thickness measurements, e.g., by opening\nthe cell. Pouch cells especially have problems arising from Gas evolution originating from\nside reactions which interfere with accurate thickness measurement. Applying pressure on\nthe cell by using appropriate spring can mitigate the problem and reduce the error. It was\nshown that during standard cycling other influences like the cathode expansion,\ntemperature or gas evolution are small.",
      "page_num": 23,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 593
    },
    {
      "text": "23 Optical Detection Methods The most common method to detect Li plating is to open the cell after cycling and\nlook for Li deposit. Generally, the anode from the plated cell is inspected by one or more\nof the following techniques such as optical microscope, SEM, TEM, AFM, XPS, Raman\netc. One challenge with these _ex situ_ techniques is, the plated Li can also intercalate back\ninto the graphite which sometimes makes it challenging to visually observe microscopic Li\nplating. Moreover, this method is conducted ex-situ which can introduce sample\npreparation error. Nevertheless, optical detection methods are effective tools to identify Li\nplating, its morphology and composition. SEM investigations [[188]] enable the analysis of plated Li and dendrites by both _in_\n_situ_ and _ex situ_ . Gireaud _et al_ . [[189]] observed dendrite growth on a Li surface at 20°C in\nLi/Li-coin cells _ex situ_ . Their work showed the influence of the surface structure on the\ndendrite growth. In contrast, Sagane _et al_ . [[188]] analyzed dendrite growth on copper under\nvacuum inside an in-situ SEM cell with a Li/LiPON/LATP/LiPON/Cu-configuration. They\ncorrelated the dendrite size with the applied current density. High current densities led to\nthe formation of many small dendrites; low current densities led to the formation of fewer\nbut larger dendrites. Steiger _et al_ studied the growth of mossy Li by _in situ_ light microscope\nand _ex situ_ SEM. [[190]] They found that the mossy Li form at the grain boundaries by the\ninsertion of Li into defect sites. J. Guo _et al_ studied the effect of VC-LiNO3 additive on Li\nmetal by EIS and _ex situ_ SEM and XPS. [[191]] They constructed a cell with Li and copper\nand used the electrolyte 1M LiPF6 EC/DMC (1/1) as their baseline and studied the effect\nof additives, 2 vol.% VC and 0.1M LiNO3. It was found that the selected additive\ncombination contributes to positive modifications of SEI film on the surface of Li anode\nin carbonate electrolyte system. Nearly 100% efficiency was observed for Li\nplating/stripping in the presence of these additives and a very homogeneous morphology\nof cycled Li were obtained.",
      "page_num": 24,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 529
    },
    {
      "text": "Harris _et al_ used _in situ_ optical microscope detection of Li plating on a full\noperational cell and observed color change of graphite anode as a function of Lithiation. [[8]]\nUhlman _et al_ [[22]] also used an optical test cell-housing to observe the graphite anode _in situ_\nvia confocal microscopy whilst applying current. They used a charging current of 10 C for\nthe test. They observed the color change of graphite with lithiation. Depending on the SOC, the graphite changes its color from black, red, to gold [[22]] .\nThis corresponds to the change of the band structure, due to the variation of the lattice\nspacing. Though this change happened very quickly in this measurement, due to the high\ncharging current, it could be seen within the optical test-cell. After turning golden, which\nindicates the highest Li intercalation stage of graphite, a gray coating starts to cover the\nelectrode. At the beginning of this process some small dots appear on the particles. Within\n1-2 s, the whole observation area is covered by a gray structure which is interpreted as a\nlayer of metallic Li. When observing the frontier between plated and non-plated surface\narea during the relaxation phase, several facts were recognized. On one hand, the plated\narea decreases while the frontier of the two areas moves back. This is due to dissolution of\nplated Li, since due to the decreasing Li surface concentration, intercalation becomes\nfavorable over metallic Li. However, not all Li coverage is removed, a dark deposit remains\non the location of the original plated Li. The golden particles further change their color to\nbrownish-red, indicating that they are not yet fully charged, and hence possess enough",
      "page_num": 24,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 367
    },
    {
      "text": "24 capacity to further intercalate Li. This supports the assumption that the dark deposit\ncorresponds to irreversibly plated Li that will not be intercalated, even after extended\nrelaxation periods. There are two possible explanations for the dark coloration: either the\ndark deposit consists of plated Li that lost electrical contact to the graphite during ongoing\nLi dissolution, or it consists of SEI-remnants of the plated Li on the surface. The exact\norigin cannot be determined, however since both effects lead to irreversible Li loss, both\nare undesirable in commercial cells. A two-electrode cell was used for the optical detection in this work, instead of a\nthree-electrode cell. Measurements have to be done using a reliable reference electrode, to\nmeasure the graphite potential without influence of the counter electrode. Also, this\nmeasurement is a representative measurement due to the size of the two/three electrode cell\nas opposed to the large EV cell. Therefore, it doesn’t account for the temperature\ndistribution and delta temperature of the big cell. Another drawback of optical detection\nmethod is that they are generally limited to imaging surface only. It is difficult to arrive at\na quantitative estimation. Computer Tomography (CT)",
      "page_num": 25,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 253
    },
    {
      "text": "Computer Tomography (CT) K.J. Harry _et al_ used synchrotron hard X-ray microtomography on symmetric\nlithium/polymer/lithium cells. [[192]] The polymer electrolyte was a polystyrene-blockpoly(ethylene oxide) copolymer mixed with lithium bis(trifluoromethanesulfonyl)imide\n(LiTFSI) salt. Computer tomography (CT) measurements allow high resolution imaging\nand are not surface limited but need to be performed with an optimal radiation power to\navoid radiation damage. Consequently, highly optimized synchrotron measurements are\nnecessary for two- and three-dimensional imaging of delicately structured metallic Li. The\ncells were first cycled 15 times at a low current density of 0.02mAcm [-2], followed by cycling\nat a current density of 0.175mAcm [-2] until the experiment was stopped for cell imaging or\nwhen the cell shorted. The imaging was performed using monochromatric hard X-rays with\nenergies chosen in the 22-25 keV range generated by the synchrotron. The X-ray shadow\ncast by the sample was converted into visible light using a scintillator. An optical\nmicroscope magnified this image and converted it into a digital image file. The sample was\nthen rotated by a fraction of a degree and repeatedly imaged until 1,025 images were\ncollected from the sample as it was rotated through 180°.  The volume of dendrites was\ncalculated by assuming each dendrite structure is composed of two half ellipsoid and\nmeasuring their length from the collected images. Their data show conclusively that under\nevery dendritic structure there were subsurface structures located within the lithium\nelectrode. In the early stages of dendrite formation, the volume occupied by the subsurface\nstructure is significantly larger than that occupied by the dendritic structure protruding out\nfrom the electrode surface.  This work indicates that preventing the growth of lithium\ndendrites may involve suppressing the nucleation of subsurface structures. Later A. Yermukhambetova _et al_ extended this method to explore the Li-S battery\nby 3D _in situ_ X-ray tomography. [[193]] They used a multi-scale, 3D X-ray imaging approach\nto examine an electrode both _in situ_ at the micro-scale and _ex situ_ at the nano-scale for a\nmicron sized elemental sulfur and carbon black composite cathode. Sun _et al_ used\nsynchrotron in-line phase contrast X-ray CT to non-destructively visualize the evolution of",
      "page_num": 25,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 555
    },
    {
      "text": "25 electrodeposited lithium and observed separator rupture caused by their growth. [[194]] O.O.\nTaiwo _et al_ applied 3D X-ray CT to investigate the cycling graphite/Li half-cell _in situ_ . [[195]]\nOperando synchrotron X-ray CT enabled the real time 3D visualization of pit formation at\nthe Li metal surface due to Li dissolution. Time-lapse laboratory X-ray CT imaging was\nused to track the growth of moss-like lithium deposits at the Li electrode surface over\nlonger periods of cycling. The 3D imaging showed the appearance of pit-like holes on the\nLi metal surface as a result of Li dissolution during the first discharge, and the formation\nof a mossy, micro-structured lithium layer that increased in thickness with repeated cell\ncycling, penetrating the separator in the process. The results also highlight the importance\nof separator morphology in controlling or preventing dendrite growth in high tortuosity\nseparators within commercial lithium batteries. One caution to be considered during\nmeasurement is the X-ray radiation dose to the cell samples must be carefully chosen to\nprevent material degradation and cell performance losses. Recently R.F. Ziesche _et al_ studied 4D imaging of primary lithium-batteries\n(LixMnO2) using correlative neutron and X-ray tomography. [[196]] The non-destructive\nnature of both X-ray and neutron CT provides opportunities for four-dimensional (4D)\nstudies to explore the evolution of three-dimensional (3D) structures with time. After a\nseries of data processing steps, these shadow images were converted to cross-sectional\nslices that were then stacked together to render a 3D reconstruction of the cell. Highly\nneutron-attenuating elements, such as Li and hydrogen, appear bright in the neutron\ntomograms, which facilitates detection of the Li anode between the darker cathodes of\nlower attenuation. X-ray CT allowed for the quantification of mechanical degradation\neffects such as electrode cracking from the electrode bending process during cell\nmanufacturing. Whereas neutron CT gives information about the electrochemistry such as\nLi-ion transport and intercalation, electrolyte wetting of the cell and consumption or gas\nformation. The bulk properties that computational models were previously based on may\nnow be replaced by spatially resolved, transient values. This technique offers the capability\nof incorporating local heterogeneities and would be able to provide a more accurate and\ncomprehensive description of the practical operation, degradation and failure of a cell. Due\nto the electrolyte and Li having similar attenuation coefficients for neutrons, a direct\ncorrelation between the SOC and the amount of Li consumed could not be made,\nhighlighting a limitation of this technique for the most commercially relevant cells. . Nuclear Magnetic Resonance Spectroscopy",
      "page_num": 26,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 583
    },
    {
      "text": "Nuclear Magnetic Resonance Spectroscopy Li NMR spectroscopy is a noninvasive method for investigating the structural\nchanges that can occur in electrode materials, when performed _in situ_ . [[197-200]] The [7] Li signal\n(spin = 3/2, 92.5% abundance) can be acquired on a time scale that is much faster than the\ntypical charge-discharge cycle. [7] Li NMR shows a chemical shift at 245±1 ppm for pristine\nLi metal and at >258 ppm for plated Li. The structural changes that occur in the active\nmaterial at various states-of-charge can be detected and quantified by recording spectra at\nsuitable time intervals [. ] Nuclear magnetic resonance imaging (MRI) has proven to be\ncapable of Li microstructure imaging, either directly or indirectly.",
      "page_num": 26,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 176
    },
    {
      "text": "26 Hsei _et al_ studied [7] NMR on Li symmetric cell by both _ex situ_ and _in situ_ NMR [[201]]\nto quantify irreversible lithium losses in batteries. Using NMR, GC-MS and calculations\nthey distinguished losses due to SEI formation and fractions of dead lithium. revealing a\ndistribution of different lithium metal microstructures on both working and counter\nelectrodes upon plating and stripping. Using these combination techniques, they estimated\ndead lithium fractions of 3.3% ± 0.6% (with 5% FEC) and 9.4% ± 0.6% (without 5% FEC).\nNMR as a standalone technique can suffer from issues of sensitivity and selectivity. Its\nresolution is lower than with optical or electron microscopy techniques. In fact, resolutions\nbelow 100 µm are hard to obtain for Li [[186]] . NMR method does not directly distinguish\nbetween the mossy and the dendritic Li structures. Dynamic nuclear polarization (DNP) is another promising approach that uses ~10 [3]\ntimes greater gyromagnetic ratio of paramagnetic electrons to hyperpolarize nuclear spins.\nIn typical exogenous DNP experiments, organic radicals are added to the sample and it\nrequires cryogenic sample cooling. The SEI on reduced graphene oxide and silicon anodes\nhas been studied by exogenous DNP, whereby a solution of organic radicals is added to the\nsystem before cooling to 100 K or below, slowing the electron relaxation times of the\nradicals so that the ESR transition can be more easily saturated. [[202-204]] This method has\nseveral limitations related to voltage instability of organic radicals, alteration of SEI by\nradicals, and it is not selective to SEI. Recently Hope _et al_ achieved hyper polarization by\nirradiation of the conduction ESR (CESR) transition and partially equalizing the spin band.\nThe electrons then cross relax with [7] Li nuclei in the metal, thereby inducing nuclear\nhyperpolarization. [[205]] Selective enhancement of the SEI was observed in the diamagnetic\n7Li, 1H and 19F NMR spectra, and the relative DNP enhancements allow the proximity of\ndifferent species to the metal surface to be inferred. By using double resonance experiments\nthey identified the components of the SEI such as polymeric organic species and LiF. Effect\nof electrolyte was evaluated by using electrolytes with and without the common additive\nfluoroethylene carbonate (FEC). Their experiments showed that appreciable [7] Li\nenhancements can still be achieved by Overhauser DNP under static conditions. Neutron Diffraction",
      "page_num": 27,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 559
    },
    {
      "text": "Neutron Diffraction Neutron diffraction offers a promising alternative to derive information about the\nprocesses within a Li-ion battery. In contrast to x-ray diffraction, it has the advantage of\nbeing sensitive to lighter elements (like Li, oxygen and nitrogen) and the high penetration\ndepth of thermal neutrons makes it possible to investigate Li-ion cells in a non-destructive\nway. There are two approaches to neutron diffraction on Li-ion batteries: one is to build\nspecial _in situ_ cells, optimized for the diffraction experiment(special geometry, deuterated\nelectrolyte, etc.) [[25, 26, 206, 207]] . The other approach is to use commercial cells, with the\nbenefit that electrochemical performance and balancing of the electrodes are optimized by\nthe manufacturer. The detail method and instrument specification can be found in Ref. [[40]] . Metallic Li in contact with the graphite anode is unstable; Li reacts with the graphite\nand diffuses into its interstitial spaces during intercalation. Even at -20°C, most of the\nmetallic Li is intercalated after only 13 h. This makes conventional studies on Li plating\ndifficult: since the Li diffusion coefficient at 23°C is reported to be approximately six times\nthe diffusion coefficient at -15°C [[38, 208]], at room temperature at most possibly less Li",
      "page_num": 27,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 289
    },
    {
      "text": "27 remain to disassemble a cell or study Li plating by other methods. This fact further\nemphasizes the importance of using _in situ_ techniques when Li plating is studied. Valuable\ninsights into Li plating in commercial cells can be obtained by neutron diffraction. Figure 6: Diffraction data collected during C/5 charge at -20°C (CV phase begins after 57.3% SOC); data collected every 30 min are shown, SOC relative to nominal RT capacity. Reprinted from V. Zinth, C. von Lüders, M. Hofmann, J. Hattendorff, I.\nBuchberger, S. Erhard, J. Rebelo-Kornmeier, A. Jossen and R. Gilles, _J Power Sources_, **271**, 152 (2014). [[40]] Copyright (2014), with permission from Elsevier. Zinth _et al_ investigated the transformation of LiC12 to LiC6 during the charging\nprocess in detail. [[40]] Intensities of the signal reflection of each of the two phases were\nanalyzed, as described in Figure 6. It was shown that the loss of cyclable Li was\nsignificantly increasing for higher charge currents, when cells were operated at subambient temperatures of -20 °C, indicating that a considerable amount of Li has been\ndeposited on the anode's surface. During a following rest period, the signal intensities of\nboth phases changed, indicating a continuous intercalation of Li into the host structure,\neven after the applied current has been switched off. [[40]] When the graphite anode is lithiated to more than 50%, the two existing phases\nLiC6 and LiC12, commonly denoted as stage 1 and stage 2 in literature, show characteristic\nreflections at scattering angles 2  for the LiC6 (001) at 33.53° and for the LiC12 (002) at\n35.04°. The intensity of the Bragg reflections increases with increasing share of the\nrespective phase. Therefore, diffraction data in the range of 30°- 40° 2  were collected in\n2 min throughout the experiment to follow simultaneously the strong (002) reflection of\ngraphite and the similarly prominent reflections of the intercalation compounds LiC12 and\nLiC6 during the charging and relaxation. The integral intensity of the reflections was\nextracted by pseudo Voigt fitting of the data. In case of overlapping reflections, the full\nwidth at half maximum (FWHM) was refined once for all reflections.",
      "page_num": 28,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 550
    },
    {
      "text": "28 The plated Li was compared with the voltage relaxation peaks. The changing peak\nintensities match distinctly with the voltage relaxation behavior, measured at the cell\nterminal. It can be observed that the amount of plating Li correlates nonlinearly with the\ncharging rate, whereas a charging current of C/2 leads to a deposited amount of Li of 5.5%\nand a current of 1C to 9.0% of the charged capacity. Above a threshold current of C/5, Li\nplating increases dramatically. The results indicate that the intercalation rate of reversibly\ndeposited Li seems to be constant, independent of the deposited amount, and that the\nduration of the voltage plateau during the relaxation period can be used as an indicator for\ndeposited Li. Electron Paramagnetic Resonance Electron Paramagnetic Resonance Spectroscopy (EPR), is a non-invasive and\nhighly specific technique capable of detecting unpaired electrons or radicals. Though EPR\nhas been successfully used in other fields it gained interest in the LiB recently. It is a\npowerful tool for characterizing the formation and disappearance of radical oxygen species\nduring the cycling of a battery. EPR offers unprecedented opportunities to study highcapacity electrode materials. With EPR imaging (EPRi), it is possible to view the electrondensity distribution in materials, if we can develop EPR imaging (EPRI). The\nelectrochemical cell for the study should be made up of a material that is (i) compatible\nwith all cell components (electrolytes, electrodes and so on), (ii) transparent to microwave\nradiation and (iii) inactive for EPR.",
      "page_num": 29,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 351
    },
    {
      "text": "Electron paramagnetic resonance (EPR) spectroscopy is more sensitive than\nnuclear magnetic resonance, while still employing low energy radiation that does not affect\nthe chemical properties or the morphology of the investigated samples. Conduction EPR\n(CEPR) has been carried more than 50 years ago for the detection of conduction electrons\nin metallic Li [[209, 210]] . Recently there has been a growing interest for the in operando study\nof Li plating in a LIB [[30]] and the quantitative analysis of Li plating on graphite [[31]], both are\nvery challenging with alternative techniques. Sathiya _et al_ first designed a special EPR\nelectrochemical cell for _in situ_ characterization. [[211]] The cycling profile of Li2Ru0.75Sn0.25O3\nelectrode versus Li was studied by collecting and analyzing the EPR image of the cathode\nmaterial. In the cathode material Ru [5+], O2 [3-] and O2 [-] are EPR active and Ru [4+] and O2 [2-] are\nEPR inactive. As the change in the oxidation state of cathode components changes their\nEPR activity, it is possible to monitor the charge/discharge cycling by EPR and EPR image.\nSimilarly, by CEPR method, Li morphology could also be distinguished from the linewidth\nof the metallic Li signal, with porous Li showing a much narrower EPR line than bulk Li,\nas can be seen in Figure 7. Therefore, CEPR is a sensitive indicator for the dimensions of\nthe Li structures. Neimöller _et al_ used CEPR to study dendrite growth on separator. [[212]] They\nexplained how the EPR line shape serves to distinguish different kinds of Li morphologies.\nEPR of conductive samples are influenced by the skin effect, which leads to a depth\ndependent attenuation and sample thickness dependent phase shift of the EPR signal [[211, ] 213]. The skin depth is about δ ≈1.1 µm for metallic Li at X-band microwave frequencies.\nWhen the sample thickness d is larger than the skin depth δ, the experimentally acquired\nfirst derivative EPR spectrum shows a Dysonian lineshape that can be approximated by a",
      "page_num": 29,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 471
    },
    {
      "text": "29 phase-shifted Lorentzian [[209]] . The resolution achievable in an EPRI experiment is similar\nto that of MRI [[214, 215]], which depend on the full width at half maximum of the point spread\nfunction [[216]] . The EPR linewidth in the absence of a magnetic field gradient and the applied\nimaging gradient determine the image resolution. The pixel or voxel length ∆z of the EPR\nimage is proportional to the EPR peak-to-peak linewidth ∆Hpp and to the inverse of the\ngradient G [[217]], narrower lines and stronger gradients allow for higher resolution images. △𝑧 ∝ △𝐻𝑃𝑃 [EPR 1] 𝐺 A. Figure 7: First derivative CEPR signal, as measured in a field swept EPR experiment, for metallic Li with different morphologies. The peak-to-peak\nlinewidth for dendritic Li with ca. 0.005 mT (green), mossy Li is 0.03 mT (blue) and bulk Li is ca. 0.15 mT (red). Reproduced from Neimöller _et al_ Scientific Reports, **8**, 14331 (2018). [[212]] . (CC BY,\n[https://creativecommons.org/licenses/by/4.0)](https://creativecommons.org/licenses/by/4.0) The self-diffusion of spin-carrying conduction electrons changes the linewidth. As the\nspin depth is much bigger than the skin depth, electrons diffuse from the surface into the\nbulk of the material. As a result, excited electron spins are withdrawn from a region excited\nby the external microwave field and replaced by electrons with an equilibrium spin state [[210]] .\nThis process leads to a line broadening. Therefore, when a narrow dendritic line is observed,\nall the spins are contained in structures that are fully penetrated by the microwave field,\nhence quantitative imaging of the spin density is possible _._ This imaging method shows\ngreat potential for imaging of Li dendrite growth within solid electrolytes. Quantitative _in_\n_situ_ application of CEPRI faces a challenge of multiple peaks from different Li\nmorphologies and other paramagnetic species.",
      "page_num": 30,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 465
    },
    {
      "text": "30 Accelerated Rate Calorimetry (ARC) Similar to chemical reactions, electrochemical reactions have thermal signatures [[218, ] 219]. Sample temperature variations alter the kinetics of redox processes and material\nproperties that influence mass transport such as electrolyte viscosity. These temperature\nvariations can permit undesirable outcome such as Li plating and excessive solidelectrolyte interphase (SEI) growth. Low temperatures, high charging rates (C-rates), and\nspatial thermal gradients are known to enable Li plating [[46]] . High temperatures accelerate\nSEI growth and diminish performance. On the cell level, a measure for cell safety is the\nonset temperature of exothermic reactions in accelerated rate calorimetry (ARC) tests. In\nARC tests, cells are heated step-by-step under quasi-adiabatic conditions until exothermic\nreactions are detected (heat-wait-seek experiment). Carter el evaluated three fully charged cells by ARC to assess their thermal\nrunaway [[220]] . One cell was conventionally cycled equilibrium 20 `◦` C and it began to selfheat at 130°C. The second cell was cycled at equilibrium 0 `◦` C and the third was cycled with\ntransient 40 to 0 `◦` C. The latter two cells began to self-heat at low temperatures 50 and 35 `◦`\nC, respectively. The higher peak temperature of the transient 40 to 0 `◦` C cell (154 `◦` C\ncompared to 108 `◦` C for the Equilibrium 0 `◦` C condition) caused by Li side reactions,\nindicates a greater quantity of metallic Li, augmenting the heat generation. Since venting\nis not evident in the data for each of these cells, both cans rupture during the thermal\nrunaway event, releasing active material. In the case of the equilibrium 0 `◦` C cell, the\njellyroll ejects through the top of the cell whereas the transient 40 to 0 `◦` C cell exhibits side\nwall rupture opening the cell in the radial direction. In contrary, the conventional 20°C\ncycled cell didn’t have any rupture, although it also combusted after 200°C.",
      "page_num": 31,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 480
    },
    {
      "text": "Charging Li-ion cells under spatially uniform, temporally transient thermal\nconditions can greatly reduce performance and safety. A single charging of a commercial\nLi-ion battery while its temperature is decreasing temporally toward 0 `◦` C, is enough to\ncause Li plating and early loss of capacity, earlier onset temperature of thermal runaway,\nand higher heat generation temperature during thermal runaway. The 18650 cells examined\nshow evidence that approximately half of the Li [+] ions transferred in this first charge deposit\nas Li metal rather than intercalating in both the mild transient 10 to 0 `◦` C and the more\nsubstantial transient 40 to 0 `◦` C cases. When this substantial plating is induced by the\ntransient thermal condition, a depression in the charge voltage to a negative differential\nvoltage occurs. However, after the cells reach 0 `◦` C, stripping was still observed on the\ndischarge, but the charge voltage does not exhibit a negative differential. The distinct\nnature of this feature provides a route for detection of the onset of this aggressive Li plating\nbehavior with BMS algorithms. Since cells charged during the transient to 0 `◦` C experience\nsignificant Li plating and subsequent stripping, its long-term performance differed from a\ncell initially equilibrated to the same condition. The equilibrium 0 `◦` C cell undergoes\nsignificantly less Li metal plating and stripping ( `∼` 0.2 Ah) but eventually experienced\njellyroll collapse after `∼` 30 cycles due to low temperature. However, the largest quantity of\nLi plated and stripped in the transient 40 to 0 `◦` C case (1.04 Ah) which caused the jellyroll\nto collapse more rapidly, after only `∼` 5 cycles. These distinct degradation modes enable\nextremely energetic failure modes following self-heating at mild temperatures of only 50",
      "page_num": 31,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 409
    },
    {
      "text": "31 and 35 `◦` C for the equilibrium 0 `◦` C and transient 40 to 0 `◦` C cases, respectively. The\nTransient 40 to 0 `◦` C case shows evidence of more residual Li metal and a more rapid\nacceleration to thermal runaway leading to can wall breaches. The cells’ sensitivity to thermal transient conditions emphasize the need to\nunderstand the correlations between Li-ion battery environments and local\nelectrochemistry. This understanding can better evaluate safe operating conditions and\nthermal management strategies. The thermal sensitivity of form factors and pack\nassemblies should be evaluated. Moreover, it is important to understand the time to\nequilibrium when selecting C-rate, so that substantial SOC variation does not occur during\na thermal transient condition. These considerations are particularly important for extreme\nfast charging. One main drawback of the ARC study is, the instrument is commonly\ndesigned to study small cells, such as 18650 or 26650 sizes. In order to study bigger EV\ncells, it must be custom designed for safe measurement which increases the cost. In Operando Acoustic Detection of Li Metal Plating Non-destructive methods for detecting localized Li metal plating in LiBs have been\nchallenging to set up. An elegant and straightforward method is to correlate cell thickness\nmeasurements with plating in operando [[221, 222]] . Although this is a proven method, it is\nunable to distinguish between gassing reactions and Li metal plating, which may both\nincrease cell thickness. Earlier report by Hsieh _et al_ . introduced the ability of acoustic\nultrasound to probe physical dynamics of a battery during cycling [[223]] . Specifically, Davies\n_et al_ . [[224]] attributed the shifts in the transmitted ultrasonic signals due to variations of the\nelectrode density and bulk modulus. Similarly, Gold _et al_ . [[225]] utilized a comparably lower\nfrequency ultrasonic pulse (200 KHz versus 2.25 MHz) to analyze the arrival time of the\nslow, compressional wave. J.B. Robinson _et al_ studied a commercial cell phone battery by\nsuccessfully employing spatially resolved ultrasound acoustic measurement combined with\nX-ray computed tomography. [[226]] They demonstrated the applicability of this method for\nbattery state of health measurement and also identified local cell construction glitches\nassociated with anode tab. Z. Deng _et al_ along with Jeff Dahn have successfully\ndemonstrated cell wettability differences in pouch cells by employing ultrasonic scanning\ntechnology [[227]] .",
      "page_num": 32,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 535
    },
    {
      "text": "Bommier _et al_ . [[228]] demonstrates that the simple and scalable in operando acoustic\ntechnique can be utilized to detect Li metal plating in commercial scale LiBs. The detection\nmethod is semiquantitative, as more significant Li metal plating results in increased\nhysteresis of the acoustic time of flight. The acoustic technique can observe localized and\nheterogeneous plating events, because the signal comes from the total acoustic pathway\nbetween the locations on the cell connected to the transducers. Moreover, the technique\ncan be deployed with minimal start-up costs, requiring transducers, an acoustic detector,\nand an open source software package. Bommier _et al_ studied the cycling of the LiCoO2/graphite battery cell. The first two\nC/15 cycles show a clear Time Of Flight (TOF) shift, with the TOF decreasing during the\ncharging step and increasing during the discharge step. Graphite has a larger volumetricspecific capacity than LiCoO2 (LCO), therefore it takes up a larger portion of the acoustic\npathway and will have a greater impact on the TOF. The local inflection points in the TOF",
      "page_num": 32,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 246
    },
    {
      "text": "32 shift may be due to graphite staging events, as these are located at the same SOC as\ninflection points in the voltage curve. The TOF shifts for the initial slow C/15 charge and\nthe faster fixed capacity charge were compiled for all tests and analyzed. As described in\nFigure 8, the acoustic TOF shift between the C/15 current rate (blue curve) and the 0.5C\nfixed capacity charge (red curve) is similar. However, as the current rate is increased to\n0.75C and 0.88C, the respective TOF shift between the slow charge and the faster fixed\ncapacity charge begins to deviate (Figures 8B and 8C). At the current rate of 1C, there is a\nclear anomaly that develops within the cell at around 0.070 Ah: the initially decreasing\nTOF shift suddenly reverses course and starts to increase. When the fixed capacity charge\nis finished, the TOF shift is completely different from that of the slow rate C/15 charge,\nwith a large difference in the endpoints (Figure 8D). These results indicate the possibility\nof using the TOF endpoint difference as a plating detection parameter. Figure 8. Comparison of acoustic TOF shifts during the C/15 charge and the fixedcapacity charge of 0.210 Ah, at four different current rates. No voltage cutoffs were set\nfor fixed-capacity charges. These cells were cycled at 10°C with a fixed capacity charge of (A) 0.5C, (B) 0.75C, (C) 0.875C, and (D) 1C. Reproduced from C. Bommier _et al_, _Cell Reports Physical Science_ **1,** 100035, (2020) [[228]] . (CC BY, [https://creativecommons.org/licenses/by/4.0)](https://creativecommons.org/licenses/by/4.0)",
      "page_num": 33,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 410
    },
    {
      "text": "33 Figure 9: (A) Plot of logarithmic rate (1/t) versus inverse temperature (1,000/T), using the associated color bar to factor in the time of flight (TOF) endpoint\ndifference between the C/15 charge and the fixed capacity charge. (B) Optical\nimages of a delithiated graphite anode control (left of image) and the anode at the corresponding fixed-capacity charge (right of image). The colored dot represents the TOF endpoint difference according to the color bar used in (A) [[228]] .\nReproduced from C. Bommier _et al_, _Cell Reports Physical Science_ **1,** 100035, [(2020). (CC BY, https://creativecommons.org/licenses/by/4.0)](https://creativecommons.org/licenses/by/4.0) Figure 9 shows the plot of logarithmic rate versus inverse temperature. A symmetric\nlogarithmic color bar has been used for easier identification of TOF endpoint differences.\nLower TOF endpoint differences are indicated by an increasingly dark green color, and\nhigher TOF endpoint differences are indicated by an increasingly dark magenta color. The\ndepicted equation represents the linear fit (Arrhenius relationship) between logarithmic rate\nand inverse temperature, shown by the dotted line. The gray error bar represents the\nstatistical standard error, which is the variance of the dataset divided by the set size. TOF\nendpoint differences generally increase with rate at any given temperature, as visualized\nby the color of the datapoint. Because plating is a continuum event, the linear fit generally\ndescribes conditions where plating is likely (i.e., one standard deviation above the linear\nfit) but does not conclude with certainty the presence of plating due to the statistical nature\nof this experiment. With a pouch cell that had undergone visible gassing and swelling, the\npermanent attenuation of the acoustic signal can be observed. Acoustic waveforms are\nknown to propagate much more easily through solid or liquid mediums due to a lower\nimpedance mismatch ratio, and significant attenuation of the signal implies the presence of\ngassing. One drawback of the technique as it currently stands is the bulk methodology. A simple\nultrasonic pulse through the length of the battery allows for a quick assessment of the entire\nstack. At the same time, it also convolutes contributions from individual electrodes.\nTherefore, it would be difficult to distinguish whether plating occurred on only one or",
      "page_num": 34,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 512
    },
    {
      "text": "34 several electrodes and determine which electrodes plated. The acoustic effects are solely\nbased on the area between the transducers, so to identify spatial heterogeneities, multiple\ntransducers can be placed on a single cell, given that it is large enough. This makes for\nuseful commercial cell quality analysis, especially owing to the low cost and speed at which\ndiagnostics can be carried out. As the wavelength of the ultrasonic pulse is relatively low,\non the order of ~1 mm, there may exist a minimum resolution beyond which plating cannot\nbe detected (e.g., single-layer electrode pouch cells). However, W. Chang _et al_\ndemonstrated the sensitivity of thickness detection can be improved to micron resolution\nwhen combined with in-situ transmission X-ray microscopy (TXM). [[229]] They combined\nthe ultrasound acoustic detection with TXM to study the expansion and contraction of a\npouch cell during cycling. Their expectation is that TXM has sufficient range and pixel\nresolution to measure both the total cell thickness and the average layer thicknesses, though\nit proved to be more difficult to image. Nevertheless, they successfully measured the\neffective stiffness of a commercial pouch cell battery during cycling from the wave velocity\nand cell thickness in operando by the TXM/acoustics setup. Note that cell stiffness is\nresulting from electrode expansion during cycling. Lastly, the acoustic detection sensitivity\nis also related to the attenuating properties of the media. Form factors that include materials\nthat have higher impedance mismatch with the transducers or that intensify waveform\nconvolution (e.g., springs/spacers in coin cells) may be more difficult to analyze. Mass Spectrometry Titration Recently Mass spectrometry titration (MST) is successfully employed for inactive Li\nquantification on graphite with a detection limit of 20 nmol Li, which corresponds to 0.5\n Ah of total plated Li [[48]] . This technique is a modified version of a similar titration [[230, 231]] .\nto quantify Li2CO3 on extracted Li-O2 battery cathodes and was recently used to quantify\nsurface Li2CO3 on Li-rich and Li-stoichiometric NMC cathodes. With the MST, it was\npossible to precisely identify: 1) the charge rate at which Li plating is observed if the\nelectrode is charged to its nominal full capacity (corresponding to 372 mAh/g graphite),\nand 2) the state of charge at which Li plating commences at a 4C rate (full charge in 15\nminutes). It can be characterized by an electrochemical model to determine the Li plating\nexchange current density and the efficiency of plated Li stripping during discharge.",
      "page_num": 35,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 567
    },
    {
      "text": "M.J. Shane _et al_, used MST to quantify plated and inactive Li. [[208]] The graphite\nelectrode sample was first placed in an airtight titration vessel, the apparatus and the\nmethod are described previously. [[48]] A Labview program was used to sample gas from the\nvessel headspace every two minutes, replenish Argon to the vessel after sampling, and\nrecord ion currents, pressure, and temperature throughout the experiment. While the\nLabview program was running, 3.5 M H2SO4 was injected with an airtight syringe through\nthe septum port on the titration vessel. Previous work on quantification of Li2CO3 on\ncathode materials [[232]] using the same MST setup showed that any concentration above 1M\nH2SO4 provided sufficient excess acid to react all present carbonate species, and H2SO4\nwas chosen over other acids to remain consistent with similar previous carbonate titration\nstudies [[230, 231]] . Carbonate titrations using phosphoric acid have also been reported and yield\nsimilar results [[233]] . The maximum amount of gas evolved in any single experiment was\nroughly 15  mol, which is calculated to cause a pressure increase in their sealed titration\nvessel ~30 torr, not large enough to break the titration vessel. An inert gas should be used",
      "page_num": 35,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 293
    },
    {
      "text": "35 as the carrier gas to ensure evolved H2 does not combust given the high exothermicity of\nLi reacting with acid or water. Figure 10: H2 gas evolution during titration. Acid was injected before the fourth data\npoint in each case [[48]] . Reproduced with permission from E.J. McShane _et al, ACS Energy_ _Lett._ **, 5** (6) 2045–2051 (2020). [[208]] Copyright © 2020 from American Chemical Society As can be seen in Figure 10, It is possible to achieve a detection limit of 20 nmol inactive\nLi with MST, which is based upon the expected minimum H2 signal that can be quantified\nupon titration. One mole H2 corresponds to 2 moles of inactive Li. The lowest amount of\ninactive Li measured with MST was 105 nmol Li, which is much higher than the signal to\nnoise. An evolution of ~5 nmol H2 (~10 nmol of inactive Li) would still be perceptible,\nalthough not quantifiable. 10 nmol of H2 (20 nmol inactive Li) is clearly distinguishable\nfrom baseline noise, as scaling the 105 nmol inactive Li data by 1/5. Inactive Li includes only electronically isolated Li and LixC6. It can be calculated\nby assuming that plated Li is formed via a 1 electron/Li process and LixC6 is formed via a\nx electron/LixC6 process, i.e., 1 mole electron per mole inactive Li. This calculation is\nshown below, where QLi is the inactive Li equivalent capacity and nLi is the number of\nmoles of inactive Li measured via H2 evolution upon titration: 𝑄𝐿𝑖 = 𝑛𝐿𝑖 1 𝑚𝑜𝑙 𝑒 [−] 96485 𝐶 𝑚𝐴ℎ [MST 1]\n1 𝑚𝑜𝑙 𝐿𝑖 𝑚𝑜𝑙 𝑒 [−] 3.6 𝐶 Contribution of each Source of capacity loss is shown in Figure 11. Solid carbonate\nand Li2C2 contribution to total irreversible capacity are calculated based on the increase in\ntheir amount above the baseline values observed after formation cycling. Thus, mass\nspectrometric titration is a powerful technique in distinguishing between inactive Li and\nother surface components of plated Li. However, this technique is _ex situ_, which require\ntearing down the cell for analysis. The accuracy of the estimation depends on the time\nbetween tear down and analysis as with other _ex situ_ techniques.",
      "page_num": 36,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 573
    },
    {
      "text": "36 Figure 11: (a) Cell cycling procedure: two C/10 formation cycles (0.010-1.5 V)\nfollowed by three cycles of varying charge rate (shown in red) and C/4 discharge to 1.5V with 30-minute OCV period between each charge/discharge. (b) Total contributions of\ninactive Li, solid carbonate, Li2C2 and other species to the observed irreversible capacity after three cycles of varying charge C-rates from (a) [[48]] . Adapted with permission from E.J. McShane _et al, ACS Energy Lett._ **, 5** (6) 2045–2051 (2020). [[208] ] Copyright © 2020 from American Chemical Society Summary and Outlook Anode Li plating is one of the main factors that result in rapid aging and safety issues\nof LiBs; addressing this issue is critical to design safer and more durable LiBs. This paper\npresents an overview of existing methods and recent advancements in the detection of\nanode Li plating. The review covers the underlying mechanisms of Li plating, diagnostic\ntechniques, their benefits and the current status of development. Li deposition is more likely to happen with decreasing temperature, increasing SOC\nand increasing charging C-rate However, the interplay of these main factors is also\nimportant. Low temperatures do not lead to Li deposition in all cases, however, if certain\nlimits of SOC and/or charging C-rate are exceeded. For example, a cell might be charged\nby high currents at low SOC and later by lower currents without Li deposition. At low\ntemperatures, the Li deposition might be suppressed by low charging currents or by\npreheating of batteries. Variations can be observed when inhomogeneities/gradients are\npresent inside the cells: temperatures, SOCs and current densities. Such variations can lead\nto a variety of macroscopic morphologies for Li deposition, including, homogeneous Li",
      "page_num": 37,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 408
    },
    {
      "text": "37 deposition (Li plating), local Li deposition and marginal Li deposition As an example,\nlocal formation of gas bubbles or SEI growth and clogging of pores at high temperatures\ncan lead to local Li deposition during cycling at 45 °C. Besides these evidences for Li metal deposition in Li-ion cells, a variety nondestructive and destructive methods exist which are based on ageing behavior, analysis of\nelectrochemical data, cells, and electrodes. Besides ageing mechanisms, Li deposition is\nalso connected to safety mechanisms. Two main safety mechanisms were identified\nincluding, internal shorts caused by the dendritic growth of Li and exothermic reactions\nof Li with electrolyte The dendritic growth of Li is connected to the Li/Li [+] interaction on\nthe atomic level, the presence of ridges, and higher field densities at the tips of the dendrites.\nBesides the very low probability of failures due to Li dendrites in Li-ion cells (ppm range)\nthey are relevant, and some attempts have been made for failsafe designs and early\ndetection of dendrites. Exothermic reactions of Li metal with electrolyte can already start\nat 30–35 °C under the adiabatic conditions of ARC tests. In an application this translates\nto a situation, when not enough heat can be transferred from the cell to the surroundings,\ni.e. for a very high thermal isolation. This shows the importance of cooling systems for\nbatteries in applications.",
      "page_num": 38,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 302
    },
    {
      "text": "It is challenging to sensitively and quantitatively detect anode Li plating in practical\nLiBs, which is significant for battery management systems. The cause of anode Li plating\ndepends strongly on the cell design and operating conditions, especially charge rate and\ntemperature. During high-rate charging at room temperature, the poor solid phase diffusion\nof Li ions is responsible for anode Li plating. As the temperature decreases, the interface\nreaction is also hindered in addition to solid phase Li diffusion. In order to suppress anode\nLi plating, optimizing the electrolyte composition and modifying the graphite surface\nstructure by methods such as coating, and doping are usually employed. In addition,\nappropriate working conditions and charging protocols can reduce the possibility of anode\nLi plating. A recent report from Yang _et al_ [[234]] described the performance of self-heating\nLiB structure which has thin nickel (Ni) foils embedded inside a cell that can create\nimmense and uniform heating. The Ni foil is an inherent component of a single cell along\nwith electrodes and electrolyte. It serves as an internal heating element, as well as an\ninternal temperature sensor as its electrical resistance varies linearly with temperature. The\nNi foils only adds 0.5% weight and 0.04% cost to a conventional LiB single cell. They\nwere able demonstrate fast charging without Li plating at temperatures as low as -50 [o] C\nwith the help of the self-heating element. Various techniques have been applied to detect anode Li plating. Among these,\nphysical characterizations such as Conduction EPR, neutron diffraction and mass\nspectrometric titration are promising for understanding the mechanisms of Li plating, while\nelectrochemical methods such as coulombic efficiency, discharge voltage profiles,\nelectrochemical impedance and cell thickness analysis are more applicable to practical\nLiBs The following table provides the Li detection methods, their advantages and current\nchallenges:",
      "page_num": 38,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 410
    },
    {
      "text": "38",
      "page_num": 39,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 1
    },
    {
      "text": "38 |Methods and advantages|Challenges|\n|---|---|\n|**Three-electrode diagnostics** <br>Constructing a special cell with anode,<br>cathode and a reference electrode to<br>study the charging rate at which anode<br>potential reaches 0V vs Li/Li+.<br>Easier to implement and a common<br>tool.|Temperature distribution differences between<br>small 3 electrode cell and multi stack EV<br>battery is not linear.<br>Cathode polarization can interfere with the<br>anode Li plating curve.<br>|\n|**Detection of voltage plateau (dV/dt)**<br>The mixed potential associated with<br>simultaneous Li stripping and Li+ <br>intercalation leads to a voltage plateau<br>and can be identified in the plot of<br>dV/dt vs %SOC.<br>The most common method that can be<br>studied on full cell as opposed to<br>constructing a special cell.|Interferences from graphite staging with Li<br>plating at low charge rates.<br>|\n|**Measurement of coulombic**<br>**efficiency (CE)**<br>When Li plating happens, coulombic<br>efficiency decreases.<br>Easier to implement on the cell level.|High precision coulometer and temperature<br>chamber are needed for accurate diagnosis.|\n|**Measurement of cell thickness**<br>1Ah of plated Li causes a volume<br>change of 0.49 cm3, compared to 0.12<br>cm3 for intercalated Li. Thickness<br>changes from Li deposition reflect on<br>cell thickness.<br>Easier to implement on cell level.|SEI decomposition reactions in the cell can<br>lead to gassing which can affect the<br>measurement accuracy. It is also influenced<br>by the thickness measurement jig and<br>measurement point.|\n|**Cell Impedance Analysis**<br>Charge transfer region of cell EIS<br>changes with SOC. Li plating changes<br>the trend from a good cell vs plated<br>cell.<br>Study can be performed on full cell.<br>|It requires step charging protocol like HPPC<br>with rest period included during which cell<br>impedance measurement is performed.|\n|**Accelerated Rate Calorimetry**<br>**(ARC)**<br>Li plating is associated with thermal<br>signature which can be measured by<br>ARC.<br>It can be performed on full cell.|Early exothermic reactions in ARC tests<br>needs massive Li plating.<br>ARC chamber must be custom made to test<br>the large EV batteries.|\n|**Optical Detection**<br>**SEM/TEM/Raman/XPS**<br>Plated cell is teared down and anode<br>was analyzed by the above techniques<br>for Li plating.|It is generally conducted_ex situ._In the time<br>lapse between opening the cell and inspection,<br>some plated Li can intercalate back to<br>graphite. It is influenced by transfer time and<br>handling.|",
      "page_num": 39,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 657
    },
    {
      "text": "39 |Col1|Even if it is performed in situ, it can only<br>detect on a small section (localized). It is not<br>a cell level detection.|\n|---|---|\n|**Li Nuclear magnetic resonance**<br>**(NMR)**<br>The chemical shift of Li metal in NMR<br>spectra (245–270 ppm, depending on<br>Li metal structure).<br>The peak intensity in NMR spectra is<br>proportional to Li amount and is used<br>to quantify Li plating.<br>|As in the case with optical detection methods,<br>NMR gives direct evidence only microscopic<br>and electrode level Li plating.<br>It is not a cell level analysis.<br> <br> <br> <br>|\n|**Electron paramagnetic resonance**<br>**(EPR)**<br>The EPR signal of Li metal is much<br>narrower and its signal center is<br>slightly upfield compared with the<br>signal from the intercalated Li (LixC6).<br>The magnitude of EPR signal is related<br>to Li metal amount.<br>It is more sensitive than NMR.<br>|It is in the early stage of development.<br>|\n|**X- ray and Neutron Computer**<br>**Tomography**<br>X-ray CT allowed for the<br>quantification of mechanical<br>degradation whereas Neutron<br>diffraction can identify Li-ion<br>transport and intercalation, electrolyte<br>wetting of the cell.|It has the potential for real time battery<br>internal component imaging combined with<br>surface characterization.<br>It is in the early stage of implementation.<br> <br>|\n|**Acoustic detection**<br>The transmitted ultrasonic signals shift<br>due to variations of the electrode<br>density and bulk modulus.<br>Can be studied on full cell. Easy to<br>implement.|It is a bulk technique that can be performed<br>on a full cell.<br>It can identify Li plating but cannot identify<br>the location of Li plating initiation. It can be<br>combined with other optical detection<br>methods to get both cell level and<br>microscopic information.|\n|**Mass spectrometric titration**<br>Titration of anode and estimation of<br>off gasses by mass spectrometry.<br>It can identify the difference between<br>inactive Li and the SEI components on<br>plated Li down to 20nmol<br>concentration.|It is a quantitative technique.<br>It is a component level analysis and is also an<br>_ex situ_ technique. Therefore, it has the same<br>challenges as those of other ex-situ<br>techniques.<br>|",
      "page_num": 40,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 584
    },
    {
      "text": "40 **Acknowledgments** The authors appreciate the discussions and feedback from Dr. Dan Steingart of\nColumbia University and Dr. Bryan D. McCloskey of University of California, Berkeley. **References** 1 C.-Y Wang, G Zhang, S Ge, T Xu, Y Ji, X.-G Yang and Y Leng, _Nature_, **529**,\n515 (2016).\n2 V Etacheri, R Marom, R Elazari, G Salitra and D Aurbach, _Energy &_\n_Environmental Science_, **4**, 3243 (2011).\n3 H Jiang, Z Lu, M Wu, F Ciucci and T Zhao, _Nano Energy_, **23**, 97 (2016).\n4 C R Birkl, M R Roberts, E McTurk, P G Bruce and D A Howey, _J Power_\n_Sources_, **341**, 373 (2017).\n5 M Dubarry, G Baure and A Devie, _J Electrochem Soc_, **165**, A773 (2018).\n6 R Xiong, Y Duan, J Cao and Q Yu, _Appl Energ_, **217**, 153 (2018).\n7 S J Harris, E K Rahani and V B Shenoy, _J Electrochem Soc_, **159**, A1501 (2012).\n8 S J Harris, A Timmons, D R Baker and C Monroe, _Chemical Physics Letters_,\n**485**, 265 (2010).\n9 M Smart and B Ratnakumar, _J Electrochem Soc_, **158**, A379 (2011).\n10 A N Jansen, D W Dees, D P Abraham, K Amine and G L Henriksen, _J Power_\n_Sources_, **174**, 373 (2007).\n11 J Fan and S Tan, _J Electrochem Soc_, **153**, A1081 (2006).\n12 C K Huang, J Sakamoto, J Wolfenstine and S Surampudi, _J Electrochem Soc_,\n**147**, 2893 (2000).\n13 P Arora, R E White and M Doyle, _J Electrochem Soc_, **145**, 3647 (1998).\n14 M Smart, B Ratnakumar, L Whitcanack, K Chin, M Rodriguez and S.\nSurampudi, _IEEE aerospace and electronic systems magazine_, **17**, 16 (2002).\n15 M Smart and B Ratnakumar, _ECS Trans_, **25**, 241 (2010).\n16 M Smart, B Ratnakumar, S Surampudi, Y Wang, X Zhang, S Greenbaum, A.\nHightower, C Ahn and B",
      "page_num": 41,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "Greenbaum, A.\nHightower, C Ahn and B Fultz, _J Electrochem Soc_, **146**, 3963 (1999).\n17 M Zier, F Scheiba, S Oswald, J Thomas, D Goers, T Scherer, M Klose, H.\nEhrenberg and J Eckert, _J Power Sources_, **266**, 198 (2014).\n18 W Lu, C M López, N Liu, J T Vaughey and A Jansen, _J Electrochem Soc_, **159**,\nA566 (2012).\n19 H.-P Lin, D Chua, M Salomon, H Shiao, M Hendrickson, E Plichta and S Slane,\n_Electrochem Solid St_, **4**, A71 (2001).\n20 A Whitehead, M Perkins and J Owen, _J Electrochem Soc_, **144**, L92 (1997).\n21 M Petzl and M A Danzer, _J Power Sources_, **254**, 80 (2014).\n22 C Uhlmann, J Illig, M Ender, R Schuster and E Ivers-Tiffée, _J Power Sources_,\n**279**, 428 (2015).\n23 S Schindler, M Bauer, M Petzl and M A Danzer, _J Power Sources_, **304**, 170\n(2016).\n24 S Solchenbach, D Pritzl, E J Y Kong, J Landesfeind and H A Gasteiger, _J_\n_Electrochem Soc_, **163**, A2265 (2016).\n25 Y Zhang and C.-Y Wang, _J Electrochem Soc_, **156**, A527 (2009).",
      "page_num": 41,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 377
    },
    {
      "text": "41 26 Y Leng, S Ge, D Marple, X.-G Yang, C Bauer, P Lamp and C.-Y Wang, _J_\n_Electrochem Soc_, **164**, A1037 (2017).\n27 S J An, J Li, C Daniel, S Kalnaus and D L Wood III, _J Electrochem Soc_, **164**,\nA1755 (2017).\n28 N Ghanbari, T Waldmann, M Kasper, P Axmann and M Wohlfahrt-Mehrens,\n_Ecs Electrochem Lett_, **4**, A100 (2015).\n29 Y Krämer, C Birkenmaier, J Feinauer, A Hintennach, C L Bender, M Meiler,\nV Schmidt, R E Dinnebier and T Schleid, _Chemistry–A European Journal_, **21**, 6062\n(2015).\n30 J Wandt, C Marino, H A Gasteiger, P Jakes, R.-A Eichel and J Granwehr,\n_Energy & environmental science_, **8**, 1358 (2015).\n31 J Wandt, P Jakes, J Granwehr, R.-A Eichel and H A Gasteiger, _Materials Today_,\n**21**, 231 (2018).\n32 J Arai, Y Okada, T Sugiyama, M Izuka, K Gotoh and K Takeda, _J Electrochem_\n_Soc_, **162**, A952 (2015).\n33 H Ge, T Aoki, N Ikeda, S Suga, T Isobe, Z Li, Y Tabuchi and J Zhang, _J_\n_Electrochem Soc_, **164**, A1050 (2017).\n34 J Burns, D Stevens and J Dahn, _J Electrochem Soc_, **162**, A959 (2015).\n35 Q Liu, R Petibon, C Du and J Dahn, _J Electrochem Soc_, **164**, A1173 (2017).\n36 B Bitzer and A Gruhle, _J Power Sources_, **262**, 297 (2014).\n37 B Rieger, S F Schuster, S V Erhard, P J Osswald, A Rheinfeld, C Willmann\nand A Jossen, _Journal of Energy Storage_, **8**, 1 (2016).\n38 C Birkenmaier, B Bitzer, M Harzheim, A Hintennach and T Schleid, _J_\n_Electrochem Soc_, **162**, A2646 (2015).\n39 F Grimsmann, T Gerbert, F Brauchle, A Gruhle, J Parisi and M",
      "page_num": 42,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 599
    },
    {
      "text": "Gruhle, J Parisi and M Knipper, _J_\n_Power Sources_, **365**, 12 (2017).\n40 V Zinth, C von Lüders, M Hofmann, J Hattendorff, I Buchberger, S Erhard, J.\nRebelo-Kornmeier, A Jossen and R Gilles, _J Power Sources_, **271**, 152 (2014).\n41 R V Bugga and M C Smart, _Ecs Transactions_, **25**, 241 (2010).\n42 M Bauer, B Rieger, S Schindler, P Keil, M Wachtler, M A Danzer and A.\nJossen, _Journal of Energy Storage_, **10**, 1 (2017).\n43 C von Lüders, V Zinth, S V Erhard, P J Osswald, M Hofmann, R Gilles and\nA Jossen, _J Power Sources_, **342**, 17 (2017).\n44 T Waldmann and M Wohlfahrt-Mehrens, _Electrochim Acta_, **230**, 454 (2017).\n45 U R Koleti, T Q Dinh and J Marco, _J Power Sources_, **451**, 227798 (2020).\n46 R Carter, E J Klein, T A Kingston and C T Love, _Frontiers in Energy Research_,\n**7**, 144 (2019).\n47 M T Pham, J J Darst, D P Finegan, J B Robinson, T M Heenan, M D Kok,\nF Iacoviello, R Owen, W Q Walker and O V Magdysyuk, _J Power Sources_, 228039\n(2020).\n48 E J McShane, A M Colclasure, D E Brown, Z M Konz, K Smith and B D.\nMcCloskey, _ACS Energy Letters_ (2020).\n49 W Fang, O J Kwon and C Y Wang, _International journal of energy research_,\n**34**, 107 (2010).\n50 Y Ji, Y Zhang and C.-Y Wang, _J Electrochem Soc_, **160**, A636 (2013).\n51 X.-G Yang, C Bauer and C.-Y Wang, _J Power Sources_, **327**, 414 (2016).\n52 X.-G Yang, G Zhang and C.-Y Wang, _J Power Sources_, **328**, 203 (2016).\n53 X.-G Yang, T Liu and C.-Y Wang, _J Power Sources_, **342**, 598 (2017).",
      "page_num": 42,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 577
    },
    {
      "text": "42 54 L Liu, J Park, X Lin, A M Sastry and W Lu, _J Power Sources_, **268**, 482 (2014).\n55 L Liu, P Guan and C Liu, _J Electrochem Soc_, **164**, A3163 (2017).\n56 B Wu and W Lu, _J Power Sources_, **360**, 360 (2017).\n57 P Arora, M Doyle and R E White, _J Electrochem Soc_, **146**, 3543 (1999).\n58 R D Perkins, A V Randall, X Zhang and G L Plett, _J Power Sources_, **209**, 318\n(2012).\n59 N Legrand, B Knosp, P Desprez, F Lapicque and S Raël, _J Power Sources_, **245**,\n208 (2014).\n60 X.-G Yang, Y Leng, G Zhang, S Ge and C.-Y Wang, _J Power Sources_, **360**, 28\n(2017).\n61 T Danner, M Singh, S Hein, J Kaiser, H Hahn and A Latz, _J Power Sources_,\n**334**, 191 (2016).\n62 S Hein and A Latz, _Electrochim Acta_, **201**, 354 (2016).\n63 M A Cabañero, J Altmann, L Gold, N Boaretto, J Müller, S Hein, J Zausch, J.\nKallo and A Latz, _Energy_, **171**, 1217 (2019).\n64 J Feinauer, S Hein, S Rave, S Schmidt, D Westhoff, J Zausch, O Iliev, A Latz,\nM Ohlberger and V Schmidt, _Journal of Computational Science_, **31**, 172 (2019).\n65 T Waldmann, M Wilka, M Kasper, M Fleischhammer and M WohlfahrtMehrens, _J Power Sources_, **262**, 129 (2014).\n66 J Remmlinger, S Tippmann, M Buchholz and K Dietmayer, _J Power Sources_,\n**254**, 268 (2014).\n67 M Petzl, M Kasper and M A Danzer, _J Power Sources_, **275**, 799 (2015).\n68 S S Zhang, K Xu and T Jow, _J Power Sources_, **160**, 1349 (2006).\n69 M Ouyang, Z Chu, L Lu, J Li, X Han, X Feng and G Liu, _J Power Sources_,\n**286**, 309 (2015).\n70 R C Bhardwaj, T Hwang and R M",
      "page_num": 43,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 600
    },
    {
      "text": "Hwang and R M Mank, Modulated, temperature-based multiCC-CV charging technique for Li-ion/Li-polymer batteries, in, Google Patents (2014).\n71 Y Itou and Y Ukyo, _J Power Sources_, **146**, 39 (2005).\n72 M W Verbrugge and B J Koch, _J Electrochem Soc_, **150**, A374 (2003).\n73 T Waldmann, M Kasper and M Wohlfahrt-Mehrens, _Electrochim Acta_, **178**, 525\n(2015).\n74 T R Garrick, J Gao, X Yang and B Koch, _Submitted to J Electrochem Soc._\n(2020).\n75 J.-i Yamaki, S.-i Tobishima, K Hayashi, K Saito, Y Nemoto and M Arakawa, _J_\n_Power Sources_, **74**, 219 (1998).\n76 P J Mohr, B N Taylor and D B Newell, _Journal of Physical and Chemical_\n_Reference Data_, **80**, 633 (2008).\n77 S Ahmed, I Bloom, A N Jansen, T Tanim, E J Dufek, A Pesaran, A Burnham,\nR B Carlson, F Dias and K Hardy, _J Power Sources_, **367**, 250 (2017).\n78 A Smith, J Burns and J Dahn, _Electrochem Solid St_, **13**, A177 (2010).\n79 J Burns, N Sinha, G Jain, H Ye, C M VanElzen, W Lamanna, A Xiao, E Scott,\nJ Choi and J Dahn, _J Electrochem Soc_, **159**, A1105 (2012).\n80 K Zachary M., M Eric J and M Bryan D., _Voltage Relaxation to Detect the Onset_\n_of Lithium Plating on Graphite for Fast Charging_ (2020).\n81 I D Campbell, M Marzook, M Marinescu and G J Offer, _J Electrochem Soc_,\n**166**, A725 (2019).\n82 K A Smith, _IEEE Control Systems Magazine_, **30**, 18 (2010).\n83 A Seaman, T.-S Dao and J McPhee, _J Power Sources_, **256**, 410 (2014).",
      "page_num": 43,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 516
    },
    {
      "text": "43 84 M Doyle, T F Fuller and J Newman, _J Electrochem Soc_, **140**, 1526 (1993).\n85 K E Thomas, J Newman and R M Darling, in _Advances in lithium-ion batteries_,\np 345, Springer (2002).\n86 K E Thomas and J Newman, _J Electrochem Soc_, **150**, A176 (2003).\n87 J S Newman and C W Tobias, _J Electrochem Soc_, **109**, 1183 (1962).\n88 J Newman and W Tiedemann, _AIChE Journal_, **21**, 25 (1975).\n89 J Newman and K E Thomas-Alyea, _Electrochemical systems_, John Wiley & Sons\n(2012).\n90 J S Dunning, D N Bennion and J Newman, _J Electrochem Soc_, **120**, 906 (1973).\n91 J S Dunning, D N Bennion and J Newman, _J Electrochem Soc_, **118**, 1251 (1971).\n92 M Tang, P Albertus and J Newman, _J Electrochem Soc_, **156**, A390 (2009).\n93 D Ren, K Smith, D Guo, X Han, X Feng, L Lu, M Ouyang and J Li, _J_\n_Electrochem Soc_, **165**, A2167 (2018).\n94 X M Liu, A Fang, M P Haataja and C B Arnold, _J Electrochem Soc_, **165**, A1147\n(2018).\n95 S Szabó, _International Reviews in Physical Chemistry_, **10**, 207 (1991).\n96 K Yan, Z Lu, H.-W Lee, F Xiong, P.-C Hsu, Y Li, J Zhao, S Chu and Y Cui,\n_Nature Energy_, **1**, 1 (2016).\n97 I Morcos, _Journal of Electroanalytical Chemistry and Interfacial Electrochemistry_,\n**66**, 250 (1975).\n98 T Tran and K Kinoshita, _Journal of Electroanalytical Chemistry_, **386**, 221 (1995).\n99 L Gasparotto, N Borisenko, N Bocchi, S Z El Abedin and F Endres, _Physical_\n_Chemistry Chemical Physics_, **11**, 11140 (2009).\n100 C A Paddon and R G Compton, _The Journal of Physical Chemistry C_, **111**, 9016\n(2007).\n101 Y Mo, Y Gofer, E Hwang, Z Wang and D A Scherson, _Journal of_\n_Electroanalytical Chemistry_, **409**, 87 (1996).\n102 M L Urquiza, M",
      "page_num": 44,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "L Urquiza, M Otero, G L Luque, D Barraco and E P Leiva, _Electrochim_\n_Acta_, **208**, 92 (2016).\n103 M K Datta, B Gattu, R Kuruba, P M Shanthi and P N Kumta, _J Power Sources_,\n**467**, 228243 (2020).\n104 M Verbrugge, D Baker and X Xiao, _J Electrochem Soc_, **163**, A262 (2016).\n105 M Verbrugge, D Baker, B Koch, X Xiao and W Gu, _J Electrochem Soc_, **164**,\nE3243 (2017).\n106 D R Baker and M W Verbrugge, _J Electrochem Soc_, **165**, A3952 (2018).\n107 D R Baker, M W Verbrugge and W Gu, _J Electrochem Soc_, **166**, A521 (2019).\n108 D R Baker and M W Verbrugge, _J Electrochem Soc_, **167**, 013504 (2019).\n109 H Zhang and M.-Y Chow, in _iEEE PES General Meeting_, p 1 (2010).\n110 S Abu-Sharkh and D Doerffel, _J Power Sources_, **130**, 266 (2004).\n111 R C Kroeze and P T Krein, in _2008 IEEE Power Electronics Specialists_\n_Conference_, p 1336 (2008).\n112 M Chen and G A Rincon-Mora, _IEEE transactions on energy conversion_, **21**, 504\n(2006).\n113 L Gao, S Liu and R A Dougal, _IEEE transactions on components and packaging_\n_technologies_, **25**, 495 (2002).\n114 F Baronti, G Fantechi, E Leonardi, R Roncella and R Saletti, in _IECON 2010-_\n_36th Annual Conference on IEEE Industrial Electronics Society_, p 2329 (2010).",
      "page_num": 44,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 445
    },
    {
      "text": "44 115 O Erdinc, B Vural and M Uzunoglu, in _2009 International Conference on Clean_\n_Electrical Power_, p 383 (2009).\n116 Y Hu, S Yurkovich, Y Guezennec and B Yurkovich, _Control Engineering_\n_Practice_, **17**, 1190 (2009).\n117 Y Hu, S Yurkovich, Y Guezennec and B Yurkovich, _J Power Sources_, **196**, 449\n(2011).\n118 L Lam, P Bauer and E Kelder, in _2011 IEEE 33rd International_\n_Telecommunications Energy Conference (INTELEC)_, p 1 (2011).\n119 J Zhang, S Ci, H Sharif and M Alahmad, in _2010 Twenty-Fifth Annual IEEE_\n_Applied Power Electronics Conference and Exposition (APEC)_, p 672 (2010).\n120 B Schweighofer, K M Raab and G Brasseur, _IEEE transactions on_\n_instrumentation and measurement_, **52**, 1087 (2003).\n121 H Chan, in _2000 IEEE Power Engineering Society Winter Meeting Conference_\n_Proceedings (Cat No 00CH37077)_, p 470 (2000).\n122 T Kim and W Qiao, _IEEE Transactions on Energy Conversion_, **26**, 1172 (2011).\n123 T Hu, B Zanchi and J Zhao, _IEEE Transactions on Energy Conversion_, **26**, 787\n(2011).\n124 E Kuhn, C Forgez, P Lagonotte and G Friedrich, _J Power Sources_, **158**, 1490\n(2006).\n125 E Karden, S Buller and R W De Doncker, _J Power Sources_, **85**, 72 (2000).\n126 S Buller, M Thele, R W De Doncker and E Karden, _IEEE Transactions on_\n_Industry Applications_, **41**, 742 (2005).\n127 S Buller, M Thele, E Karden and R W De Doncker, _J Power Sources_, **113**, 422\n(2003).\n128 V R Subramanian, V Boovaragavan and V D Diwakar, _Electrochem Solid St_, **10**,\nA255 (2007).\n129 V R Subramanian, V Boovaragavan, V Ramadesigan and M Arabandi, _J_\n_Electrochem Soc_, **156**, A260 (2009).\n130 V Ramadesigan, V Boovaragavan, J C Pirkle Jr and V R Subramanian, _J_\n_Electrochem Soc_, **157**, A854 (2010).\n131 P W Northrop, V",
      "page_num": 45,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "W Northrop, V Ramadesigan, S De and V R Subramanian, _J Electrochem Soc_,\n**158**, A1461 (2011).\n132 V Ramadesigan, K Chen, N A Burns, V Boovaragavan, R D Braatz and V R.\nSubramanian, _J Electrochem Soc_, **158**, A1048 (2011).\n133 L Cai and R E White, _J Electrochem Soc_, **156**, A154 (2008).\n134 M Guo and R E White, _J Power Sources_, **198**, 322 (2012).\n135 B Ng, P T Coman, W E Mustain and R E White, _J Power Sources_, **445**, 227296\n(2020).\n136 Y Dai, L Cai and R E White, _J Electrochem Soc_, **160**, A182 (2012).\n137 Y Dai, L Cai and R E White, _J Electrochem Soc_, **161**, E3348 (2014).\n138 X Jin, A Vora, V Hoshing, T Saha, G Shaver, R E García, O Wasynczuk and\nS Varigonda, _J Power Sources_, **342**, 750 (2017).\n139 Z Chu, G L Plett, M S Trimboli and M Ouyang, _Journal of Energy Storage_, **25**,\n100828 (2019).\n140 Y Yin, Y Hu, S.-Y Choe, H Cho and W T Joe, _J Power Sources_, **423**, 367 (2019).\n141 L Xia, E Najafi, Z Li, H Bergveld and M Donkers, _Appl Energ_, **208**, 1285 (2017).\n142 M Farag, M Fleckenstein and S Habibi, _J Power Sources_, **342**, 351 (2017).",
      "page_num": 45,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 417
    },
    {
      "text": "45 143 X.-B Meng, H.-X Li and H.-D Yang, _IEEE Transactions on Industrial_\n_Informatics_, **15**, 2838 (2018).\n144 A Rodríguez, G L Plett and M S Trimboli, _eTransportation_, **1**, 100009 (2019).\n145 A Farmann and D U Sauer, _Appl Energ_, **225**, 1102 (2018).\n146 A B Ansari, V Esfahanian and F Torabi, _Modares Mechanical Engineering_, **15**,\n43 (2016).\n147 Z Li, D Danilov, M Donkers and H J Bergveld, in _Proc 35th Benelux Meeting_\n_Syst Control_, p 43 (2016).\n148 S Yuan, L Jiang, C Yin, H Wu and X Zhang, _J Power Sources_, **352**, 245 (2017).\n149 A Subramaniam, S Kolluri, C D Parke, M Pathak, S Santhanagopalan and V R.\nSubramanian, _J Electrochem Soc_, **167**, 013534 (2019).\n150 X Zhao, Y Yin, Y Hu and S.-Y Choe, _J Power Sources_, **418**, 61 (2019).\n151 X Zhao, Y Bi and S.-Y Choe, _SAE International Journal of Alternative_\n_Powertrains_, **6** (2017).\n152 X Zhao, Y Bi, S.-Y Choe and S.-Y Kim, _Electrochim Acta_, **280**, 41 (2018).\n153 X Li, M Xiao and S.-Y Choe, _Electrochim Acta_, **97**, 66 (2013).\n154 B Ng, P T Coman, E Faegh, X Peng, S G Karakalos, X Jin, W E Mustain and\nR E White, _ACS Applied Energy Materials_, **3**, 3653 (2020).\n155 U R Koleti, C Zhang, R Malik, T Q Dinh and J Marco, _Journal of Energy_\n_Storage_, **24**, 100798 (2019).\n156 S P Rangarajan, Y Barsukov and P P Mukherjee, _Journal of Materials Chemistry_\n_A_, **8**, 13077 (2020).\n157 X Wu, W Wang and J Du, _International Journal of Energy Research_, **44**, 1775\n(2020).\n158 M Ecker, P S Sabet and D U Sauer, _Appl Energ_, **206**, 934 (2017).\n159 X Li, S.-Y Choe and W T",
      "page_num": 46,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 592
    },
    {
      "text": "Choe and W T Joe, _J Power Sources_, **294**, 545 (2015).\n160 Y Zhao, S.-Y Choe and J Kee, _Electrochim Acta_, **270**, 440 (2018).\n161 Y Bi, X Zhao and S.-Y Choe, in _2019 American Control Conference (ACC)_, p.\n3155 (2019).\n162 M Song and S.-Y Choe, _J Power Sources_, **436**, 226835 (2019).\n163 Y Yin and S.-Y Choe, _Appl Energ_, **271**, 115232 (2020).\n164 G H Florentino, Model Predictive Control Implementations for Management of\nLithium-ion Battery Cells and Packs Using Reduced-order Electrochemical Models, in,\nUniversity of Colorado Colorado Springs Kraemer Family Library (2018).\n165 V Ramadesigan, P W Northrop, S De, S Santhanagopalan, R D Braatz and V.\nR Subramanian, _J Electrochem Soc_, **159**, R31 (2012).\n166 V R Subramanian, V D Diwakar and D Tapriyal, _J Electrochem Soc_, **152**, A2002\n(2005).\n167 G G Botte, V R Subramanian and R E White, _Electrochim Acta_, **45**, 2595 (2000).\n168 M T Lawder, B Suthar, P W Northrop, S De, C M Hoff, O Leitermann, M L.\nCrow, S Santhanagopalan and V R Subramanian, _Proceedings of the IEEE_, **102**, 1014\n(2014).\n169 V Ramadesigan, V Boovaragavan, M Arabandi, K Chen, H Tsukamoto, R.\nBraatz and V Subramanian, _Ecs Transactions_, **19**, 11 (2009).\n170 Y Cao, S B Lee, V R Subramanian and V M Zavala, _Journal of Process Control_,\n**90**, 46 (2020).\n171 S Kolluri, S V Aduru, M Pathak, R D Braatz and V R Subramanian, _J_\n_Electrochem Soc_, **167**, 063505 (2020).",
      "page_num": 46,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 503
    },
    {
      "text": "46 172 S Alavi, C Birkl and D Howey, _J Power Sources_, **288**, 345 (2015).\n173 S Dey and B Ayalew, _Journal of Dynamic Systems, Measurement, and Control_,\n**139** (2017).\n174 G K Singh, G Ceder and M Z Bazant, _Electrochim Acta_, **53**, 7599 (2008).\n175 W Waag, S Käbitz and D U Sauer, _Appl Energ_, **102**, 885 (2013).\n176 M Singh, J Kaiser and H Hahn, _Batteries_, **2**, 35 (2016).\n177 J Schmalstieg, S Käbitz, M Ecker and D U Sauer, _J Power Sources_, **257**, 325\n(2014).\n178 M B Pinson and M Z Bazant, _J Electrochem Soc_, **160**, A243 (2012).\n179 M.-T von Srbik, M Marinescu, R F Martinez-Botas and G J Offer, _J Power_\n_Sources_, **325**, 171 (2016).\n180 H Lundgren, P Svens, H Ekström, C Tengstedt, J Lindström, M Behm and G.\nLindbergh, _J Electrochem Soc_, **163**, A309 (2015).\n181 T Waldmann, B.-I Hogg, M Kasper, S Grolleau, C G Couceiro, K Trad, B P.\nMatadi and M Wohlfahrt-Mehrens, _J Electrochem Soc_, **163**, A1232 (2016).\n182 M Mathew, S Janhunen, M Rashid, F Long and M Fowler, _Energies_, **11**, 1490\n(2018).\n183 K S Hariharan and V S Kumar, _J Power Sources_, **222**, 210 (2013).\n184 S Cho, H Jeong, C Han, S Jin, J H Lim and J Oh, _Computers & Chemical_\n_Engineering_, **41**, 1 (2012).\n185 Y Qi and S J Harris, _J Electrochem Soc_, **157**, A741 (2010).\n186 S.-C Yin, Y.-H Rho, I Swainson and L Nazar, _Chem Mater_, **18**, 1901 (2006).\n187 J Shu, _J Solid State Electr_, **13**, 1535 (2009).\n188 F Sagane, R Shimokawa, H Sano, H Sakaebe and Y",
      "page_num": 47,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 581
    },
    {
      "text": "Sano, H Sakaebe and Y Iriyama, _J Power Sources_,\n**225**, 245 (2013).\n189 L Gireaud, S Grugeon, S Laruelle, B Yrieix and J.-M Tarascon, _Electrochem_\n_Commun_, **8**, 1639 (2006).\n190 J Steiger, D Kramer and R Mönig, _Electrochim Acta_, **136**, 529 (2014).\n191 J Guo, Z Wen, M Wu, J Jin and Y Liu, _Electrochem Commun_, **51**, 59 (2015).\n192 K J Harry, D T Hallinan, D Y Parkinson, A A MacDowell and N P Balsara,\n_Nature materials_, **13**, 69 (2014).\n193 A Yermukhambetova, C Tan, S R Daemi, Z Bakenov, J A Darr, D J Brett and\nP R Shearing, _Scientific reports_, **6**, 35291 (2016).\n194 F Sun, L Zielke, H Markötter, A Hilger, D Zhou, R Moroni, R Zengerle, S.\nThiele, J Banhart and I Manke, _ACS nano_, **10**, 7990 (2016).\n195 D Zhang, A Forner-Cuenca, O O Taiwo, V Yufit, F R Brushett, N P Brandon,\nS Gu and Q Cai, _J Power Sources_, **447**, 227249 (2020).\n196 R F Ziesche, T Arlt, D P Finegan, T M Heenan, A Tengattini, D Baum, N.\nKardjilov, H Markötter, I Manke and W Kockelmann, _Nat Commun_, **11**, 1 (2020).\n197 B Key, R Bhattacharyya, M Morcrette, V Seznec, J.-M Tarascon and C P Grey,\n_Journal of the American Chemical Society_, **131**, 9239 (2009).\n198 F Chevallier, M Letellier, M Morcrette, J.-M Tarascon, E Frackowiak, J.-N.\nRouzaud and F Béguin, _Electrochem Solid St_, **6**, A225 (2003).\n199 M Letellier, F Chevallier and M Morcrette, _Carbon_, **45**, 1025 (2007).\n200 R Gerald Ii, C Johnson, J Rathke, R Klingler, G Sandı́ and L",
      "page_num": 47,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 587
    },
    {
      "text": "Klingler, G Sandı́ and L Scanlon, _J Power_\n_Sources_, **89**, 237 (2000).\n201 Y.-C Hsieh, M Leißing, S Nowak, B.-J Hwang, M Winter and G Brunklaus,\n_Cell Reports Physical Science_, 100139 (2020).",
      "page_num": 47,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 72
    },
    {
      "text": "47 202 M Leskes, G Kim, T Liu, A L Michan, F Aussenac, P Dorffer, S Paul and C.\nP Grey, _The Journal of Physical Chemistry Letters_, **8**, 1078 (2017).\n203 Y Jin, N.-J H Kneusels, P C Magusin, G Kim, E Castillo-Martínez, L E.\nMarbella, R N Kerber, D J Howe, S Paul and T Liu, _Journal of the American Chemical_\n_Society_, **139**, 14992 (2017).\n204 Y Jin, N.-J H Kneusels, L E Marbella, E Castillo-Martínez, P C Magusin, R.\nS Weatherup, E Jónsson, T Liu, S Paul and C P Grey, _Journal of the American_\n_Chemical Society_, **140**, 9854 (2018).\n205 M A Hope, B L Rinkel, A B Gunnarsdóttir, K Märker, S Menkin, S Paul, I.\nV Sergeyev and C P Grey, _Nat Commun_, **11**, 1 (2020).\n206 F Rosciano, M Holzapfel, W Scheifele and P Novák, _Journal of Applied_\n_Crystallography_, **41**, 690 (2008).\n207 M Roberts, J J Biendicho, S Hull, P Beran, T Gustafsson, G Svensson and K.\nEdström, _J Power Sources_, **226**, 249 (2013).\n208 T Kulova, A Skundin, E Nizhnikovskii and A Fesenko, _Russian Journal of_\n_Electrochemistry_, **42**, 259 (2006).\n209 G Feher and A Kip, _Physical Review_, **98**, 337 (1955).\n210 J H Pifer and R Magno, _Physical Review B_, **3**, 663 (1971).\n211 M Sathiya, J.-B Leriche, E Salager, D Gourier, J.-M Tarascon and H Vezin, _Nat_\n_Commun_, **6**, 1 (2015).\n212 A Niemöller, P Jakes, R.-A Eichel and J Granwehr, _Scientific reports_, **8**, 1 (2018).\n213 F J Dyson, _Physical Review_, **98**, 349 (1955).\n214 P Glover and P Mansfield, _Reports on progress in physics_, **65**, 1489 (2002).\n215 M Weiger, D Schmidig, S Denoth, C Massin, F Vincent, M",
      "page_num": 48,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 600
    },
    {
      "text": "Massin, F Vincent, M Schenkel and M.\nFey, _Concepts in Magnetic Resonance Part B: Magnetic Resonance Engineering: An_\n_Educational Journal_, **33**, 84 (2008).\n216 A Webb, _Concepts in Magnetic Resonance Part A: An Educational Journal_, **22**,\n25 (2004).\n217 G Maresch, M Mehring and S Emid, _Physica B+ C_, **138**, 261 (1986).\n218 M.-T F Rodrigues, G Babu, H Gullapalli, K Kalaga, F N Sayed, K Kato, J.\nJoyner and P M Ajayan, _nature energy_, **2**, 1 (2017).\n219 A Mistry, C Fear, R Carter, C T Love and P P Mukherjee, _ACS Energy Letters_,\n**4**, 156 (2018).\n220 R Carter, B Huhman, C T Love and I V Zenyuk, _J Power Sources_, **381**, 46\n(2018).\n221 F B Spingler, W Wittmann, J Sturm, B Rieger and A Jossen, _J Power Sources_,\n**393**, 152 (2018).\n222 Q Liu, D Xiong, R Petibon, C Du and J Dahn, _J Electrochem Soc_, **163**, A3010\n(2016).\n223 A Hsieh, S Bhadra, B Hertzberg, P Gjeltema, A Goy, J W Fleischer and D A.\nSteingart, _Energy & environmental science_, **8**, 1569 (2015).\n224 G Davies, K W Knehr, B Van Tassell, T Hodson, S Biswas, A G Hsieh and D.\nA Steingart, _J Electrochem Soc_, **164**, A2746 (2017).\n225 L Gold, T Bach, W Virsik, A Schmitt, J Müller, T E Staab and G Sextl, _J_\n_Power Sources_, **343**, 536 (2017).\n226 J B Robinson, M Maier, G Alster, T Compton, D J Brett and P R Shearing,\n_Physical Chemistry Chemical Physics_, **21**, 6354 (2019).",
      "page_num": 48,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 521
    },
    {
      "text": "48 227. Z. Deng, Z. Huang, Y. Shen, Y. Huang, H. Ding, A. Luscombe, M. Johnson and J.\nDahn.\n228. C. Bommier, W. Chang, Y. Lu, J. Yeung, G. Davies, R. Mohr, M. Williams and D.\nSteingart, _Cell Reports Physical Science_, 100035 (2020).\n229. W. Chang, R. Mohr, A. Kim, A. Raj, G. Davies, K. Denner, J. H. Park and D.\nSteingart, _Journal of Materials Chemistry A_, **8**, 16624 (2020).\n230. S. E. Renfrew and B. D. McCloskey, _Journal of the American Chemical Society_,\n**139**, 17853 (2017).\n231. B. D. McCloskey, A. Valery, A. C. Luntz, S. R. Gowda, G. M. Wallraff, J. M.\nGarcia, T. Mori and L. E. Krupp, _The journal of physical chemistry letters_, **4**, 2989 (2013).\n232. S. E. Renfrew and B. D. McCloskey, _ACS Applied Energy Materials_, **2**, 3762\n(2019).\n233. M. M. Ottakam Thotiyl, S. A. Freunberger, Z. Peng and P. G. Bruce, _Journal of the_\n_American Chemical Society_, **135**, 494 (2013).\n234. X.-G. Yang, G. Zhang, S. Ge and C.-Y. Wang, _Proceedings of the National_\n_Academy of Sciences_, **115**, 7266 (2018).",
      "page_num": 49,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 389
    }
  ],
  "total_chunks": 90,
  "created_at": "2026-02-04 15:53:43"
}