{
  "filename": "Preger_2020_J._Electrochem._Soc._167_120532.pdf",
  "chunks": [
    {
      "text": "Journal of The\nElectrochemical Society **OPEN ACCESS**",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 12
    },
    {
      "text": "To cite this article: Yuliya Preger et al 2020 J. Electrochem. Soc. 167 120532 View the [article online](https://doi.org/10.1149/1945-7111/abae37) for updates and enhancements. You may also like Bayesian cross-entropy methodology for\n~~optimal design of validation experiments~~\n~~X Jiang and S Mahadevan~~ Isothermal mass flow measurements in\n~~microfabricated rectangular channels ov~~ er\n~~a very wide Knudsen range~~\n~~John M Anderson, Matthew~~ W Moorman,\nJason R Brown et al. ECH pre-ionization and assisted startup in\n~~the fully superconducting KSTAR tokamak~~\n~~using second harmonic~~\n~~Y.S. Bae, J.H. Jeong, S~~ .I. Park et al. This content was downloaded from IP address 71.212.53.134 on 01/02/2026 at 02:50",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "Degradation of Commercial Lithium-Ion Cells as a Function of Chemistry and Cycling Conditions",
      "token_count": 210
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 15
    },
    {
      "text": "Yuliya Preger, [1][,][*][,][z] Heather M. Barkholtz, [1] Armando Fresquez, [2] Daniel L. Campbell, [3] Benjamin W. Juba, [4] Jessica Romàn-Kustas, [4] Summer R. Ferreira, [5] and\nBabu Chalamala [1][,][*] 1Energy Storage Technology and Systems, Sandia National Laboratories, Albuquerque, New Mexico, United States of\nAmerica\n2Advanced Power Sources R&D, Sandia National Laboratories, Albuquerque, New Mexico, United States of America\n3Statistical Sciences, Sandia National Laboratories, Albuquerque, New Mexico, United States of America\n4Materials Reliability, Sandia National Laboratories, Albuquerque, New Mexico, United States of America\n5Renewable and Distributed Systems Integration, Sandia National Laboratories, Albuquerque, New Mexico, United States of\nAmerica",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Degradation of Commercial Lithium-Ion Cells as a Function of Chemistry and Cycling Conditions",
      "token_count": 197
    },
    {
      "text": "Energy storage systems with Li-ion batteries are increasingly deployed to maintain a robust and resilient grid and facilitate the\nintegration of renewable energy resources. However, appropriate selection of cells for different applications is difficult due to\nlimited public data comparing the most commonly used off-the-shelf Li-ion chemistries under the same operating conditions. This\narticle details a multi-year cycling study of commercial LiFePO4 (LFP), LiNixCoyAl1−x−yO2 (NCA), and LiNixMnyCo1−x−yO2\n(NMC) cells, varying the discharge rate, depth of discharge (DOD), and environment temperature. The capacity and discharge\nenergy retention, as well as the round-trip efficiency, were compared. Even when operated within manufacturer specifications, the\nrange of cycling conditions had a profound effect on cell degradation, with time to reach 80% capacity varying by thousands of\nhours and cycle counts among cells of each chemistry. The degradation of cells in this study was compared to that of similar cells in\nprevious studies to identify universal trends and to provide a standard deviation for performance. All cycling files have been made\npublicly available at batteryarchive.org, a recently developed repository for visualization and comparison of battery data, to\nfacilitate future experimental and modeling efforts.\n© 2020 The Author(s). Published on behalf of The Electrochemical Society by IOP Publishing Limited. This is an open access\narticle distributed under the terms of the Creative Commons Attribution Non-Commercial No Derivatives 4.0 License (CC BY[NC-ND, http://creativecommons.org/licenses/by-nc-nd/4.0/), which permits non-commercial reuse, distribution, and reproduction](http://creativecommons.org/licenses/by-nc-nd/4.0/)\nin any medium, provided the original work is not changed in any way and is properly cited. For permission for commercial reuse,\n[please email: permissions@ioppublishing.org. [DOI: 10.1149/1945-7111/abae37]](https://doi.org/10.1149/1945-7111/abae37) Manuscript submitted May 27, 2020; revised manuscript received July 30, 2020. Published September 2, 2020. This was paper 605\npresented at the Dallas, Texas, Meeting of the Society, May 26–May 30, 2019. [Supplementary material for this article is available online](https://doi.org/10.1149/1945-7111/abae37)",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Degradation of Commercial Lithium-Ion Cells as a Function of Chemistry and Cycling Conditions",
      "token_count": 540
    },
    {
      "text": "[Supplementary material for this article is available online](https://doi.org/10.1149/1945-7111/abae37) Energy storage systems (ESS) consisting of Li-ion batteries are\nexpected to play a critical role in the integration of intermittent renewable\nenergy resources into the electric grid, as well as to provide back-up\npower and enhanced resiliency. [1][–][3] For applications in the electric grid,\nESS are expected to last for a decade or even longer. A typical MWh\nsystem may contain as many as 100,000 cells assembled into packs. To\nensure system safety and reliability, cells must be selected based on\napplication specific requirements and performance characteristics. Yet\nthere are few comparisons of popular commercial cells under similar\noperating conditions. In this work, we detail the cycling performance of\ncommercial LFP (LiFePO4), NCA (LiNixCoyAl1−x−yO2), and NMC\n(LiNixMnyCo1−x−yO2) cells with an 18650 form factor, in the broadest\nsuch comparison to be reported in a peer-reviewed publication.\nBattery specification sheets from manufacturers primarily focus\non safety metrics, such as current, voltage, and temperature bounds,\nwith limited information on performance metrics. Many publications\nin the open literature have examined the long-term performance and\naging of commercial Li-ion cells in order to fill this gap. There are\nnotable recent studies for each of the chemistries—LFP, [4][–][11] NCA, [6][,][10][,][12][–][14] and NMC, [6][,][15][–][17] —under calendar, constant current\nsquare wave cycle, and grid duty cycle aging. However, each of\nthese studies typically focuses on a single chemistry under a limited\nsubset of conditions to understand the influence of a particular\nvariable, such as temperature, or the emergence of a particular\ndegradation phenomena, such as Li plating.\nThe short-term cycling performance [18] and calorimetry [19] for the\ncells selected for the present study has been reported previously, and\nthis work is part of a broader effort at Sandia National Laboratories\nto characterize the safety and reliability of commercial Li-ion cells.",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "Degradation of Commercial Lithium-Ion Cells as a Function of Chemistry and Cycling Conditions",
      "token_count": 485
    },
    {
      "text": "This study examines the influence of temperature, depth of discharge\n(DOD), and discharge current on the long-term degradation of the\ncommercial cells. Cycling was carried out under constant current\nsquare wave duty cycles rather than grid duty cycles to better\nunderstand the contribution of specific and simple cycling conditions\nto the degradation process. Various metrics for comparing cell\ndegradation were investigated, including equivalent full cycle count,\ndischarge energy, and round-trip efficiency. The degradation of the\ncells in this study was compared to that of similar cells in previous\nstudies to provide a standard deviation for performance and facilitate\na more data-informed adoption of these batteries. Experimental Conditions Tested batteries.—The commercial 18650 cells examined in this\nwork were manufactured by the following companies: LFP from\nA123 Systems (Part #APR18650M1A, 1.1 Ah), NCA from\nPanasonic (Part #NCR18650B, 3.2 Ah), and NMC from LG Chem\n(Part #18650HG2, 3 Ah). The three batteries were selected because\nthey included common electrode formulations and were manufactured by reputable companies. Table I provides additional specifications for each cell, including the manufacturer-recommended operating bounds. According to inductively coupled plasma optical\nemission spectrometry (ICP-OES), the elemental composition of\nthe NMC cathode is Ni0.84Mn0.06Co0.1 (a Ni-enriched variant of\nNMC811). The NCA cathode is likely Ni0.81Co0.14Al0.05. A description of the ICP-OES procedure is provided below and the raw data is\n[given in Table SI (available online at stacks.iop.org/JES/167/](http://stacks.iop.org/JES/167/120532/mmedia)\n[120532/mmedia).](http://stacks.iop.org/JES/167/120532/mmedia) ICP-OES.—The elemental composition of the NCA and NMC\n*Electrochemical Society Member. cathodes was determined with an Avio 500 ICP-OES (Perkin Elmer)\n[zE-mail: ypreger@sandia.gov](mailto:ypreger@sandia.gov) equipped with a type K1 concentric nebulizer and baffled cyclonic",
      "page_num": 3,
      "chunk_index": 4,
      "section_name": "Degradation of Commercial Lithium-Ion Cells as a Function of Chemistry and Cycling Conditions",
      "token_count": 493
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Table I. Commercial 18650-format lithium-ion battery manufacturer-specified operating bounds. Battery LFP NCA NMC Nominal Capacity (Ah) 1.1 3.2 3\nNominal Voltage (V) 3.3 3.6 3.6\nVoltage Range (V) 2 to 3.6 2.5 to 4.2 2 to 4.2\nMax Discharge Current (A) 30 6 20\nAcceptable Temperature (°C) −30 to 60 0 to 45 −5 to 50\nNominal Mass (g) 39 48.5 47 spray chamber. The instrument parameters were as follows: RFpower 1500 W, 15 L-Ar min [−][1] plasma flow, 0.7 L-Ar min [−][1] nebulizer flow, and 0.2 L-Ar min [−][1] auxiliary gas flow. Prior to\nanalysis, samples of the active material on the Al current collector\nwere digested using a Mars 6 (CEM Corporation) extraction system.\nMicrowave digestion was carried out in two steps, with the first\nconsisting of the addition of sulfuric acid (5 ml) to 0.03–0.05 g of\ncathode sample in a Teflon microwave vessel. Samples were heated\nfor 0.5 h until they reached a temperature of 260 °C (maximum\nmicrowave power, 1800 W) and held at that temperature for 0.25 h.\nFollowing cooling and depressurization, hydrochloric acid (3 ml)\nand nitric acid (3 ml) were added to the Teflon vessel and a second\nmicrowave digestion cycle was completed as follows: 0.5 h ramp\nto 200 °C (maximum microwave power, 1800 W) followed by a\nhold at that temperature for 10 min. Sample digests were then diluted\nto 50 ml. These digests were then diluted once more with addition\nof an yttrium internal standard. Samples were analyzed along\nwith standard elemental reference materials (Inorganic Ventures).\nThe following background-corrected emission lines were chosen\nfor evaluation due to optimal performance: Li (670.784 nm),\nNi (231.604 nm), Co (228.616 nm), Mn (257.610 nm), and Al\n(396.153 nm).",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 530
    },
    {
      "text": "Cycling equipment.—Cycle aging was carried out using an Arbin\nSCTS and an Arbin high-precision (Model: LBT21084) multichannel battery testing system. Individual cells were placed into\ncommercially available 18650 battery holders (Memory Protection\nDevices). The holders were connected to the Arbin with 18 gauge\nwire and the cable lengths kept below eight feet to minimize voltage\ndrop. During cycling, the cells were placed in SPX Tenney Model\nT10C-1.5 environmental chambers, which can be controlled between\n−73 °C and 200 °C. A K- or T-type thermocouple was attached to\nthe skin of each cell under test with Kapton tape to monitor the cell\nskin temperature. Cycle aging protocol.—At the start of the study, the as-received\ncells were placed in thermal chambers for a day to equilibrate to the\ndesired cycling temperatures. Then, the cells were discharged. Each\nround of cycling consisted of a capacity check, some number of\ncycles at the designated conditions for that cell, and another capacity\ncheck at the end (Scheme 1). The capacity check consisted of three\ncharge/discharge cycles from 0%–100% SOC at 0.5C (a rate of 1C\ncorresponds to the current that will discharge the full capacity of a\nbattery in one hour). 100% SOC is defined as the capacity obtained\nat a 0.5C constant current charge with a current taper to 0.05 A to the\nmaximum manufacturer-specified charging voltage. The same capacity check protocol was employed for all cells in the study. Scheme 1. Structure of cycle aging study. A round of cycling for each cell varied from 125 to 1000 cycles,\ndepending on the rate of degradation at the specific test conditions.\nThe cycle count for a round was halved if a cell experienced over 5%\ncapacity loss in the previous round. These adjustments were\nintended to offer enough granulation in the capacity decline curve\nto enable observation of any changes in mechanism, while still\nmaintaining a reasonable check-up frequency during a nearly threeyear study. Electrochemical impedance spectroscopy (EIS) was\ncompleted at intervals of approximately 3% capacity loss, and these\nresults will be expanded upon in a future publication. For the\npurpose of this publication, the study was considered complete once\na cell reached 80% of its initial capacity.\nSeveral abort guidelines were built into the cycling program to\navoid potentially abusive conditions for the cells. Cycling was\nautomatically stopped if the cell charge or discharge voltage was\nmore than 0.05 V outside of voltage range limits, and if the cell ever\nexceeded the manufacturer-specified temperature.",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 574
    },
    {
      "text": "Study conditions.—Table II illustrates the combinations of\ntemperatures, DOD, and discharge currents examined in this study.\nThese values were selected according to a design of experiment\napproach in order to cover a broad range of manufacturer-recommended parameter space and to identify the general dependence on\neach variable. To ensure repeatability, each test was performed with\nat least two cells.\nThe nominal capacities of the cells were used as references for\ncalculating C-rates. All cells were charged at a rate of 0.5C, per\nmanufacturer guidance. Unlike the other cells, NCA cells were not\ndischarged at 3C since the required current, 9 A, is outside of\nmanufacturer specifications. Cells were cycled at 40%–60% SOC\nusing a constant current (CC) protocol based on capacity limits.\nCells were cycled at 20%–80% SOC with a CC protocol using\nvoltage limits established from the discharge capacity curves of fresh\ncells. Cells cycling at 0%–100% SOC were charged using a constant\ncurrent constant voltage (CCCV) protocol, with a current taper to\n0.05 A. For the 100% DOD regime, LFP cells were cycled from 2 to\n3.6 V, NCA cells from 2.5 to 4.2 V, and NMC cells from 2 to 4.2 V.\nThe cycling programs were not adjusted over the course of the study\nas the cells aged and the SOC labels are based on discharge curves\nfrom the fresh cells. Results and Discussion General analysis.—The lifetime performance of a battery\ndepends on complex physico-chemical processes influenced by\nmany operating variables. This study considered the influence of\nthree of the variables most readily controlled during operation—\ntemperature, DOD, and discharge rate. In Figs. 1 and 2, the cells are\ncompared based on their capacity retention, discharge energy\nthroughput, and round-trip efficiency (RTE), evaluations that are\nuseful for both laboratory research and field implementation.\nFigure 1 illustrates the discharge capacity retention vs equivalent\nfull cycle (EFC) count for all cells in the experimental matrix to\npresent an overall picture of cycle-induced aging. In this work, one\nEFC is based on the nominal capacity of the cell. Therefore, for each\ncell, the total capacity throughput was divided by the nominal\ncapacity to get the total equivalent full cycle count. The LFP cells\nexhibit substantially longer cycle life spans under the examined\nconditions: 2500 to 9000 EFC vs 250 to 1500 EFC for NCA cells\nand 200 to 2500 EFC for NMC cells. Most of the LFP cells had not\nreached 80% capacity by the conclusion of this study for the NCA",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 596
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Table II. Test matrix for all chemistries [a][)] . DOD, Temperature, Discharge Rate [b][)] 40%–60%, 25 °C, 0.5C 0%–100%, 15 °C, 1C 0%–100%, 15 °C, 2C 40%–60%, 25 °C, 3C\n20%–80%, 25 °C, 0.5C 0%–100%, 25 °C, 1C 0%–100%, 25 °C, 2C 20%–80%, 25 °C, 3C\n0%–100%, 25 °C, 0.5C 0%–100%, 35 °C, 1C 0%–100%, 35 °C, 2C 0%–100%, 25 °C, 3C a) The cycling conditions noted in the test matrix were applied to LFP and NMC cells. NCA cells were not subjected to any cycling conditions that included a\n3C discharge rate, which is outside of the manufacturer-specified current limits for that cell. b) All cells were charged at a rate of 0.5C. Round-trip efficiency, another important metric for technoeconomic evaluation of LiBs, is shown in Fig. 2c. [22] The RTE for a cycle\nwas calculated by dividing the discharge energy by the charge\nenergy. A single RTE is often assumed for economic evaluations;\nhowever, RTE depends substantially on the cycling conditions,\nincluding the charge/discharge rate, temperature, SOC, and rest time.\nThe LFP cells show higher RTEs than NCA and NMC cells at all\nconditions, though the differences are minimized at lower discharge\nrates. The NCA cells exhibited particular sensitivity to higher\ndischarge rates, with RTEs dropping 5%–10% for an increase in\ndischarge rate from 1C to 2C at all temperatures. The decrease in\nRTE across all cycling conditions as the cells reach 80% capacity is\nattributed to the increase in cell resistance as the SEI layer grows. Figure 1. Discharge capacity retention for all LFP (blue), NMC (black), and\nNCA (red) cells relative to the initial capacity of each individual cell. Circles\nare data points from the capacity check at the conclusion of each round of\ncycling and lines are a guide to the eye.",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 544
    },
    {
      "text": "Figure 1. Discharge capacity retention for all LFP (blue), NMC (black), and\nNCA (red) cells relative to the initial capacity of each individual cell. Circles\nare data points from the capacity check at the conclusion of each round of\ncycling and lines are a guide to the eye. and NMC cells, and their longer-term degradation will be reported in\na later work. The spread in the data for each of the chemistries\nindicates that even within the manufacturer-specified operating\nbounds there is significant dependence on the specific cycling\nconditions. Irrespective of the testing conditions, all cells exhibited\nprimarily linear degradation behavior, with slightly more rapid fade\nat the beginning and end of cycling. This behavior is in agreement\nwith previous models of lithium-ion battery degradation which\npropose three phases of capacity fade [20][,][21] :\nPhase 1: Sudden drop in capacity as Li is consumed during SEI\nformation\nPhase 2: Linear degradation, generally associated with loss of Li\ninventory in side reactions\nPhase 3: Rapid capacity fade as the cell fails, often attributed to\nan impedance increase\nFigure 2a indicates the EFC for each cell to reach 80% capacity\nunder the given cycling conditions. Though cells may be used\nbeyond 80% capacity in grid applications, this value is a useful\nbenchmark as it is often the reference used by manufacturers in\nspecification sheets to indicate end of life. For LFP cells that have\nnot yet reached 80% capacity, the lifetime was extrapolated based on\nthe present (linear) degradation rate. Among the three chemistries,\nthere is no universal dependence on temperature, DOD, or discharge\nrate. A more systematic analysis of variable dependence is presented\nbelow.\nThough EFC is typically the metric by which batteries are\ncompared, cumulative discharge energy may offer more value for\nfield implementation. The EFC may mask degradation differences\narising in batteries with different capacity and voltage ranges.\nFigure 2b indicates the cumulative discharge energy for a cell under\neach set of cycling conditions at 80% capacity retention. This value\nwas calculated by summing the energy from each individual\ndischarge of the cell. The performance differences between the\nthree chemistries were minimized once the analysis factored in the\nlower capacity and voltage of the LFP cells (see Table I).",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 502
    },
    {
      "text": "Capacity fade dependence on cycling variables.— Temperature\ndependence.—Figures 3a–3c show a subset of cycling conditions for\neach chemistry where only the oven temperature was varied\n(additional plots in Fig. S1). The capacity fade rate increased with\nincreasing temperature for LFP cells but decreased for NMC cells.\nThe NCA cells did not exhibit a strong temperature dependence in\nthe examined range. Different temperature dependences suggest\ndifferent dominant degradation mechanisms. Though not observed in\nthis study, the transition between degradation mechanisms within a\nsingle cell was previously documented by Waldmann et al. [23] An\nArrhenius plot from their work on 18650 NMC/LMO-graphite cells\nis reproduced in Fig. 4. Below 25 °C, the dominant aging mechanism\nwas Li plating, confirmed by observation of metallic Li. Deposition\nof Li onto the graphite anode can occur in parallel to intercalation\nwhen the anode potential drops below 0 V vs Li/Li [+] (promoted by\nfactors such as increasing SOC, increasing charge rate, and lower\ntemperature). [24] Above 25 °C, the dominant mechanism was SEI\n(solid-electrolyte interphase) growth, confirmed by post-mortem\ncharacterization of SEI thickness on the anodes and correlated to\nresistance increases in the whole cells. The SEI is formed from the\ndecomposition products of electrolyte solvent and Li salt, a reaction\naccelerated by increasing temperature. [25] Previous studies of temperature dependence may not have observed the transition between\nthe two degradation mechanisms in the same cell because they did\nnot consider a sufficiently broad temperature range.\nThe capacity fade data for NMC and LFP cells from the present\nstudy was fit in the linear region (after the initial period of rapid\ncapacity fade) to obtain aging rates as a function of temperature.\nComparison to the previously reported NMC-LMO data indicates\nthat the tipping point between different mechanisms (the point of\nminimal degradation in Fig. 4) varies substantially with the\nchemistry (Table III). For example, previous reports on cycle aging\nof LFP cells indicate a tipping point at temperatures of 5 °C–10 °C,\nwith degradation rates increasing both above and below this\ntemperature. [26] Studies of LFP cells that considered temperatures\nonly above 20 °C observed the capacity fade increase with\nincreasing temperature (consistent with the present work). [27][–][29]",
      "page_num": 5,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 521
    },
    {
      "text": "Studies of NMC cells consistently indicate a tipping point around\n35 °C. One report found that minimal capacity fade for NMC cells in\ncycle aging followed 35 °C > 50 °C > 25 °C [16] and several others\nfound a lower capacity fade rate at 45 °C than 20 °C. [17][,][30] In contrast\nto LFP and NMC cells, the NCA cells did not exhibit a strong\ntemperature dependence in the range of 15 °C to 35 °C (Fig. 3c).",
      "page_num": 5,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 120
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 This behavior is consistent with a previous publication wherein the\ncapacity fade rate of commercial NCA cells increased below 25 °C\n(due to Li plating) but did not vary significantly between 25 °C and Figure 2. (a) Equivalent full cycle (EFC)\ncount at 80% capacity for all cells and cycling\nconditions. Each bar represents the average\nEFC for all cells cycled at that condition. The\nvalues for individual cells are noted with a\n“+”. If a bar does not include values for\nindividual cells, then those cells have not yet\nreached 80% capacity and the indicated EFC\nis extrapolated based on the present degradation rate for those cells. (b) Cumulative\ndischarge energy at 80% capacity for all cells\nand cycling conditions. Each bar represents\nthe average discharge energy for all cells\ncycled at that condition. (c) Round-trip efficiency (RTE) for all cells and cycling conditions. Each bar represents the average initial\nRTE for all cells cycled at that condition. The\nRTE at the end of the study is indicated with a\ndot. If a bar does not include a dot, then those\ncells have not yet reached 80% capacity. 60 °C. [12] The study did not incorporate materials characterization to\nexplain this lack of temperature dependence, although the authors\nproposed that the manufacturer had optimized the cell for high",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 315
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Figure 3. Discharge capacity fade as a function of (a)–(c) temperature, (d)–(f) DOD, and (g)–(i) discharge rate for all chemistries. For each plot, all conditions\nother than the variable of interest were unchanged. Symbols are data points from the capacity check at the conclusion of each round of cycling and lines are a\nguide to the eye. (a)–(c) are at 1C discharge and 0%–100% SOC. (d)–(f) are at 0.5C discharge and 25 °C. (g)–(i) are at 0%–100% SOC and 25 °C. Note the\ndifferent endpoints on the x-axes. temperature. Li plating can occur only during charging; thus, SEI\ngrowth is the dominant degradation mechanism during calendar\naging, with increasing temperatures accelerating the reaction of\nelectrolyte solvent and Li salt. Depth of discharge dependence.—For all cells in this study, the\nrate of capacity fade increased with an increasing depth of discharge\n(Figs. 3d–3f). Greater volume change in the graphite during (de)\nintercalation increases stress and microcracks. [17][,][43] Newly-formed\ncracks enable further reaction between the electrolyte and Li, leading\nto more SEI formation, loss of Li inventory, and capacity fade. Some\nstudies have shown that only the width of the voltage window\nmatters. [35] In others, the specific placement of the voltage window\nwas significant, a phenomenon variously attributed to: Figure 4. Arrhenius plot for the capacity fade rate of cells. The solid lines\ncorrespond to linear fits of the data. Black corresponds to data from\nWaldmann et al. [23] on 18650 NMC-LMO cells cycled at 1C in a temperature\nrange of −20 °C to 70 °C. Data from the present study for cells cycled at\n0%–100% SOC with a 1C discharge rate is shown in red for NMC cells and\nblue for LFP cells. temperature operation. A more recent study of comparable NCA\ncells identified slightly higher degradation at 25 °C than 60 °C. [31]",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 507
    },
    {
      "text": "temperature operation. A more recent study of comparable NCA\ncells identified slightly higher degradation at 25 °C than 60 °C. [31] While the tipping point temperature will certainly be influenced\nby other cycling conditions, the 30 °C gap in preferred conditions for\nLFP and NMC cells has implications for best practices in battery\nthermal management as well as the development of accurate\ndegradation models. Many models assume optimal performance at\n25 °C with higher temperatures only accelerating SEI formation. It\nshould be noted that the above analysis only applies to cycle aging\nstudies. For calendar aging studies across LFP, [6][,][9] NCA, [6] and\nNMC [6][,][15] cells, capacity fade consistently decreased with decreasing (1) transition between graphite stages (at specific voltages) with\ndiffering lattice parameters enhancing cracking and SEI\nformation, [15] or\n(2) slow Li diffusion at particular voltages leading to Li build-up\nand graphite particle fracturing [36] The results of the present study cannot be used to address this\ndiscrepancy as the mid-point of the depth of discharge window was\nnot varied.\nCompared to LFP [7][,][33][,][34] cells, the NCA [35][–][37] and NMC [15][,][17][,][38][,][39] cells experienced a more dramatic transition in capacity fade from\npartial to complete DOD and this result is consistent with previous\nstudies. This transition could be attributed to the metal oxide\ncathodes’ higher operating voltages (100% SOC corresponds to\n4.2 V for NCA and NMC vs 3.6 V for LFP), which could promote\nelectrolyte oxidation. [44][,][45] A separate study of LFP cathode half cells\ncharged to different voltages (with an electrolyte of 1 M LiPF6 in\nEC:DEC 1:1 weight ratio) showed optimal performance at 3.9 V vs\nLi/Li [+], with no difference in long-term cycling degradation between",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 451
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Table III. Summary of studies examining temperature, depth of discharge, and discharge rate dependence in commercial cells (cylindrical format,\nunless otherwise noted). Chemistry Reference Other Conditions [a][)] Performance [b][)]",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 59
    },
    {
      "text": "Table III. Summary of studies examining temperature, depth of discharge, and discharge rate dependence in commercial cells (cylindrical format,\nunless otherwise noted). Chemistry Reference Other Conditions [a][)] Performance [b][)] Temperature (°C)\n27 0%–100%, 1C/1C 25 > 40 > 50 > 60\n28 0%–100%, 1C/3C 25 > 55\nLFP 32 [c][)] 0%–100%, 1C/1C 5 > −5 > 12 > −20 > 30\n29 [c][)] 2.2–3.65V, 1C/1C 25 ∼ 35 > 45 > 55 > 65\nthis work 0%–100%, 0.5C/1C 15 > 25 > 35\n12 0%–100%, 0.5C/0.5C 25 ∼ 30 ∼ 40 ∼ 50 ∼ 60 > 20 > 15 > 5 > 0\nNCA 31 2.5–4.2 V, 0.64C/0.64C 60 > 25\nthis work 0%–100%, 0.5C/1C 15 ∼ 25 ∼ 35\n23 0%–100%, 1C/1C 25 > 50 > 60 > 70 ∼ 0 > −10 > −20\n16 3.0–4.2 V, 0.5C/1C 35 > 50 > 25\nNMC 30 2.75–4.2 V, 1C/1C 45 > 20\n17 various 45 > 20\nthis work 0%–100%, 0.5C/1C 35 > 25 > 15\nDepth of Discharge (% or V)\n33 60 °C, 0.5C/0.5C 45–55 ∼ 40–60 ∼ 25–75 ∼ 10–90 ∼ 5–95\n34 30 °C, 1C/1C 47.5–52.5 > 20–80 ∼ 0–100 > 45–55 > 35–65 ∼ 25–75\nLFP 7 40 °C, 1C/1C 45–55 ∼ 25–75 ∼ 0–100\nthis work 25 °C, 0.5C/1C 40–60 > 20–80 ∼ 0–100\n35 25 °C, 1C/1C 0–60 ∼ 10–70 ∼ 40–100 > 0–100\nNCA 36 [c][,][d][)] 40 °C, 0.5C/0.5C 3.4–4.0 > 3.0–4.0 > 3.0–4.1 > 3.6–4.2 > 3.4–4.2 > 3.0–4.2 > 3.0–4.3\n37 30 °C, 0.3C/1C 40–60 > 25–75 ∼ 10–90 > 0–100\nthis work 25 °C, 0.5C/1C 40–60 > 20–80 > 0–100\n17 20 °C, 1C/1C 37.5–62.5 > 0–100 > 25–75 > 10–90 > 20–80 ∼ 5–95\n15 35 °C, 1C/1C 47.5–52.5 > 45–55 > 40–60 > 25–75 > 10–90 ∼ 0–100\nNMC 38 [d][)] 25/35/45 °C, 0.33C/1C 40–60 ∼ 32.5–67.5 ∼ 25–75 > 17.5–82.5 > 10–90 > 0–100\n39 [d][)] 25 °C, 6C/6C 0–20 > 20–40 ∼ 40–60 ∼ 60–80 > 80–100 > 0–100\nthis work 25 °C, 0.5C/1C 40–60 > 20–80 > 0–100\nDischarge Rate (C-rate)\n40 25 °C, 0%–100%, 0.5C 0.04C > 0.2C ∼ 0.5C > C > 2C\nLFP 41 [d][)] 25 °C, 2.5–3.7 V, 0.5C 0.2C > 1C > 2C > 3C > 4C > 5C\nthis work 15/25/35 °C, 0%–100%, 0.5C 0.5C ∼ 1C ∼2C > 3C\nNCA 42 25 °C, 2.5–4.2 V, 0.5C 2C > 1.5C\nthis work 15/25/35 °C, 0%–100%, 0.5C 2C > 1C > 0.5C\n17 0%–100%, 1C 1C > 2C at 20 °C; 1C ∼ 2C at 45 °C\nNMC 38 [d][)] 35 °C, 10%–90%, 0.33C 0.33C ∼ 1C ∼ 2C\n32 22 °C, 2.75–4.2 V, 0.5C 1C > 3C\nthis work 15/25/35 °C, 0%–100%, 0.5C no systematic dependence",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 1351
    },
    {
      "text": "a) Cycling conditions held constant listed in the order of: temperature, depth of discharge given as SOC or voltage range, and charge/discharge rate. b) Better\nperformance corresponds to a lower degradation rate. c) Non-commercial. d) Pouch or prismatic format. maximum voltages of 3.6 and 4.2 V. [46] These results suggest that the\nelectrochemical cycling behavior of LFP cathodes charged with\ndifferent upper voltage limits merits further exploration, as the\nresults could vary with the cell manufacturing and electrolyte\ncomposition. Irrespective of chemistry, in calendar aging studies,\ncapacity fade consistently increased with SOC, as lower anode\npotentials enhance electrolyte reduction and Li incorporation into the\ngrowing SEI. As in cycle aging studies, NCA and NMC cells\nexhibited particularly rapid capacity fade at 100% SOC. [6] Discharge rate dependence.—Higher discharge rates are expected to accelerate capacity fade due to increased stress on the\nelectrodes from rapid volume change. [32][,][40][,][41] In Figs. 3g–3h, the\ndischarge rate dependence for NMC and LFP cells appears low.\nHowever, for NCA cells, capacity fade decreased with increasing\ndischarge rate (Fig. 3i). Wei et al. observed the same trend and\nattributed it to increased impedance for cells cycled at lower\ndischarge rates (a physical explanation for this phenomenon was not\noffered). [42] It is possible that the higher discharge rate may increase\ncell self-heating (Table SII), leading to improved performance; but,\nthe NCA cells did not exhibit a particularly strong temperature\ndependence. It is also possible that the shorter period of cycling needed to complete discharge (1 h for 1C vs 0.5 h for 2C) can\nminimize the degree of calendar aging over the course of hundreds\nof cycles. Figure S2 shows the capacity fade with respect to time\nspent cycling rather than EFC and the gap between cells at different\ndischarge rates is slightly reduced. It is unclear why the NCA cells\nare more strongly influenced by the discharge rate than the other\nchemistries.",
      "page_num": 8,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 465
    },
    {
      "text": "needed to complete discharge (1 h for 1C vs 0.5 h for 2C) can\nminimize the degree of calendar aging over the course of hundreds\nof cycles. Figure S2 shows the capacity fade with respect to time\nspent cycling rather than EFC and the gap between cells at different\ndischarge rates is slightly reduced. It is unclear why the NCA cells\nare more strongly influenced by the discharge rate than the other\nchemistries. Analysis of variance.—The cycling data was further examined by\nanalysis of variance (ANOVA) to more precisely quantify which\nconditions contribute to degradation. This also enabled consideration\nof all cells at once, unlike the variable dependence in previous\nsections, which only considered systematic variation of single\nvariables. The output variable of interest, % initial capacity, had\nbeen measured at different cycle counts across the separate experiments. Therefore, to enable comparison of % capacity at a specific\nEFC with respect to the factors of interest, regression fits of %\ncapacity vs EFC data were performed for all cells. Occasionally,\nlinear or quadratic fits were used, but in most cases a cubic fit was\nbest. Interpolation was completed only within the range of real data\nvalues. General linear models were fit and ANOVA was performed\nat 200 EFC (before most of the NCA and NMC cells had reached",
      "page_num": 8,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 281
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 80% capacity). Three of the four individual factors (cell chemistry,\ndischarge rate, and SOC range) were found to be significant in\nexplaining variability in % capacity. The p values from ANOVA\n(Table SIII) are below the chosen significance level of 0.05.\nAdditionally, there was a significant interaction between cell\nchemistry and SOC range, and cell chemistry and temperature.\nResidual plots (Fig. S3) from this model fit show that the assumptions of randomness, constant variance, and normally distributed\nresiduals are all reasonable. In addition, no concerning patterns are\nseen.\nFigure 5 shows the main effects and interactions plot for all four\nfactors at 200 EFC, demonstrating the importance of not drawing\ngeneral conclusions about variable dependence for different chemistries. Across all of the tested cells, the % capacity does not change\nsystematically across discharge rate and temperature (Figs. 5b, 5d).\nCell chemistry and SOC range have larger effects across their\nrespective levels (Figs. 5a, 5c). For example, at the same EFC, LFP\ncells have retained on average 7% more capacity than NCA cells and\n9% more capacity than NMC cells. Several factors are involved in\nsignificant interactions with each other. Figure 5f shows that the\nSOC range affects % capacity for the NCA and NMC cells similarly\n(5%–10% lower at 0%–100%), but SOC range has little effect on the\ncapacity for LFP cells. Additionally, temperature affects % capacity\nfor NMC and LFP cells in opposing trends (Fig. 5g). The NMC cells\nlikely exhibit a less systematic trend between 15 and 35 °C because\nthis analysis factors in all of the cells at 25 °C cycled at intermediate\nSOCs, while Figs. 3b and 4 focused exclusively on the influence of\ntemperature.",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 425
    },
    {
      "text": "Consistency of literature cycling data.—Battery degradation\nmodels and conclusions about the performance of particular chemistries are often based on a single data set. To probe the validity of\nthis approach, the degradation of the cells in this study was\ncompared to that of similar commercial 18650 cells examined in\nprevious studies. Figure 6 shows a subset of these comparisons and\nthe rest are given in Fig. S4. Degradation data for cells from the\nsame manufacturer appears consistent across publications, even\nthose separated by several years (Figs. 6b, 6c). However, for cells\nfrom different manufacturers sometimes the degradation rate is the\nsame (Fig. 6e) and sometimes it is not (over three times difference in\ncycle count to 80% capacity in Fig. 6f). These differences suggest\nthat lifetime prognostics based on a particular cell from a particular\nmanufacturer cannot be broadly extrapolated, even to other cells\nwith the same standard form factor, chemistry, and capacity. Subtle\nvariations in materials, such as electrolyte composition, can substantially impact battery lifetime (though that level of detail\nwould not be available on a basic battery specification sheet).\nEmpirical battery degradation models would benefit from the\nincorporation of larger data sets and reporting values with a standard\ndeviation to give users a better sense of the true lifetime of these\ncells. However, the analysis above, particularly the comparison in\nTable III, shows that even though precise lifetimes may differ,\nvariable dependence trends are broadly consistent within a particular\nchemistry. Conclusions Commercial Li-ion batteries based on NMC, NCA, and LFP\nchemistries were cycled with varying temperature, depth of discharge, and discharge rate. The capacity and discharge energy\nretention, as well as the round-trip efficiency, were compared. The\ndependence on each cycling variable was analyzed qualitatively as\nwell as by analysis of variance. Key insights from this work include:",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 413
    },
    {
      "text": "Commercial Li-ion batteries based on NMC, NCA, and LFP\nchemistries were cycled with varying temperature, depth of discharge, and discharge rate. The capacity and discharge energy\nretention, as well as the round-trip efficiency, were compared. The\ndependence on each cycling variable was analyzed qualitatively as\nwell as by analysis of variance. Key insights from this work include: (1) Even within manufacturer specified operating ranges, the\nequivalent full cycle count at 80% capacity varied up to\nthousands of cycles depending on the conditions.\n(2) LFP cells had the highest cycle lifetime across all conditions,\nbut this performance gap was reduced when cells were\ncompared according to the discharge energy throughput. The\nlatter metric factored in the lower capacity and lower voltage of\nthe LFP cells, illustrating the importance of identifying the\nappropriate metrics for each application.\n(3) The RTE can vary up to 10% among fresh cells depending on the\ncycling conditions and can decrease over 5% as a cell ages. LFP\ncells generally had higher RTEs at all conditions and for all cells,\nRTE consistently decreased with increasing discharge rate.\n(4) Based on the current work and a review of previous commercial\ncell studies, trends in temperature, depth of discharge, and\ndischarge rate dependence are chemistry specific. Variable\ndependence in one chemistry should not be broadly extrapolated\nto all lithium-ion batteries.\n(5) In the 15 °C to 35 °C temperature range, the capacity fade rate\nincreased with increasing temperature for LFP cells but decreased for NMC cells, indicating different dominant degradation mechanisms. These results illustrate the value of varying\nmultiple temperatures within a normal operating range rather\nthan looking solely at extreme temperatures. The gap in\npreferred conditions for LFP and NMC cells has implications\nfor battery thermal management. A survey of the literature and Figure 5. Main effects (a)–(d) and interactions (e)–(g) plots for model fit at 200 EFC. Mean % capacity refers to the average value for all cells at the specified\nconditions at 200 EFC. This value is derived from regression fits of the % initial capacity vs EFC data shown earlier since the % initial capacity of all cells had\nbeen measured at slightly different cycle counts across the separate experiments.",
      "page_num": 9,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 489
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Figure 6. Comparison of battery cycling capacity fade across studies. The chemistry and cycling conditions, given as DOD, temperature, and charge/discharge\nrate, are noted for each plot. For each data set, the year of publication, cell manufacturer, cell capacity, and number of cells cycled under the specified conditions\nare noted (when provided in the original publication). “NA” indicates that the specified information was not available. The lines are a guide to the eye and error\nbars are based on standard deviation when data for multiple cells was available. All references to previous studies were presented in Table III except for Hayashi\net al. 2014 [47] in (c) and Paul et al. 2018 [48] in (f). the results here suggest that LFP cells are more suited for lower\ntemperature applications.\n(6) The NMC and NCA cells exhibited a stronger dependence on\ndepth of discharge, with greater sensitivity to full SOC range\ncycling than LFP cells.\n(7) Battery degradation models would benefit from the incorporation of larger data sets and reporting values with a standard\ndeviation. Most models are evaluated against a single experimental data set, but a comparison of the degradation data in this\nstudy to previous commercial cell cycling studies shows the\nvariation possible even under the same conditions. Future work will include combining electrochemical and materials characterization to identify the origin of the varying lifetimes\nobserved in this study. A subset of the cells will be cycled beyond\n80% capacity to identify the causes and early warning signs of\ntransition from linear degradation to rapid capacity fade.\nOne of the primary difficulties in completing this analysis lay in\ncomparing the data to previous published results, which were\ntypically reported as plots rather than raw data. Thus, batteryarchive.org was created as a searchable repository for easy visualization, analysis, and comparison of battery data across institutions. All\ncycling files from the present study have been uploaded to this site and we are currently working with other groups with large data sets\nto share them here. This aggregation of data sets is intended to\nfacilitate future experimental and modeling efforts. Acknowledgments",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 457
    },
    {
      "text": "Acknowledgments This work was supported by the US Department of Energy Office\nof Electricity, Energy Storage Program. The authors wish to thank Dr.\nImre Gyuk for his support of research advancing safety and reliability\nin stationary energy storage. We would like to thank Dr. Valerio de\nAngelis for his substantial efforts in developing batteryarchive.org and\nthe CUNY Energy Institute, part of the City College of New York, for\nproviding site access. We are also grateful to Drs. Daniel Wesolowski,\nReed Wittman, and Loraine Torres-Castro for thoughtful feedback on\nthe manuscript. Sandia National Laboratories is a multi-mission\nlaboratory managed and operated by National Technology and\nEngineering Solutions of Sandia, LLC., a wholly owned subsidiary\nof Honeywell International, Inc., for the U.S. Department of Energy’s\nNational Nuclear Security Administration under contract DE-NA0003525. This paper describes objective technical results and analysis.\nAny subjective views or opinions that might be expressed in the paper\ndo not necessarily represent the views of the U.S. Department of\nEnergy or the United States Government.",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 235
    },
    {
      "text": "Journal of The Electrochemical Society, 2020 167 120532 Author contributions H.M.B. and S.R.F. designed the original study. A.F. and Y.P.\nexecuted the cycling experiments, and J. R.-K. and B.W. Juba\ncompleted ICP. Y.P. carried out the general data analysis and wrote\nthe paper, with D.L.C. contributing to the statistical analysis. All\nauthors participated in discussion of the results, as well as the\npreparation of the paper. ORCID Yuliya Preger [https://orcid.org/0000-0001-8558-2529](https://orcid.org/0000-0001-8558-2529)\nJessica Romàn-Kustas [https://orcid.org/0000-0003-1879-0234](https://orcid.org/0000-0003-1879-0234)\nBabu Chalamala [https://orcid.org/0000-0003-0469-636X](https://orcid.org/0000-0003-0469-636X) References [1. B. Diouf and R. Pode, Renew. Energy, 76, 375 (2015).](https://doi.org/10.1016/j.renene.2014.11.058)\n[2. T. M. Gür, Energy Environ. Sci., 11, 2696 (2018).](https://doi.org/10.1039/C8EE01419A)\n[3. DOE Global Energy Storage Database, https://sandia.gov/ess-ssl/global-energy-](https://www.sandia.gov/ess-ssl/global-energy-storage-database/)\n[storage-database/ (accessed on 16th August 2020).](https://www.sandia.gov/ess-ssl/global-energy-storage-database/)\n[4. M. Dubarry and B. Y. Liaw, J. Power Sources, 194, 541 (2009).](https://doi.org/10.1016/j.jpowsour.2009.05.036)\n5. M. Kassem, J. Bernard, R. Revel, S. Pélissier, F. Duclaud, and C. Delacourt, [J. Power Sources, 208, 296 (2012).](https://doi.org/10.1016/j.jpowsour.2012.02.068)\n6. P. Keil, S. F. Schuster, J. Wilhelm, J. Travi, A. Hauser, R. C. Karl, and A. Jossen,",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 569
    },
    {
      "text": "[J. Power Sources, 208, 296 (2012).](https://doi.org/10.1016/j.jpowsour.2012.02.068)\n6. P. Keil, S. F. Schuster, J. Wilhelm, J. Travi, A. Hauser, R. C. Karl, and A. Jossen, [J. Electrochem. Soc., 163, A1872 (2016).](https://doi.org/10.1149/2.0411609jes)\n7. M. Lewerenz, J. Münnix, J. Schmalstieg, S. Käbitz, M. Knips, and D. U. Sauer,",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 153
    },
    {
      "text": "[J. Electrochem. Soc., 163, A1872 (2016).](https://doi.org/10.1149/2.0411609jes)\n7. M. Lewerenz, J. Münnix, J. Schmalstieg, S. Käbitz, M. Knips, and D. U. Sauer, [J. Power Sources, 345, 254 (2017).](https://doi.org/10.1016/j.jpowsour.2017.01.133)\n[8. S. Sun, T. Guan, P. Zuo, Y. Gao, X. Cheng, C. Du, and G. Yin, ChemElectroChem,](https://doi.org/10.1002/celc.201800326)\n5, 2301 (2018).\n[9. M. Naumann, M. Schimpe, P. Keil, H. C. Hesse, and A. Jossen, J. Energy Storage,](https://doi.org/10.1016/j.est.2018.01.019)\n17, 153 (2018).\n10. A. J. Crawford, Q. Huang, M. C. W. Kintner-Meyer, J.-G. Zhang, D. M. Reed,\n[V. L. Sprenkle, V. V. Viswanathan, and D. Choi, J. Power Sources, 380, 185 (2018).](https://doi.org/10.1016/j.jpowsour.2018.01.080)\n[11. K. A. Severson et al., Nat. Energy, 4, 383 (2019).](https://doi.org/10.1038/s41560-019-0356-8)\n[12. T. Waldmann, M. Kasper, and M. Wohlfahrt-Mehrens, Electrochim. Acta, 178, 525](https://doi.org/10.1016/j.electacta.2015.08.056)\n(2015).\n[13. P. Keil and A. Jossen, J. Electrochem. Soc., 164, A6066 (2017).](https://doi.org/10.1149/2.0091701jes)\n[14. M. Dubarry, A. Devie, and K. McKenzie, J. Power Sources, 358, 39 (2017).](https://doi.org/10.1016/j.jpowsour.2017.05.015)\n15. M. Ecker, N. Nieto, S. Käbitz, J. Schmalstieg, H. Blanke, A. Warnecke, and\n[D. U. Sauer, J. Power Sources, 248, 839 (2014).](https://doi.org/10.1016/j.jpowsour.2013.09.143)\n16. S. F. Schuster, T. Bach, E. Fleder, J. Müller, M. Brand, G. Sextl, and A. Jossen,",
      "page_num": 11,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 673
    },
    {
      "text": "[J. Energy Storage, 1, 44 (2015).](https://doi.org/10.1016/j.est.2015.05.003)\n[17. A. Maheshwari, M. Heck, and M. Santarelli, Electrochim. Acta, 273, 335 (2018).](https://doi.org/10.1016/j.electacta.2018.04.045)\n[18. H. M. Barkholtz, A. Fresquez, B. R. Chalamala, and S. R. Ferreira, J. Electrochem.](https://doi.org/10.1149/2.1701712jes)\n[Soc., 164, A2697 (2017).](https://doi.org/10.1149/2.1701712jes)\n19. H. M. Barkholtz, Y. Preger, S. Ivanov, J. Langendorf, L. Torres-Castro, J. Lamb,\n[B. Chalamala, and S. R. Ferreira, J. Power Sources, 435, 226777 (2019).](https://doi.org/10.1016/j.jpowsour.2019.226777)\n[20. R. Spotnitz, J. Power Sources, 113, 72 (2003).](https://doi.org/10.1016/S0378-7753(02)00490-1)\n[21. X.-G. Yang, Y. Leng, G. Zhang, S. Ge, and C.-Y. Wang, J. Power Sources, 360, 28](https://doi.org/10.1016/j.jpowsour.2017.05.110)\n(2017).",
      "page_num": 11,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 380
    },
    {
      "text": "22. K. Mongird, V. Viswanathan, P. Balducci, J. Alam, V. Fotedar, V. Koritarov, and\nB. Hadjerioua, Energy Storage Technology and Cost Characterization Report,\n[Pacific Northwest National Laboratory (2019), https://doi.org/10.2172/1573487.](https://doi.org/10.2172/1573487)\n23. T. Waldmann, M. Wilka, M. Kasper, M. Fleischhammer, and M. Wohlfahrt[Mehrens, J. Power Sources, 262, 129 (2014).](https://doi.org/10.1016/j.jpowsour.2014.03.112)\n[24. T. Waldmann, B.-I. Hogg, and M. Wohlfahrt-Mehrens, J. Power Sources, 384, 107](https://doi.org/10.1016/j.jpowsour.2018.02.063)\n(2018).\n[25. S. J. An, J. Li, C. Daniel, D. Mohanty, S. Nagpure, and D. L. Wood III, Carbon,](https://doi.org/10.1016/j.carbon.2016.04.008)\n105, 52 (2016).\n26. V. Ruiz, A. Kriston, I. Adanouj, M. Destro, D. Fontana, and A. Pfrang, [Electrochim. Acta, 240, 495 (2017).](https://doi.org/10.1016/j.electacta.2017.03.126)\n[27. L. Tan, L. Zhang, Q. Sun, M. Shen, Q. Qu, and H. Zheng, Electrochim. Acta, 111,](https://doi.org/10.1016/j.electacta.2013.08.074)\n802 (2013).\n28. H. Song, Z. Cao, X. Chen, H. Lu, M. Jia, Z. Zhang, Y. Lai, J. Li, and Y. Liu, [J Solid State Electrochem., 17, 599 (2013).](https://doi.org/10.1007/s10008-012-1893-2)\n[29 S Yi, B Wang, Z Chen, R Wang, and D Wang, Ionics, 25, 2139 (2019).](https://doi.org/10.1007/s11581-018-2607-2)\n30 A Friesen, X Mönnighoff, M Börner, J Haetge, F M",
      "page_num": 11,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 594
    },
    {
      "text": "Haetge, F M Schappacher, and\n[M Winter, J Power Sources, 342, 88 (2017).](https://doi.org/10.1016/j.jpowsour.2016.12.040)\n[31 H Wang, S Frisco, E Gottlieb, R Yuan, and J F Whitacre, J Power Sources,](https://doi.org/10.1016/j.jpowsour.2019.04.034)\n426, 67 (2019).\n32 T S Bryden, A Holland, G Hilton, B Dimitrov, C Ponce de León Albarrán, and\n[A Cruden, Energy Procedia, 151, 194 (2018).](https://doi.org/10.1016/j.egypro.2018.09.047)\n33 J Wang, P Liu, J Hicks-Garner, E Sherman, S Soukiazian, M Verbrugge,\n[H Tataria, J Musser, and P Finamore, J Power Sources, 196, 3942 (2011).](https://doi.org/10.1016/j.jpowsour.2010.11.134)\n34 E Sarasketa-Zabala, I Gandiaga, E Martinez-Laserna, L M Rodriguez-Martinez,\n[and I Villarreal, J Power Sources, 275, 573 (2015).](https://doi.org/10.1016/j.jpowsour.2014.10.153)\n[35 S Watanabe, M Kinoshita, T Hosokawa, K Morigaki, and K Nakura, J Power](https://doi.org/10.1016/j.jpowsour.2014.02.103)\n[Sources, 260, 50 (2014).](https://doi.org/10.1016/j.jpowsour.2014.02.103)\n[36 J Li, J Harlow, N Stakheiko, N Zhang, J Paulsen, and J Dahn, J Electrochem.](https://doi.org/10.1149/2.0491811jes)\n[Soc., 165, A2682 (2018).](https://doi.org/10.1149/2.0491811jes)\n[37 Y Zhang, R Xiong, H He, X Qu, and M Pecht, Appl Energy, 255, 113818](https://doi.org/10.1016/j.apenergy.2019.113818)\n(2019).\n38 J de Hoog, J.-M Timmermans, D Ioan-Stroe, M Swierczynski, J Jaguemont,\n[S",
      "page_num": 11,
      "chunk_index": 5,
      "section_name": "Content",
      "token_count": 599
    },
    {
      "text": "Swierczynski, J Jaguemont,\n[S Goutam, N Omar, J Van Mierlo, and P Van Den Bossche, Appl Energy, 200,](https://doi.org/10.1016/j.apenergy.2017.05.018)\n47 (2017).\n[39 Y Gao, J Jiang, C Zhang, W Zhang, and Y Jiang, J Power Sources, 400, 641](https://doi.org/10.1016/j.jpowsour.2018.07.018)\n(2018).\n[40 M Dubarry, C Truchot, and B Y Liaw, J Power Sources, 258, 408 (2014).](https://doi.org/10.1016/j.jpowsour.2014.02.052)\n[41 S Sun, T Guan, X Cheng, P Zuo, Y Gao, C Du, and G Yin, RSC Adv., 8, 25695](https://doi.org/10.1039/C8RA04074E)\n(2018).\n[42 D Cui, J Wang, A Sun, H Song, and W Wei, Scanning, 2593780 (2018), https://](https://www.hindawi.com/journals/scanning/2018/2593780/)\n[www.hindawi.com/journals/scanning/2018/2593780/.](https://www.hindawi.com/journals/scanning/2018/2593780/)\n43 H Zheng, L Tan, L Zhang, Q Qu, Z Wan, Y Wang, M Shen, and H Zheng,",
      "page_num": 11,
      "chunk_index": 6,
      "section_name": "Content",
      "token_count": 358
    },
    {
      "text": "Zheng, [Electrochim. Acta, 173, 323 (2015).](https://doi.org/10.1016/j.electacta.2015.05.039)\n[44. A. S. Mussa, M. Klett, M. Behm, G. Lindbergh, and R. W. Lindström, J. Energy](https://doi.org/10.1016/j.est.2017.07.004)\n[Storage, 13, 325 (2017).](https://doi.org/10.1016/j.est.2017.07.004)\n[45. B. Lunz, Z. Yan, J. B. Gerschler, and D. U. Sauer, Energy Policy, 46, 511](https://doi.org/10.1016/j.enpol.2012.04.017)\n(2012).\n[46. H. Zheng, L. Chai, X. Song, and V. Battaglia, Electrochim. Acta, 62, 256 (2012).](https://doi.org/10.1016/j.electacta.2011.12.019)\n47. T. Hayashi, J. Okada, E. Toda, R. Kuzuo, N. Oshimura, N. Kuwata, and\n[J. Kawamura, J. Electrochem. Soc., 161, A1007 (2014).](https://doi.org/10.1149/2.056406jes)\n48. N. Paul, J. Keil, F. M. Kindermann, S. Schebesta, O. Dolotko, M. J. Mühlbauer,\n[L. Kraft, S. V. Erhard, A. Jossen, and R. Gilles, J. Energy Storage, 17, 383 (2018).](https://doi.org/10.1016/j.est.2018.03.016)",
      "page_num": 11,
      "chunk_index": 7,
      "section_name": "Content",
      "token_count": 430
    }
  ],
  "total_chunks": 34,
  "created_at": "2026-02-04 14:04:56"
}