{
  "filename": "s10800-020-01465-6.pdf",
  "chunks": [
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117\nhttps://doi.org/10.1007/s10800-020-01465-6",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 37
    },
    {
      "text": "**M. Simolka** **[1]** **[· J. ‑F. Heger](http://orcid.org/0000-0003-4613-1236)** **[1]** **· H. Kaess** **[1]** **· I. Biswas** **[2]** **· K. A. Friedrich** **[2,3]** Received: 28 April 2020 / Accepted: 17 August 2020 / Published online: 27 September 2020\n© The Author(s) 2020 **Abstract**\nThe paper presents post-mortem analysis of commercial ­LiFePO4 battery cells, which are aged at 55 °C and − 20 °C using\ndynamic current profiles and different depth of discharges (DOD). Post-mortem analysis focuses on the structure of the\nelectrodes using atomic force microscopy (AFM) and scanning electron microscopy (SEM) and the chemical composition\nchanges using energy dispersive X-ray spectroscopy (SEM-EDX) and X-ray photoelectron spectroscopy (XPS). The results\nshow that ageing at lower DOD results in higher capacity fading compared to higher DOD cycling. The anode surface aged at\n55 °C forms a dense cover on the graphite flakes, while at the anode surface aged at − 20 °C lithium plating and LiF crystals\nare observed. As expected, Fe dissolution from the cathode and deposition on the anode are observed for the ageing performed\nat 55 °C, while Fe dissolution and deposition are not observed at − 20 °C. Using atomic force microscopy (AFM), the surface\nconductivity is examined, which shows only minor degradation for the cathodes aged at − 20 °C. The cathodes aged at 55 °C\nexhibit micrometer size agglomerates of nanometer particles on the cathode surface. The results indicate that cycling at\nhigher SOC ranges is more detrimental and low temperature cycling mainly affects the anode by the formation of plated Li. **Graphic abstract** **Keywords** Iron dissolution · Vanadium dissolution · Li-ion · Li-plating · LiF crystals · Degradation **Electronic supplementary material** The online version of this\n[article (https​://doi.org/10.1007/s1080​0-020-01465​-6) contains](https://doi.org/10.1007/s10800-020-01465-6)\nsupplementary material, which is available to authorized users. M. Simolka\nMatthias.simolka@hs‑esslingen.de Extended author information available on the last page of the article **1 Introduction** Energy storage devices are receiving more and more\nattention due to the shift from fossil to renewable energy\nsources for the power grid and the electrification of the Vol.:(0123456789)1 3",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "**Influence of cycling profile, depth of discharge and temperature** **on commercial LFP/C cell ageing: post‑mortem material analysis** **of structure, morphology and chemical composition**",
      "token_count": 598
    },
    {
      "text": "1102 Journal of Applied Electrochemistry (2020) 50:1101–1117",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 19
    },
    {
      "text": "1102 Journal of Applied Electrochemistry (2020) 50:1101–1117 mobility sector. The focus is especially on lithium ion batteries, due to their relatively high energy density, low selfdischarge, falling costs and scalability in battery packs.\nHowever, even after roughly 30 years of development,\nmany drawbacks still exist which limit the further utilisation and competitiveness. ­LiFePO4 (LFP) is a promising\ncell chemistry with potential to overcome all current drawbacks. It offers a relatively high working potential (3.5 V\nvs. Li/Li [+] ) and specific capacity of roughly 170 mAh ­g [−1] .\nThe use of iron and phosphorus makes it a sustainable\nchoice, since the materials are abundant and less toxic\ncompared to Co, Ni and Mn [1]. It was firstly introduced\nby Padhi et al. [2, 3] and continuously improved since\nthen. The main drawbacks of LFP are the low electronic\nand ionic conductivity. Additionally, for the ionic conductivity, the diffusion is highly anisotropic, due to the olivine structure of the material with 1D transport. Electronic\n­(10 [–7] to ­10 [–9] S ­cm [−1] ) and ionic conductivity ­(10 [–11] to ­10 [–20]\n­m [2] s [−1] ) values in the literature span over several magnitudes and are still under debate [4]. Moreover, the reaction\nmechanism is assumed to follow either a ‘core–shell’ or\n‘domino’ mechanism [2, 4, 5]. These difficulties show that\nthe material is still not entirely understood and further\nanalysis and research is necessary to clarify the underlying mechanisms leading to the different observations and\nparameter values. Regarding the degradation mechanisms,\nthe scientific community is in overall agreement, that Fe\ndissolution and Li consumption during ageing are mainly\nresponsible for the capacity fading [6–10]. The effect of\nthe cathode surface layer on the capacity fading is not clear\nyet and is assumed to be negligible [11, 12] or likewise\naffecting the capacity fading and impedance increase [7,\n9, 13]. Post-mortem analysis techniques are useful tools\nto gain further insight into the degradation mechanisms\nand their dependencies on the ageing parameters like temperature, current and cycling range of the state-of-charge\n(SOC) (or depth-of-discharge, DOD). Scanning electron\nmicroscopy (SEM) in combination with energy dispersive\nX-ray spectroscopy (EDX) is widely used to analyse material structure and element distributions of electrodes. Lewerenz et al. used SEM and EDX to analyse the covering\nlayer formed on the anode surface [14]. They observed\na compact and dense surface layer containing Li, Fe and\nelectrolyte decomposition products. The compact layer can\ndeactivate parts of the electrodes and contribute to the\ncapacity fading and increase of internal resistance [14].\nIn combination with focused ion beam cutting techniques\n(FIB), it can be used to generate a 3D model of the electrodes and further analyse the ageing. Scipioni et al. use\nFIB-SEM to generate 3D models of aged LFP cathodes\nand observe a decrease of the particle size distribution\nand agglomeration of carbon black particles [15]. Wang\net al. used SEM and EDX to track the corrosion of LFP",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 730
    },
    {
      "text": "cathodes and demonstrated the negative impact of moisture onto the Fe dissolution process [16]. Next to EDX as\nelemental mapping technique, X-ray photoelectron spectroscopy (XPS) is a widely utilised technique to analyse\nthe chemical composition of material surfaces. Regarding\nthe LFP cathode, Koltypin et al. [17], Aurbach et al. [18]\nand Hellqvist et al. [13] studied the cathode surface and\nobserved mainly LiF and P–O and P–F compounds on the\nsurface, when ­LiPF6 is used as an electrolyte salt. The\nsurface layer composition is similar to the one found on\nthe anode side, which mainly consists of inorganic compounds like ­Li2O, LiOH and LiF and organic species such\nas ­ROCO2Li, ROLi (with R representing a alkyl group),\n­Li2CO3 and polycarbonates [19]. Another microscopy\ntechnique used for the degradation of electrodes is atomic\nforce microscopy (AFM). Ramdon et al. used in situ AFM\nto follow the changes in size of one LFP particle and found\nan size variation of 25%, depending on state of lithiation",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "1 3",
      "token_count": 261
    },
    {
      "text": "[20]. Steinhauer et al. used in-situ AFM to follow the\nSEI evolution during the first cycle on crystalline carbon\nand observed dynamic surface structures with a potential\ndependent speed of growth [21]. Hiesgen et al. used AFM\nto analyse the morphology of sulphur cathodes depending on the binder material and observed a decrease of the\nelectronic surface conductivity after ageing, which correlated with the capacity decay [22]. Wu et al. analysed\naged ­LiCoO2 cathode surfaces and observed an increase\nin grain size and surface roughness and a decrease of the\nsurface potential and material stiffness. They attributed\nthese changes to the loss of lithium, the fracturing and\nagglomeration of particles and the generation of a surface\nlayer from electrolyte decomposition products [23].\nSeveral studies performed post-mortem analyses of commercial ­LiFePO4 cells using a variety of ageing parameters,\nsuch as different temperatures and current loads and analysed the electrodes afterwards [9, 10, 13, 14, 24, 25]. These\nstudies show, that cycling at elevate temperatures promotes\nthe dissolution of Fe from the cathode and the capacity fading is mainly caused by loss of lithium inventory due to the\ngeneration of surface layers and loss of active material.\nThe results presented here add additional insight into\nthe degradation of commercial ­LiFePO4 cells. In particular,\nadditional influences of the DOD is shown for Fe dissolution\nas a known degradation mechanisms and the importance\nof vanadium dissolution is shown for the first time. Furthermore, unknown degradation mechanisms with respect\nto LiF deposition, decrease in surface conductivity and the\noccurrence of higher amount of oxygenated species for the\nageing at − 20 °C compared to 55 °C are reported.",
      "page_num": 3,
      "chunk_index": 3,
      "section_name": "1 3",
      "token_count": 374
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1103 **2 \u0007Experimental** The cycling and ageing protocol is as well reported in [26]\nand the main points will be stated here. **2.1 \u0007Cycling of commercial cells** We used commercial 26650 ­LiFePO4 (26650-M1b) cells\nwith nominal 2.5 Ah capacity from A123 Systems LLC.\nfor our analysis. The cells are cycled using the last part of\nthe “worldwide harmonised light vehicles test procedure”\n(WLTP) ageing profile (AP1). Additionally, to increase and\nspeed up the ageing, the current was doubled, to generate a\nsecond test protocol (AP2). The cycling used two different\nDOD: 50% DOD (SOC 100—50%) and 100% DOD (SOC\n100—0%). For each ageing group, a set of three cells was\nused. The cells were cycled using AP1 or AP2 until they\nreached the specified discharge capacity, based on the DOD.\nAfterwards, they were charged using 1C until 100% SOC\nand the dynamic current profile restarted. The cycling was\nconducted at 55 °C and − 20 °C. After 2000 Ah total discharge capacity passed through the cells during the ageing\nprocess, the protocol was stopped and post-mortem analysis\nwas conducted.\nThe temperatures are chosen, firstly, to accelerate the\naging of the cells and secondly, since these temperatures\nrepresent the minimum and maximum of the temperature\noperation range of the manufacturers data sheet for these\ncells. In addition, these temperatures are only slightly lower\nfor the minimum temperature (− 15 °C) and in comparable\nrange for the maximum temperature (+ 35 °C), as they are\nobserved as ambient temperatures for example in the USA [27]. The authors are aware of the thermal control system\ninside the modern automobiles, which regulates the temperature of the battery module during operation. However, during long resting times, the thermal control system is inactive\nand at least at the beginning of the automotive operation, the\nbattery module is exposed to non-optimized temperatures. **2.2 \u0007Sample preparation** After ageing, the cells were discharged to 0% SOC using 1C\n(regarding nominal capacity), transferred into an argon filled\nglovebox (MBraun, Germany) and disassembled. Samples\nwere cut out of the electrode sheets from around the first\ncurrent tab and from the electrode side facing the inside of\nthe cell. Afterwards, the samples were rinsed using dimethyl\ncarbonate (DMC, Sigma Aldrich, Alfa Aesar) and stored\ninside a glovebox. **2.3 \u0007SEM, AFM and XPS analysis**",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 595
    },
    {
      "text": "**2.3 \u0007SEM, AFM and XPS analysis** SEM analysis was conducted using a Jeol JSM-7200F\nequipped with a Bruker Quantax EDX system. The samples\nwere quickly transferred from the glovebox into the SEM to\nlimit the exposure to air. Cross-section cuts were conducted\nusing an unfocused Ar ion beam (Jeol IB-19520 CCP, 6 kV\nfor 4 h) equipped with a sample transfer chamber, to avoid\nany contact with the ambient air during the preparation process. AFM measurements were performed using a Bruker\nIcon installed inside an argon-filled glovebox and equipped\nwith Bruker PeakForce QNM (quantitative nanoscale\nmechanical characterization) and PeakForce TUNA (tunneling AFM) module. For the AFM analysis, we use (i) the\nheight image, which represents the sample topography, (ii)\nthe Peak Force Error, which is the feedback signal for the\nset-point control and serves as a representation of the sample surface, without the influence of height differences, (iii)\nthe adhesion, which is the force needed to detach the AFM\nprobe from the sample surface and (iv) the Peak Current,\nwhich is the measured electrical current during the time of\nthe highest force. For the conductivity measurements, a bias\nvoltage of 3.0 V was applied between tip and sample. Commercially available AFM tips from NT-MDT (Etalon HA_\nFM/W2C +, 75 kHz, 3.5 N/m) with an electrical conductive\n­W2C coating are used. Analysis of AFM measurements was\nconducted using NanoScope Analysis 1.9 software.\nThe XPS analysis was conducted using an Al Kα source\nwith an energy of 1486.6 eV and a hemispherical analyser\n(Thermo Scientific ESCALAB 250) at a base pressure of\n2 × 10 [−10] mbar. Spectra were energy calibrated with reference to the ­Ag3d3/2 signal of a clean etched silver surface.\nSpectra are displayed normalised, and numerical peak signal fitting was carried out using Voigt peak shapes using\nOriginLab software. Depth profiling was carried out by ­Ar [+]\nion bombardment at argon pressure of ~ 2.5 × 10 [−8] mbar and\nwith an average sample current of 2.0 µA. **3 \u0007Results and discussion** **3.1 \u0007Cell capacity fading over ageing**",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 543
    },
    {
      "text": "**3.1 \u0007Cell capacity fading over ageing** The capacity fading follows a linear trend from the beginning to the end for the cells aged at 50% DOD. For the cells\naged at 100% DOD, the capacity fading starts to level during the ageing. The levelling is more pronounced for the\ncells aged at − 20 °C compared to 55 °C (Fig. 1). The cells\naged at − 20 °C using 100% DOD exhibit a noticeable capacity decline at the beginning of the ageing process and only\nafterwards the levelling of the capacity fading is observed.\nFor both temperatures, the ageing profiles using 50% DOD\nexhibit a higher capacity fading compared to 100% DOD. At",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 159
    },
    {
      "text": "1104 Journal of Applied Electrochemistry (2020) 50:1101–1117 we used one or two cells from each group for post-mortem\nanalysis. **3.2 \u0007Structure and morphology of anode surfaces** **Fig. 1** Capacity decay of cells aged at 55 °C ( **a** ) and − 20 °C (b) using\nAP1 and AP2 and 50% and 100% DOD [26] 55 °C, the difference between AP1 and AP2 is nearly negligible. At − 20 °C, the ageing at 50% DOD with AP1 and\nwith AP2 shows likewise nearly the same capacity decline\nover ageing. Only the cells aged with 100% DOD exhibit a\ndistinct difference in the capacity fading. However, with AP2\nand 100% DOD, most of the capacity decline is observed\nduring the first 600 Ah total discharge capacity. Afterwards,\nthe slope of the following capacity decline is practically the\nsame for 100% DOD with AP1 and with AP2. The degradation within one ageing group is homogeneous, as can be\nobserved by the small error bars in the capacity. Therefore, **Fig. 2** SEM images of anode\nsurfaces from different ageing\nprofiles with the corresponding\nillustrations. Fresh ( **a** ), aged\n50% DOD with AP2 ( **c** ), aged\n100% DOD with AP2 at 55 °C\n( **d** ) and 50% DOD with AP2\n( **f** ) and 100% DOD with AP2\n( **g** ) at − 20 °C. Illustration for\nthe fresh anode in **b**, anodes\nsurfaces aged at 55 °C in **e**\nand − 20 °C in **h** . The images\nshow a magnification of 5.000\nand 60.000 for the inset [inset\n( **e** ) only 10.000]. The fresh and\nat − 20 °C aged anodes shows\nsharp edges, while the anodes\naged at 55 °C exhibit a smooth\nsurface coverage",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 466
    },
    {
      "text": "The anode surfaces clearly exhibit some changes compared\nto the fresh anode surface, but show a similar morphology\nfor the same temperature. The anodes of cells aged with\nAP1 are not shown here, but they show similar results compared to the AP2 anode surfaces. The anode surfaces of a\nfresh anode at the beginning of life (BOL) show graphite\nflakes with nearly no coverage (Fig. 2a and illustration in b).\nThe edges of the graphite flakes are clearly visible. It has to\nbe noted, that the anode surfaces underwent washing with\nDMC. Therefore, any surface layer is removed that is not stable. The anode surfaces of the cells aged at 55 °C are entirely\ncovered with a surface layer (Fig. 2c, d and illustration in\ne). As mentioned earlier, one major mechanism contributing to the capacity decline is the loss of lithium inventory\n(LLI). This is based on the continuous consumption of Li\nin the surface layer. High temperatures lead to the formation of a less stable, thicker and more porous SEI, which\ncontinuously dissolves and reforms [28–30]. Therefore, the\ncycling at 55 °C consumes Li in the surface layer generation. The generated surface layer which is observed in the\nSEM images is stable enough to remain on the anode surface\nat the end of life (EOL), even after washing with DMC. A\nnoticeable difference in surface morphology between the\n50% DOD and 100% DOD cycling in Fig. 2c and d is not",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "1 3",
      "token_count": 330
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1105 observed. Ageing at − 20 °C did not generate a dense surface\nlayer, as it is observed for the anodes aged at 55 °C. The\ncovering of the graphite flakes shows similar features as for\nthe fresh anode (Fig. 2f). However, similar structures and\nprecipitation on the anode surfaces aged at − 20 °C, similar\nto the anodes aged at 55 °C, indicate electrolyte deposition\non the anode surface, but in a smaller extend (see Fig. 2g,\nillustration 2 h and Figure S1d and e). For SEM images\nwith lower magnification see Figure S1. Additionally, small\ncrystal-like structures of up to 500 nm developed, which\ncould indicate LiF, since LiF crystals have been observed\nbefore on aged anodes [31, 32]. The crystals are found in\nboth samples cycled at − 20 °C, but not on the anode aged\nat 55 °C.\nNext to the SEI layer on the anodes, the anodes aged\nat − 20 °C exhibited Li plating. The formation of plated Li\nis independent from the cycling profile, since it is found on\nanodes aged with 50% DOD with AP1 and 100% DOD with\nAP2 (Fig. 3). Li plating contributes to LLI, if Li is irreversibly plated. Moreover, the irreversibly plated Li can deactivate anode and cathode material, since covered surfaces on\nthe anode and opposite to that on the cathode are no longer\nelectrochemically active. Since the cells are disassembled\nin discharged state, the plated Li was not stripped off the\nanode surface during the discharge process. Therefore, the\nobserved Li plating is irreversible and contributes to the\ncapacity fading of the cells aged at − 20 °C. The plated Li\nformed large connected islands with a net-like structure on\nthe top.\nThe anode surfaces were additionally examined using\nAFM. In Fig. 4, the height and the Peak Force Error (PFE)\nimages of the anode surfaces are displayed. The fresh anode\nshows the typical large graphite flakes, which exhibit a flat\nsurface (Fig. 4a and b). This is easily observed in the inset of\nthe PFE image, which displays a zoom into the PFE image",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 534
    },
    {
      "text": "with an image size of 5.1 µm side length. During conductivity measurements, the fresh anode showed electrically conductive areas, which was not observed for any other sample\n(not shown here). Therefore, the flat surface of the graphite\nflakes and the measurable electrical conductivity indicate a\nvery thin or not existing SEI on the fresh anode after washing. Moreover, this indicates, that the first characterisation\ncycles and formation did not generate a stable and thick SEI\nyet. The anode surface from the cell aged at 55 °C exhibits—\nas already seen in the SEM images in Fig. 2b—a covering\nlayer on the graphite flakes (Fig. 4c and d). Especially in\nthe PFE, the morphological changes of the graphite flakes\nare clearly visible (see inset of PFE). The surface roughness increased due to ageing by 5%, probably due to the\nformation of the rough SEI structure on top of the smooth\ngraphite flakes. Therefore, washing of the anode surface did\nnot remove all of the SEI, a considerable amount remained\non the anode surface. This suggests a more stable and thicker\nSEI layer, compared to the BOL. The AFM images of the\nother anodes aged at 55 °C are shown in Figure S2. The\nanodes exhibit a surface coverage on all of the graphite\nflakes similar to Fig. 4c and d. The anode surface of the\ncell aged using 50% DOD with AP2 at − 20 °C exhibits an\nincrease in surface roughness by 3%, which is mainly due to\nthe precipitation of the crystal-like structures with roughly\n200–600 nm diameter on the anode surfaces. The graphite\nflakes likewise exhibit an increase of the surface roughness,\ndue to the remaining, partially covering layer. However, the\nsurface layer does not cover all graphite flakes entirely, since\nsome smooth and flat locations on the graphite flakes are\nstill observed (marked by blue ellipses). The anode surface\nof the cell aged at 100% DOD with AP2 at − 20 °C contains\nas already observed in the SEM images in Fig. 3 an islandlike covering layer, which is attributed to the Li plating\n(marked by red arrows). Conductivity measurements using **Fig. 3** SEM images of anode surfaces showing Li plating, aged at − 20 °C using 50% DOD, with AP1 ( **a** ) and 100% DOD, with AP2 ( **b** )",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 545
    },
    {
      "text": "1106 Journal of Applied Electrochemistry (2020) 50:1101–1117 **Fig. 4** AFM images showing height (top row) and Peak Force Error\n(bottom) of the fresh ( **a**, **b** ), aged at 55 °C using AP2, 50% DOD ( **c**,\n**d** ), aged at − 20 °C using AP2, 50% DOD ( **e**, **f** ) and − 20 °C using the AFM reveal no measurable current, which indicates electrically isolated Li plating (not shown here). The roughness\nincrease by 6% is due to the crystal-like features, a layer on\nthe graphite flakes and the plated Li. The AFM images of\nthe other anodes aged at − 20 °C are shown in Figure S3. The\nmeasurements indicate a surface layer covering parts of the\ngraphite flakes, while some flakes exhibit a flat and smooth\nsurface with a distinct change in adhesion, which indicates\nthe bare graphite flakes. Therefore, the cycling at − 20 °C\nleads to a less pronounced surface coverage of the graphite\nflakes, compared to ageing at 55 °C. Several studies show a\ntemperature dependent SEI growth and thickness over ageing, with higher temperatures leading to thick and homogeneous and lower temperatures to thin and non-uniform SEI\nlayers [30, 33–36]. These observations confirm that temperature is a significant driving force for the reaction rate leading\nto the formation of the SEI layer. This relation explains the\nobserved overall surface coverage of the graphite flakes for\nthe anodes aged at 55 °C (Fig. 4c, d and Figure S2) and the\nonly partial coverage of graphite flakes for the anodes aged\nat − 20 °C (Fig. 4e–h and Figure S3). **3.3 \u0007Chemical compositions of anode**\n**close‑to‑surface material and surface layers** The chemical composition of the anode surfaces was analysed using EDX and XPS. We used an acceleration voltage\nof 15 kV for the EDX measurements to be able to detect\nthe Fe Kα line. As the information depth with this method\nis 1–3 µm, in comparison to only a few nm in XPS. EDX\nresults represent close-to-surface material composition, and\nXPS results represent the topmost surface layers. The anode\nsurfaces contained, in addition to C, mainly O, F, P, Fe and",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 541
    },
    {
      "text": "AP2, 100% DOD ( **g**, **h** ). The blue ellipses are indicating flat surfaces\non graphite flakes and the red arrows and the dashed line indicate Li\nplating V. The precipitation of phosphorus and oxygen is based on\nthe reduction of electrolyte and of electrolyte salt ­(LiPF6) on\nthe anode surface, since the anode potential is lower than the\nchemical stability window of these components. The mass\ncontent of P increases due to cycling by the factor of 2–4.\nWithin one ageing profile (AP1 or AP2), the anode surface\ncycled at 50% DOD exhibits a higher P content compared\nto the 100% DOD cycling at the same ageing profile (see\nFig. 5). This is explained by the well-known observation\nthat cycling at higher SOC leads to more pronounced SEI\ngeneration compared to lower SOC cycling [32, 37, 38].\nThe cycling at 50% DOD leads to a longer duration at high\nSOC ranges (compared to 100% DOD) of the cells with\nmore electrolyte and salt decomposition. Furthermore, an **Fig. 5** EDX analysis of anode surfaces regarding the P, O, Fe, O and\nV mass content",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "1 3",
      "token_count": 272
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1107",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 20
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1107 important difference between the 50% DOD cycling and\nthe 100% DOD cycling is the number of charge–discharge\ncycles. One cycle for the 50% DOD cells represents 1.25 Ah\n­cycle [−1], leading to roughly 1600 cycles until EOL, while for\nthe 100% DOD cells (2.5 Ah ­cycle [−1] ) only about 800 cycles\nare performed until EOL is reached. The higher amount of\npotential cycles for the 50% DOD cycling leads to a thicker\nSEI, which consumed more Li during the ageing. The\nanodes aged at − 20 °C exhibit likewise an increase of P and\nO on the surfaces in a similar extent, even though a less pronounced SEI is observed in the SEM and AFM images. This\nis due to the plated Li, which reacts with the electrolyte to\nform decomposition products on the anodes aged at − 20 °C,\neven when the surface of the graphite flakes is not covered\nentirely, as it is the case for the graphite flakes aged at 55 °C.\nSimilar trends for the oxygen content as already found\nfor phosphorus are observed on the anodes aged at 55 °C.\nThe mass of oxygen increased due to ageing by a factor\nof 4–6. The underlying origin is the same as for phosphorus. However, at − 20 °C, the anode surfaces show a different behaviour. The cells aged at 100% DOD show a higher\noxygen content compared to the cells aged with 50% DOD.\nThis observation could be based on the existence of plated\nLi, which reacts with oxygen from the electrolyte or during\nthe transfer of the sample from the glovebox into the SEM\nobservation chamber. Petzl and Danzer [39] assume that\nthe Li plated at lower SOC (100% DOD cycling) is thicker\nand more stable compared to high SOC plating (50% DOD\ncycling).\nThe observed Fe dissolution exhibits the assumed temperature dependency. The anode surfaces aged at 55 °C show\nclearly the presence of Fe, while the anodes aged at − 20 °C\ndo not show any significant amount. The Fe dissolution does\nnot show any clear dependency on the DOD. This clearly\nshows that high temperatures promote the Fe dissolution,\nwhile it is suppressed at low temperatures. Lastly, vanadium\nis observed on the anode surfaces. Due to the low electronic\nand ionic conductivity of LFP, it is doped with multivalent\ncations (like ­V [3+] ) to improve the conductivity [40]. All\ntransition metals commonly used in Li ion batteries are dissolved from the cathode into the electrolyte upon ageing [41,\n42]. As will be shown later, the mass content of V decreased\nin the cathodes after ageing, indicating dissolution of V from\nthe cathode and precipitation on the anode surface. The V\ncontent is generally higher at the anodes cycled at 55 °C. A\nnotable exception is the anode aged at 100% DOD with AP2\nat − 20 °C, which showed a distinct higher amount as compared to the other cells. The origin of this observation is not\nentirely clear yet, but might indicate inhomogeneous deposition of V. The transition metals V and Fe act as catalysts at\nthe anode surface for the formation and subsequent growth\nof the SEI [6, 43]. The deposition of transition metals is\nin addition hindering the Li intercalation into the graphite",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 780
    },
    {
      "text": "anode by clogging anode pores [14, 43, 44]. The increase of\nthe surface layer related resistance was analyzed using EIS\nin [26]. It was observed, that the cells aged at 55 °C exhibit\na surface layer related increase of resistance between 12 and\n27%. The formation of surface layers consumes Li, which is\nafterwards lost for subsequent cycling, and deactivates anode\nmaterial by blocking the intercalation and de-intercalation\nprocess.\nFigure 6 shows the XPS spectra of anodes aged\nat − 20 °C ­(1 [st] and ­2 [nd] row each) and 55 °C (3rd and 4th\nrow each) using 50% DOD with AP1 (2nd and 4th row)\nand AP2 (1st and 3rd row) in comparison to the fresh\nanode (5th row see also Table 1 for peak assignment).\nThe bulk spectra refer to the surface laid open after ion\netching for a total time of 2660 s, while the surface spectra\nwere recorded before. In the C1s surface spectra, the fresh\nanode shows four peaks around 284, 287, 288 and 292 eV.\nThe peak around 284 eV is assigned to C–C and C–H species. After ageing at 55 °C, the peak is no longer observed,\nwhile at − 20 °C these species are still found. The vanishing of the peak around 284 eV for the anodes aged at 55 °C\nindicates a thick and homogeneous surface layer covering\nthe entire anode surface. Since the peak is still observed\nin the anodes aged at − 20 °C, the surface layer is only\npartially covering the anode, as it was already observed in\nthe AFM measurements (Fig. 4). The peaks at 287 eV and\n288 eV are assigned to C–O and C=O bonds, respectively.\nThe peak at 292 eV is assigned to decomposition products of the carbonate-based electrolyte. Interestingly, the\ncarbonate-based peak is not observed in the aged samples,\nneither in the surface layer nor in the bulk. After ion etching for 2660 s, the bulk material of all anodes exhibits only\nthe two peaks of the C–C/C–H and the C–O species. Two\npeaks around 685 eV and 689 eV dominate the F1s surface spectra. They are attributed to ­LixPOyFz and ­LixPFz,\nrespectively, which are decomposition products of ­LiPF6.\nHowever, PVDF (polyvinylidene difluoride) as an assumed\nbinder material in the electrodes can influence the peak\naround 689 eV, due to the C–F bond. ­LixPOyFz is additionally observed in the P2p surface spectra of all anodes\nat 136 eV. The anode aged at − 20 °C with AP1 exhibits\na higher relative intensity for the ­LixPFz peak in the F1s\nspectrum compared to the other anodes. The P2p surface\nspectra points likewise to a higher ­LixPFz concentration\non the anodes aged at − 20 °C compared to 55 °C, since\nthe peaks around 138 eV (assigned to ­LixPFz) are only\nobserved in the low temperature ageing. An additional\npeak appears around 685 eV for the anodes aged at − 20 °C\nin the F1s bulk spectra, which is assigned to LiF. The attribution of LiF crystals to the observed features in the AFM\nimages for the anodes aged at − 20 °C is therefore verified\nby the presence of this peak (only detected for the anodes\naged at − 20 °C). For the fresh anode and the anodes aged",
      "page_num": 8,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 848
    },
    {
      "text": "1108 Journal of Applied Electrochemistry (2020) 50:1101–1117 **Fig. 6** XPS spectra of the anode surfaces showing the C1s, F1s, P2p,\nO1s, and Li1s spectra at the surface (top) and after sputtering for\n2660 s (indicated as bulk, bottom set of spectra). The 1st row shows at 55 °C, the O1s surface spectra contains two peaks at\n535 eV and 533.5 eV that are assigned to C–O species\nand ­LixPOyFz, respectively. The anodes aged at − 20 °C\nexhibit an additional peak around 530.5 eV. This peak\nis attributed to LiOH or ­Li2O species [45, 46]. The bulk\nmaterial of the fresh anode generates no significant O1s\npeak anymore. Contrary, the aged anodes still contain the\npeaks, which are found on the surface, which indicates a\nthicker and more stable SEI layer for all aged anodes as\ncompared to the fresh state. In the P2p bulk spectra, the\n­LixPOyFz peaks of the anodes aged at 55 °C are shifted\ntowards lower binding energies, compared to the − 20 °C\ndata, therefore indicating lower oxidation states. The relative peak intensity of the anode aged at − 20 °C, 50% DOD\nwith AP2 is very low and non-existing for the fresh anode,\nwhich is in agreement with the aforementioned vanishing\nof the ­LixPOyFz peak in the O1s spectra around 533.5 eV.\nThe P2p bulk spectra of the anodes aged at 55 °C exhibit\nan additional peak at around 130.5 eV. P atoms coordinated to a Fe atom are assumed to generate this additional\npeak at lower binding energies. Since Fe dissolution is not",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 426
    },
    {
      "text": "the anode from a cell aged at − 20 °C, 50% DOD with AP2; the 2nd\nrow − 20 °C, 50% DOD with AP1; 3rd row 55 °C, 50% DOD with\nAP1; 4th row 55 °C, 50% DOD with AP2 and 5th row in fresh state observed for the anodes aged at − 20 °C, such a peak is not\nexpected and neither observed for these anodes. ­LixPOyFz\nand ­LixPFz are mainly dominating the L1s spectra at\n57 eV. The cells aged at − 20 °C exhibit additionally a\npeak around 56 eV, indicating LiF and a small peak around\n54 eV, which is assigned to plated Li species which was\nalready observed in SEM and AFM images. The surface\nand bulk Li1s spectra show similar results.\nThe elements in the SEI layer are essentially similar for\nthe anodes aged at 55 °C and − 20 °C. However, some deviations are observed: i) only for the anodes aged at − 20 °C,\nLiF is observed, ii) additional species such as LiOH or\n­Li2O (indicating Li plating) are only observed in the anodes\naged at − 20 °C, iii) on the anodes aged at − 20 °C, a higher\namount of ­LixPFz is present compared to the anodes aged at\n55 °C, iv) the anodes aged at − 20 °C show lithium species,\nas already observed in the SEM and AFM images, and v)\nfor the anodes aged at 55 °C, due to Fe dissolution, which\nis already observed in the EDX analysis, an additional peak\ndue to P atoms coordinated to Fe atoms, is observed.",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "1 3",
      "token_count": 413
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1109 **Fig. 7** AFM surface images of fresh cathodes ( **a**, **b** ) and cathodes\naged at 55 °C using 50% DOD with AP1 ( **c**, **d** ), 100% DOD with AP1\n( **e**, **f** ), 50% DOD with AP2 ( **g**, **h** ) and 100% DOD with AP2 ( **i**, **j** ). Top **3.4 \u0007Structure and morphology of cathode surfaces** The fresh cathode surface is highly conductive (about 80%\nof the measured surface area is conductive) and consists of\nsmall particles of roughly 50–200 nm in diameter (Fig. 7a,\nb). After the ageing at 55 °C, the cathode surfaces are covered by electrically non-conductive agglomerates having a\ndiameter of roughly 0.5 to 1 µm. The surface coverage is\nconsistently higher for the 100% DOD profile aged with AP1\nor AP2 (Fig. 7e, f and i, j) compared to the 50% DOD profile\n(Fig. 7c, d and g, h). The agglomerates consist of smaller\nparticles of roughly 15–100 nm in diameter, which show a\nlower adhesion compared to the agglomerate-free cathode\nsurface (see Figure S4 for higher magnification). The adhesion is governed by electrostatic interactions between tip\nand surface and remaining electrolyte material. Influences\nof a water meniscus on the adhesion play an important role\nbut can be excluded here, due to the dry argon atmosphere.\nUsing a positive bias voltage, the particles showing a low\nadhesion are expected to be ­LiFePO4 particles, while the\nhigh adhesion is assigned to binder and electrolyte material\ndue to presence of charges and a higher mechanical pulloff force of the tip from the surface, induced by remaining electrolyte. The appearance of negative adhesion is\nbased on the existence of negatively charged LFP particles\n­[Li(1-x)FePO4] [x−], due to the loss of lithium inventory over\ncycling, while applying a positive bias voltage. The loss\nof lithium inventory is next to the loss of active material\nthe main influence for the capacity decay over aging (see [26] for more information on the degradation of the cells).\nThe nanometer particles forming the agglomerates must be\ncovered with a thicker, isolating surface layer or exhibit a\ndegradation of the conductive carbon coating. Otherwise,\nthe agglomerates would still exhibit a measurable current",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 585
    },
    {
      "text": "[26] for more information on the degradation of the cells).\nThe nanometer particles forming the agglomerates must be\ncovered with a thicker, isolating surface layer or exhibit a\ndegradation of the conductive carbon coating. Otherwise,\nthe agglomerates would still exhibit a measurable current row shows the cathode surface topography and the bottom row the\n(peak) current. In the top of the current images, the average current\nmagnitude of the agglomerate-free surface is given through the conductive nanometer particle network. Zhu\net al. previously observed the appearance of large surface\nagglomerates for cycled ­LiMnO2 cathodes [47]. In their\nstudy, the agglomerates are assumed to be generated by fragmentation of particles due to cyclic induced stress by continuous lithiation and delithiation and consecutive agglomeration of nanometer particles, which is in agreement with the\nobserved composition of the agglomerates here. Therefore,\nthe continuous lithiation and delithiation leads to cracking\nand fragmentation of large LFP particles and subsequent\nagglomeration generates the micrometre size agglomerates.\nThe observed lack of conductivity on these agglomerates\nindicates disconnection to the electrode electrical network\nand therefore also a loss of active material due to the generation of an electrochemical inactive phase.\nSince the agglomerates are electrically insulating, the\nquantity of agglomerates controls the overall surface conductivity. The conductivity decreased by 40% to 70% compared to the fresh cathode (see Fig. 9a top). Apart from the\nagglomerates, the surface conductivity is influenced by (i)\nthe isolating surface layer, (ii) degradation of carbon coating and (iii) the contact loss of the particle to the conductive electrode network. The roughness of the cathode surface, which is not covered by the agglomerates, decreased\ncompared to the fresh cathode surface by roughly 25% to\n50% (Fig. 9a bottom). Since we exclude the large agglomerates for the surface roughness analysis, the presence of the\nagglomerates does not affect the resulting roughness measurements. Most other surface roughness studies on cathodes\n­(LiCoO2, ­LiMnO2 and ­LiFePO4) report an increase of the\nsurface roughness over ageing, which is due to the generation of smaller particles due to fragmentation [23, 47,\n48]. The decrease of the agglomerate-free surface roughness is based on the remaining surface layer, which was not",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 535
    },
    {
      "text": "1110 Journal of Applied Electrochemistry (2020) 50:1101–1117 removed during the sample preparation process (see Fig. 9b\nfor an illustration). Since the samples are measured exsitu, the sample preparation process influences the surface\nroughness of the samples. For example Wu et al. used an\nextensive procedure with acetone and ethanol to wash the\ncathode surfaces several times, which presumably removed\nall remaining electrolyte and measured an increase of the\nsurface roughness after ageing [23]. Contrary, we employed\na more delicate procedure with DMC in a single process to\nwash off electrolyte and no further surface treatment for the\nanalysis.\nNevertheless, Kostecki et al. [49] and Demirocak and\nBushan [50] observed likewise a decrease in surface roughness after cyclic and calendric ageing of ­LiN0.8Co0.2O2\nand ­LiFePO4 cathodes, respectively. While Demirocak\nand Bushan did not elaborate further on this observation,\nKostecki et al. attribute this to the formation of a deposit\nwhich is not enhanced by electrochemical cycling [49].\nThe formation of an electrolyte layer on the cathode surface reduces the surface roughness of the analysed aged\ncathodes. We assume the deposit to exhibit only a thin\nlayer thickness, since the AFM measurements still show a\nmeasurable current in these areas. The observed decrease\nof surface conductivity, which is observed by the reduced\nmagnitude of the measured current in the aged cathode surfaces, is therefore attributed to the degradation of carbon\ncoating on the particle and loss of electrical contact to the\nelectrode conductivity network. The surface layer does not\nseem to electrically isolate the cathode surface, since the\nagglomerate-free cathode surfaces still exhibit a measurable\ncurrent (see also Figure S4 for a higher magnification of\nthe agglomerate-free cathode surface). The degradation of\nthe carbon coating and loss of electrical contact leads to a\nhigher electrode resistance, which is observed in the lower\nabsolute current in the peak current measurements (ranging **Fig. 8** AFM surface images of fresh cathodes ( **a**, **b** ) and cathodes\naged at − 20 °C using 50% DOD with AP1 ( **c**, **d** ), 100% DOD with\nAP1 ( **e**, **f** ), 50% DOD with AP2 ( **g**, **h** ) and 100% DOD with AP2 ( **i**,",
      "page_num": 11,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 547
    },
    {
      "text": "from 0.70 to 3.12 nA for the aged cathodes) compared to the\nfresh cathode (4.93 nA).\nContrary to the cathodes aged at 55 °C, the cathode surfaces aged at − 20 °C and prepared using the same procedure\nfor the sample analysis, exhibit nearly no change in surface\nmorphology and structure (Fig. 8). The surface morphology consists of small particles and exhibits a decrease of\nthe conductive area of only 5–20% (see Fig. 9 top) and the **Fig. 9** Analysis of AFM surface measurements of cathodes aged at\n55 °C and − 20 °C showing in **a** the conductive area in the top and the\nsurface roughness in the bottom row and in **b** the illustration of the\nsurface layer and electrical network degradation of the fresh cathode\nand the cathodes aged at 55 °C and − 20 °C **j** ). Top row shows the cathode surface topography and the bottom\nrow the (peak) current. In the top of the current images, the average\ncurrent magnitude of the agglomerate-free surface is given",
      "page_num": 11,
      "chunk_index": 1,
      "section_name": "1 3",
      "token_count": 252
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1111",
      "page_num": 12,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 20
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1111 surface roughness increased by 5–22% compared to the fresh\ncathode (Fig. 9 bottom). The overall magnitude of the measurable current reduced in a lower extend for the cathodes\naged at − 20 °C (ranging from 2.25 to 3.97 nA) compared to\nthe cathodes aged at 55 °C. The modest reduction of the conductive area in AFM images is attributed to loss of electrical\ncontact of particles to the electrode conductivity network.\nCarbon coating degradation does not influence the surface\nconductivity, but leads to a reduction in the absolute values\nof the current magnitude due to resistance increase of the\nelectrode. The increase of the surface roughness is attributed\nto an inhomogeneous surface layer, which does not cover the\ncathode surface completely, and cracking and fragmentation of LFP particles. This is based on the assumption that\nthicker, homogeneous and complete surface layers are generating a smooth and flat surface layer, while the bare cathode\nand a cathode with only small and limited coverage exhibits\na rough surface, due to the structure of the uncovered LFP\nparticles. The assumption is summarized in the illustration\nin Fig. 9b. The thin surface layer has presumably a negligible\ninfluence on the overall surface conductivity.\nThe surface conductivity of the cathodes aged at 55 °C\ndecreased intensely compared to the fresh cathode surface\nand the cathodes aged at − 20 °C. However, the cathodes\nwith the highest decrease of surface conductivity (100%\nDOD with AP1 and AP2) show a decrease of capacity at\nthe EOL of 12% and 13%, while the other cells aged at 50%\nDOD with AP1 and AP2 show a capacity decrease of 16%\nand 17%, respectively, but a higher share of conductive area\nafter ageing. A similar trend is observed for the cathodes\naged at − 20 °C, which show an almost constant surface\nconductivity within the group after ageing, but differ in the\nremaining cell capacity (Fig. 1). Therefore, the decrease of\nthe cathode surface conductivity does not seem to have a\ndirect impact on the remaining cell capacity. This observation is plotted in Figure S5, which displays the independency\nof the remaining cell capacity on the surface conductive\narea. Next to the cell capacity, the power capabilities, which\nwould be influenced by a resistance increase of the cells, is\nnot affected by the observed reduction of surface conductivity. This observation was reported before by the authors in\nFigure S11 [26], which depicts the evolution of the internal\ncell resistance of the electrodes (called ­Rtotal). For the cells\naged at − 20 °C and the cell aged at 55 °C with 100% DOD\nusing AP2, the resistance stays nearly constant throughout the ageing. For the cell aged at 55 °C with 50% DOD\nusing AP2 the resistance increases by 70%, however, the\ncathode exhibits a higher share of surface conductive area\ncompared to the cell aged at 55 °C with 100% DOD using\nAP2. Therefore, especially the power capabilities of the cell\naged at 55 °C with 100% DOD using AP2 should show any\ninfluence by the reduced share of the surface conductive\narea, which is, however, not observed. Changes in the power",
      "page_num": 12,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 748
    },
    {
      "text": "characteristics would be influenced by modifications in the\ncell resistance, which are, however, only observed for the\ncell aged at 55 °C using 50% DOD, but these are based on\ndifferent degradation mechanisms (Fe-dissolution, damages\nto the internal, electrically conductive electrode network and\ndeactivation of before electrochemically active material) and\nnot based on the surface conductivity of the cathodes.\nThe decrease of surface roughness indicates coverage of\nparticles on the cathode surface, which reduces the overall\nroughness for the cathodes aged at 55 °C. Ageing with 100%\nDOD leads to a more homogeneous coverage layer, since\nthe surface roughness is smaller compared to the 50% DOD\ncycling profiles. The roughness follows the same trend as the\nsurface conductivity, with 100% DOD exhibiting a higher\ndecrease of the surface roughness compared to the 50%\nDOD counterpart. The cathodes aged at − 20 °C exhibit an\nunchanged or a slightly increased surface roughness, which\nshows, that cycling at − 20 °C generates only very limited\ncoverage of particles upon ageing. The increase of surface\nroughness is due to the cracking and fragmentation of LFP\nparticles, which are subsequently not entirely covered by a\nsurface layer. **3.5 \u0007Chemical compositions of cathode**\n**close‑to‑surface material and surface layers** The chemical composition of the cathode surface was analysed using EDX and XPS. The EDX analysis reveals an\nincrease of the mass of P and Fe (Fig. 10). This is valid\nfor nearly all cathode surfaces, except the cathode aged\nat − 20 °C using 100% DOD with AP2, which shows only\nnegligible variations compared to the fresh cathode. Regarding the cells aged at 55 °C, the absolute change compared\nto the fresh cathode surface was continuously higher for the\ncathode aged at AP1 than for the AP2 ageing.\nThe Fe content on the cathode surfaces increases for all\nanalysed cathodes. This would be assumed for cathodes surface **Fig. 10** EDX analysis of cathode surfaces regarding the P and Fe\nnorm. mass content",
      "page_num": 12,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 479
    },
    {
      "text": "18 17 16 32 30 28",
      "page_num": 12,
      "chunk_index": 3,
      "section_name": "1 3",
      "token_count": 6
    },
    {
      "text": "1112 Journal of Applied Electrochemistry (2020) 50:1101–1117 aged at elevated temperatures, due to Fe dissolution from the\nbulk. The appearance of a higher Fe content on the surface\nof cathodes aged at − 20 °C, for which no Fe deposition at\nthe anode surfaces is observed, is unexpected. Additionally,\nthe Fe content of the cathode cross-section stays constant or\nincreases slightly (see Fig. 12). The cathodes aged at 55 °C\nexhibit an increase of the Fe content on the cathode surface and a decrease of the Fe content in the cross-section,\nwhich would be expected for the dissolution of Fe from the\nbulk into the electrolyte. This observation of the Fe content increase on the cathode surface and cross-section for\nthe cathodes aged at − 20 °C points towards an inhomogeneous Fe redistribution inside the cathode due to ageing,\nsince Fe dissolution towards and deposition on the anode\nis not observed. Phosphorus follows the same mechanism\nas observed for Fe, without the dissolution into the electrolyte, since the P increase on the anode surface is attributed\nto electrolyte salt decomposition and SEI growth. On the\ncathode surfaces, a higher P content after ageing is observed,\nwhile for the cross-section it decreased. This observation\npoints towards a redistribution of P inside the cathode material, as it is assumed for Fe.\nThe XPS spectra of the cathode surfaces show species\nsimilar to the anode surfaces. The C–C and C–H (284 eV)\npeaks are well observable in all samples and their intensities on the bulk surface increase only slightly after ion\netching (Fig. 11, see also Table 2 for peak assignment).\nA similar observation is found in the O1s spectra for the\n­PO43− peak at 531 eV, which is well observable. The pronounced C–C/C–H and ­PO43− peaks indicate only partial\ncoverage of the cathode surface as already observed in\nthe AFM measurements (Figs. 7 and Fig. 8). The peak at\n688 eV, attributed to ­LixPOyFz, dominates most of the F1s\nsurface and bulk spectra. Only the cathode surface aged at\n55 °C, 50% DOD with AP1 exhibits an additional and more\npronounced peak at 690 eV, originating from ­LixPFz species. **Fig. 11** XPS spectra of the cathode surfaces showing the C1s, F1s,\nO1s and P2p spectra at the surface and after sputtering for 2660 s\n(indicated as bulk). The 1st row shows the anode from a cell aged",
      "page_num": 13,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 583
    },
    {
      "text": "The other cathode surface aged at 55 °C, 50% DOD with\nAP2 exhibits only a weak signal at 690 eV, similar to the\nfresh cathode. The cathodes aged at − 20 °C do not show any\nobservable peak at this binding energy. After ion etching, the\nintensity of the ­LixPFz peak increases for the cathodes aged\nat 55 °C. The − 20 °C cathodes exhibit an additional peak at\nlower binding energies, which is attributed to LiF (685 eV).\nThe ­PO43− peak at 133 eV dominates the P2p spectra for\nall cathode surfaces. On the fresh cathode, peaks indicating\n­LixPFz and ­LixPOyFz are observed at 137 eV and 136 eV,\nrespectively. The cathodes aged at 55 °C contain next to\nthe ­PO43− peak only traces of ­LixPFz, while the cathodes\naged at − 20 °C exhibit only traces of ­LixPOyFz. The F1s and\nP2p spectra indicate that the ageing at 55 °C leads to more\npronounced precipitation of ­LixPFz over ageing compared\nto the ageing at − 20 °C. ­LixPFz is formed by decomposition of ­LiPF6 in the electrolyte [11, 51, 52] following reaction (1) and (2). ­LixPOyFz is formed due to traces of water\nin the electrolyte and by reaction with the highly reactive\n­PF5 through reaction (3) and (4). LiF is not observed on the\ncathode surfaces aged at 55 °C, even though it is a product\nof the reactions (1), (2) and (4) and often found in ­LiPF6\nbased electrolytes [11, 12, 53]. High temperature cycling\nmight promote LiF dissolution into the electrolyte, which\ncould explain the missing LiF peaks for the cathodes aged\nat 55 °C [46, 47]. LiPF6 → LiF + PF5\n(1) 2 _x_ Li [+] + 2 _x_ e [−] + PF5 → LixPF5−x + (2 − _x_ )LiF (2) PF5 + H2O → 2HF + PF3O (3) 2 _x_ Li [+] + 2 _x_ e [−] + PF3O → LixPF3−xO + _x_ LiF (4)",
      "page_num": 13,
      "chunk_index": 1,
      "section_name": "1 3",
      "token_count": 564
    },
    {
      "text": "2 _x_ Li [+] + 2 _x_ e [−] + PF3O → LixPF3−xO + _x_ LiF (4) at − 20 °C, 50% DOD with AP2; the 2nd row − 20 °C, 50% DOD with\nAP1; 3rd row 55 °C, 50% DOD with AP1; 4th row 55 °C, 50% DOD\nwith AP2 and 5th row in fresh state",
      "page_num": 13,
      "chunk_index": 2,
      "section_name": "1 3",
      "token_count": 119
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1113 **3.6 \u0007Chemical compositions of cathode bulk**\n**material** Next to the cathode surface, the cross-section of cathodes\nwas investigated using EDX measurements, to analyse the\nchanges due to cycling in the bulk material. For the cathodes\naged at 55 °C, P and Fe show a similar trend, with a decrease\nof the P and Fe content for the 50% DOD cycling and a constant or only slight decrease for the cathodes aged with 100%\nDOD. The decrease of the Fe content in the bulk material is\nin agreement with the already observed Fe dissolution from\nthe cathode and migration to and deposition on the anode\nsurface (see Fig. 5). The decrease of the P content in the\ncathode bulk and the increase of the P content on the cathode\nsurface indicate an accumulation of ­FePO4 active material in\nthe surface of the electrode and depletion in the bulk of the\ncathode due to cycling. This effect is more pronounced for\nthe cathodes aged at 50% DOD. This effect might be linked\nto the overall completed ageing cycles of the cathode. As\nexplained earlier, the 50% DOD cells completed roughly\ntwice as many charge and discharge cycles compared to\nthe 100% DOD cells. The higher amount of cycles leads to\nan inhomogeneous distribution and accumulation of active\nmaterial near the surface in the cathode. The increase of\nthe vanadium content on the anode surface is accompanied\nby the decrease in the cathode bulk. The decrease does not\nexhibit any distinct dependency on the ageing profile. Transition metal dissolution is therefore not only limited to Fe,\nbut also affects V, a doping agent. The appearance of V dissolution into the electrolyte was already observed by Hovington et al. for ­Li1.2V3O8 cathodes [54]. For the cathodes\naged at − 20 °C, no distinct trend for the elemental changes\nwas detected. A decrease in the mass of P is observed for\nthe cathodes aged with AP1, whereas it stays constant or\nincreases slightly for the cathodes aged with AP2. Since\nthe capacity fading is quite different for the cells aged with\n50% DOD and 100% DOD with AP1, but similar changes 18.4\n18.0\n17.6\n17.2 cross-section 33\n30\n27 1.0 0.9 0.8 **Fig. 12** EDX analysis of cathode cross-section bulk material regarding the P, Fe and V norm. mass content **Table 1** Peak assignment (in eV) for the observed species on the\nanode surface",
      "page_num": 14,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 591
    },
    {
      "text": "**Table 1** Peak assignment (in eV) for the observed species on the\nanode surface P2p F1s O1s Li1s C1s C–O 535 287\nC–C/C–H 284\nC=O 288\nCarbonates 292\nC–F 691\nLixPFz 138 689 57\nLixPOyFz 136 687 533 57\nLiF 685 56\nP–Fe 131\nLiOH/Li2O 531 287\nLi 54 over ageing are observed in the elemental analysis of the\ncross-section, we expect the observation in Fig. 12 to indicate heterogeneous active material distribution within the\nelectrode for the cathodes aged at − 20 °C. If loss of active\nmaterial would be responsible for the observed changes in\nthe elemental analysis, the capacity decay over ageing would\nbe comparable, which is however not the case for the 50%\nand 100% DOD cells aged with AP1. An increasing inhomogeneity for the distribution of lithium was already observed\non cell level for the cells aged at − 20 °C [26]. The reduction\nof the V content is in agreement with the observed increase\non the anode surface. Interestingly, it is detected in a smaller\nextent for − 20 °C compared to the cathodes aged at 55 °C.\nFe dissolution is not observed. Reduction of V as a doping\nagent can lead to electrical and ionic resistance increase in\nthe cathode and therefore contribute to an increase of the\nimpedance and decrease of power capabilities over ageing. **Table 2** Peak assignment (in eV) for the observed species on the\ncathode surface P2p F1s O1s C1s C–C/C–H 284\nC–O 287\nC=O 288\nCarbonates 290.5\nLixPFz 137 690\nLixPOyFz 136 688 533\nLiF 685\nPO43− 133 531",
      "page_num": 14,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 447
    },
    {
      "text": "1114 Journal of Applied Electrochemistry (2020) 50:1101–1117 **4 \u0007Conclusion**",
      "page_num": 15,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 25
    },
    {
      "text": "**4 \u0007Conclusion** Post-mortem analyses of cathodes and anodes of commercial\nLFP cells aged at 55 °C and − 20 °C and cycled with different dynamic load profiles are presented. The current intensity (difference from AP1 to AP2) has a smaller influence on\nthe capacity fading than the DOD (see Fig. 1).\nThe anode surfaces aged at 55 °C show a dense surface layer on the graphite flakes and only to a small extent\nan electrolyte decomposition layer on the anodes aged\nat − 20 °C. The anodes aged at − 20 °C, however, reveal\nintense Li plating and the appearance of crystal-like features,\nwhich are presumably LiF crystals. LiF, LiOH and ­Li2O\nspecies are observed in the XPS spectra in the anodes aged\nat − 20 °C, but not at the anodes aged at 55 °C. Fe resulting from dissolution is well observed on the anodes aged at\n55 °C, while low temperature cycling completely represses\nFe from dissolution. Nevertheless, V is observed on all\nanode surfaces, independent from temperature, which is similar to the decrease of the V content observed for the cathode\nbulk. The 50% DOD profile shows consistently higher mass\ncontents of P, O and V and Fe (with only one exception at\nAP2 for Fe) compared to the 100% DOD counterpart for\nthe ageing at 55 °C on the anode, which indicates higher\nelectrolyte decomposition rates due to cycling at higher SOC\nranges. Ageing at − 20 °C does not show any clear pattern,\nneither in the aged cathode, nor in the aged anode.\nThe cathodes aged at 55 °C exhibit micrometre size and\nelectrically isolating agglomerates consisting of ­LiFePO4\nparticles. Particle cracking, fragmentation and subsequent\nagglomeration of the nanometer particles generate the\nagglomerates. The agglomerates are electrochemically inactive and responsible for loss of active material, next to the\nobserved Fe dissolution from the cathode into the electrolyte. The remaining cathode surface, which is not covered by\nthe agglomerates, shows an overall lower conductivity compared to the fresh cathode, indicating an additional degradation of the carbon coating on the particles and connection\nfrom the particles to the overall electrode electrical network.\nThe surfaces of the cathodes aged at − 20 °C do not show any\nsurface covering and show no significant change in overall\nsurface conductivity. XPS analysis reveals higher amount\nof traces of ­LixPFz at the cathodes surfaces aged at 55 °C,\nwhile higher amount of traces of ­LixPOyFz are observed at\nthe cathodes aged at − 20 °C. LiF is only observed at the\ncathodes aged at − 20 °C. The EDX analysis of cathode surfaces show an increase of the mass content of P and Fe on\nthe surface with a decrease of Fe in the bulk for the cathodes\naged at 55 °C. The 50% DOD profiles show a higher amount\nof Fe decrease in the cathode bulk, which points towards a\nhigher Fe dissolution rate at high SOC cycling. The bulk\nof the cathodes reveal a cycling temperature independent",
      "page_num": 15,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 709
    },
    {
      "text": "decrease of the mass content of V, which is presumably a\ndoping agent to increase the electrochemical performance.\nThe main factors leading to the capacity decay are loss\nof lithium inventory and loss of active material (see as well",
      "page_num": 15,
      "chunk_index": 2,
      "section_name": "1 3",
      "token_count": 47
    },
    {
      "text": "decrease of the mass content of V, which is presumably a\ndoping agent to increase the electrochemical performance.\nThe main factors leading to the capacity decay are loss\nof lithium inventory and loss of active material (see as well [26]). Loss of lithium inventory is for the cells aged at 55 °C\nbased on the formation of a surface layer on the anode side.\nFor the cells aged at − 20 °C, Li plating is likely the main\nsource of loss of lithium inventory, since the formation of a\nsurface layer is observed in a smaller extend. The cathode\naged at 55 °C exhibits formation of surface agglomerates\nconsisting of active material and Fe dissolution from the\ncathode and deposition on the anode surface. A similar effect\nis not observed for the cathodes aged at − 20 °C. Therefore,\nthe ageing at 55 °C is the sum of the anode (loss of lithium\ninventory) and cathode (loss of active material) contribution,\nwhile for the ageing at − 20 °C, the anode (loss of lithium\ninventory) is the main factor influencing the capacity decay.\nThe key insights of the presented results are summarised\nas following: firstly, we show that next to the temperature,\nthe depth of discharge is another factor influencing the Fe\ndissolution. Secondly, the formation of LiF crystals with\nroughly 500 nm in diameter are observed, but only for the\ncells aged at 55 °C. Thirdly, structural analyses of the cathode surface show that the surface conductivity is drastically\ndecreased for the cathodes aged at 55 °C by the evolution\nof micrometer sized, electrically isolated ­LiFePO4 agglomerates. However, the reduction of the surface conductivity\ndoes not correlate with the capacity fading, indicating only\na minor influence of electrode surface conductivity on the\noverall capacity fading process. Fourthly, next to the dissolution of iron, vanadium dissolution from the cathode and\ndeposition on the anode is observed, indicating instable doping of ­LiFePO4 material. Fifthly, the electrolyte deposition\nspecies on the cathodes exhibit a higher amount of oxygenated species for the ageing at − 20 °C compared to 55 °C,\nindicating different decomposition paths. Additionally, the\nresults confirm, that cycling at lower DOD is more detrimental than cycling using the full capacity range [10, 55].\nThe manuscript is linked to another publication [26] on the\ntracking of cell ageing using cell level analysis techniques.\nThe results are supposed to assist in the correct choice of\noperation conditions for these highly used commercial cells\nand cell chemistry and to present the degradation mechanisms related to the ageing. These observations reveal that\ncycling at elevated temperatures and higher SOC levels have\na more detrimental effect on the electrode materials. Cycling\nat − 20 °C had only little detrimental effects on the cathodes\nand for the anodes it resulted mainly in the occurrence of Li\nplating. The reduction of the surface conductivity does not\nhave any correlation with the remaining capacity, therefore,\nits influence on cell ageing is assumed negligible.",
      "page_num": 15,
      "chunk_index": 3,
      "section_name": "1 3",
      "token_count": 660
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1115 **Acknowledgements** We thank A. Lützner and P. Gazdzicki for performing and analysing parts of the XPS measurements. The authors\nwould like to point out the contributions made by Renate Hiesgen,\nwho supervised all of the work until her death in November 2018. All\nresponsibility for this publication rests with the authors. **Author contributions** All authors contributed to the study conception\nand design. Material preparation, data collection and analysis were\nperformed by Matthias Simolka, Jan-Frederik Heger and Indro Biswas.\nThe first draft of the manuscript was written by Matthias Simolka and\nall authors commented on previous versions of the manuscript. All\nauthors read and approved the final manuscript. **Funding** Open Access funding enabled and organized by Projekt\nDEAL. The authors gratefully acknowledge the funding by the Federal\nMinistry of Education and Research within the Framework Concept\n“IngenieurNachwuchs” (03FH028IX4) and managed by the Project\nManagement Agency VDI Technologiezentrum GmbH. **Data availability** The datasets generated during and/or analysed during the current study are available from the corresponding author on\nreasonable request. **Compliance with ethical standards** **Conflict of interest** The authors declare that they have no conflict of\ninterest. **Open Access** This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long\nas you give appropriate credit to the original author(s) and the source,\nprovide a link to the Creative Commons licence, and indicate if changes\nwere made. The images or other third party material in this article are\nincluded in the article’s Creative Commons licence, unless indicated\notherwise in a credit line to the material. If material is not included in\nthe article’s Creative Commons licence and your intended use is not\npermitted by statutory regulation or exceeds the permitted use, you will\nneed to obtain permission directly from the copyright holder. To view a\n[copy of this licence, visit http://creat​iveco​mmons​.org/licen​ses/by/4.0/.](http://creativecommons.org/licenses/by/4.0/) **References**",
      "page_num": 16,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 491
    },
    {
      "text": "**References** 1. Wu B, Li N, Ren Y (2011) ­LiFePO4 cathode material. INTECH\nOpen Access Publisher\n2. Padhi AK, Nanjundaswamy KS, Goodenough JBD (1997)\nPhospho-olivines as positive-electrode materials for rechargeable lithium batteries. J Electrochem Soc 144:1188–1194\n3. Padhi AK, Nanjundaswamy KS, Masquelier C, Okada S, Goodenough JB (1997) Effect of structure on the Fe3+/Fe2+ redox\ncouple in iron phosphates. J Electrochem Soc 144:1609–1613\n4. Malik R, Abdellahi A, Ceder G (2013) A Critical Review of the\nLi Insertion Mechanisms in LiFePO [subscript 4] Electrodes.\nElectrochemical Society\n5. Delmas C, Maccario M, Croguennec L, Le Cras F, Weill F\n(2008) Lithium deintercalation in ­LiFePO4 nanoparticles via\n[a domino-cascade model. Nat Mater 7:665–671. https​://doi.](https://doi.org/10.1038/nmat2230)\n[org/10.1038/nmat2​230](https://doi.org/10.1038/nmat2230)\n6. Amine K, Liu J, Belharouak I (2005) High-temperature storage and cycling of C-LiFePO4/graphite Li-ion cells. Electrochem Commun 7:669–673. [https​://doi.org/10.1016/j.eleco​](https://doi.org/10.1016/j.elecom.2005.04.018)\n[m.2005.04.018](https://doi.org/10.1016/j.elecom.2005.04.018) 7 Koltypin M, Aurbach D, Nazar L, Ellis B (2007) More on the\nperformance of ­LiFePO4 electrodes—the effect of synthesis\nroute, solution composition, aging, and temperature J Power\nSources 174:1241–1250 [https​://doi.org/10.1016/j.jpows​](https://doi.org/10.1016/j.jpowsour.2007.06.045)\n[our.2007.06.045](https://doi.org/10.1016/j.jpowsour.2007.06.045)\n8 Safari M, Delacourt C (2011) Aging of a commercial graph[ite/LiFePO4 cell J Electrochem Soc 158:A1123",
      "page_num": 16,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 586
    },
    {
      "text": "Safari M, Delacourt C (2011) Aging of a commercial graph[ite/LiFePO4 cell J Electrochem Soc 158:A1123 https​://doi.](https://doi.org/10.1149/1.3614529)\n[org/10.1149/1.36145​29](https://doi.org/10.1149/1.3614529)\n9 Sun S, Guan T, Shen B, Leng K, Gao Y, Cheng X, Yin G (2017)\nChanges of degradation mechanisms of ­LiFePO4/graphite batteries cycled at different ambient temperatures Electrochim Acta\n[237:248–258 https​://doi.org/10.1016/j.elect​acta.2017.03.158](https://doi.org/10.1016/j.electacta.2017.03.158)\n10 Li D, Danilov DL, Gao L, Yang Y, Notten PHL (2016) Degradation mechanisms of the graphite electrode in ­C6/LiFePO4 batteries unraveled by a non-destructive approach J Electrochem\n[Soc 163:A3016–A3021 https​://doi.org/10.1149/2.08216​14jes​](https://doi.org/10.1149/2.0821614jes)\n11 Herstedt M, Stjerndahl M, Nytén A, Gustafsson T, Rensmo\nH, Siegbahn H, Ravet N, Armand M, Thomas JO, Edström K\n(2003) Surface chemistry of carbon-treated LiFePO[sub 4] particles for Li-ion battery cathodes studied by PES Electrochem\n[Solid State Lett 6:A202 https​://doi.org/10.1149/1.15944​13](https://doi.org/10.1149/1.1594413)\n12 Edström K, Gustafsson T, Thomas JO (2004) The cathode–\nelectrolyte interface in the Li-ion battery Electrochim Acta\n[50:397–403 https​://doi.org/10.1016/j.elect​acta.2004.03.049](https://doi.org/10.1016/j.electacta.2004.03.049)\n13 Hellqvist Kjell M, Malmgren S, Ciosek K, Behm M, Edström\nK, Lindbergh G (2013) Comparing aging of graphite/LiFePO\n4 cells at 22 °C and 55 °C—electrochemical and photoelectron\n[spectroscopy studies J Power Sources 243:290–298",
      "page_num": 16,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "Hellqvist Kjell M, Malmgren S, Ciosek K, Behm M, Edström\nK, Lindbergh G (2013) Comparing aging of graphite/LiFePO\n4 cells at 22 °C and 55 °C—electrochemical and photoelectron\n[spectroscopy studies J Power Sources 243:290–298 https​://doi.](https://doi.org/10.1016/j.jpowsour.2013.06.011)\n[org/10.1016/j.jpows​our.2013.06.011](https://doi.org/10.1016/j.jpowsour.2013.06.011)\n14 Lewerenz M, Warnecke A, Sauer DU (2017) Post-mortem\nanalysis on ­LiFePO4|Graphite cells describing the evolution &\ncomposition of covering layer on anode and their impact on\n[cell performance J Power Sources 369:122–132 https​://doi.](https://doi.org/10.1016/j.jpowsour.2017.10.003)\n[org/10.1016/j.jpows​our.2017.10.003](https://doi.org/10.1016/j.jpowsour.2017.10.003)\n15 Scipioni R, Jørgensen PS, Ngo D-T, Simonsen SB, Liu Z, YakalKremski KJ, Wang H, Hjelm J, Norby P, Barnett SA, Jensen SH\n(2016) Electron microscopy investigations of changes in morphology and conductivity of ­LiFePO4/C electrodes J Power Sources\n[307:259–269 https​://doi.org/10.1016/j.jpows​our.2015.12.119](https://doi.org/10.1016/j.jpowsour.2015.12.119)\n16 Wang J, Yang J, Tang Y, Li R, Liang G, Sham T-K, Sun X\n(2013) Surface aging at olivine ­LiFePO4: a direct visual observation of iron dissolution and the protection role of nano-carbon\n[coating J Mater Chem A 1:1579–1586 https​://doi.org/10.1039/](https://doi.org/10.1039/C2TA00521B)\n[C2TA0​0521B​](https://doi.org/10.1039/C2TA00521B)\n17 Koltypin M, Aurbach D, Nazar L, Ellis B (2006) On the stability of ­LiFePO4 olivine cathodes under various conditions\n(electrolyte solutions, temperatures) Electrochem Solid State\nLett 10(2):A40\n18",
      "page_num": 16,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 596
    },
    {
      "text": "Koltypin M, Aurbach D, Nazar L, Ellis B (2006) On the stability of ­LiFePO4 olivine cathodes under various conditions\n(electrolyte solutions, temperatures) Electrochem Solid State\nLett 10(2):A40\n18 Aurbach D, Markovsky B, Salitra G, Markevich E, Talyossef Y,\nKoltypin M, Nazar L, Ellis B, Kovacheva D (2007) Review on\nelectrode–electrolyte solution interactions, related to cathode\n[materials for Li-ion batteries J Power Sources 165:491–499 https​](https://doi.org/10.1016/j.jpowsour.2006.10.025)\n[://doi.org/10.1016/j.jpows​our.2006.10.025](https://doi.org/10.1016/j.jpowsour.2006.10.025)\n19 An SJ, Li J, Daniel C, Mohanty D, Nagpure S, Wood DL (2016)\nThe state of understanding of the lithium-ion-battery graphite\nsolid electrolyte interphase (SEI) and its relationship to forma[tion cycling Carbon 105:52–76 https​://doi.org/10.1016/j.carbo​](https://doi.org/10.1016/j.carbon.2016.04.008)\n[n.2016.04.008](https://doi.org/10.1016/j.carbon.2016.04.008)\n20 Ramdon S, Bhushan B, Nagpure SC (2014) In situ electrochemical\nstudies of lithium-ion battery cathodes using atomic force micros[copy J Power Sources 249:373–384 https​://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2013.10.099)\n[jpows​our.2013.10.099](https://doi.org/10.1016/j.jpowsour.2013.10.099)\n21 Steinhauer M, Stich M, Kurniawan M, Seidlhofer B-K, Trapp M,\nBund A, Wagner N, Friedrich KA (2017) In situ studies of solid\nelectrolyte interphase (SEI) formation on crystalline carbon surfaces by neutron reflectometry and atomic force microscopy ACS",
      "page_num": 16,
      "chunk_index": 4,
      "section_name": "Content",
      "token_count": 522
    },
    {
      "text": "1116 Journal of Applied Electrochemistry (2020) 50:1101–1117 [Appl Mater Interfaces 9:35794–35801 https​://doi.org/10.1021/](https://doi.org/10.1021/acsami.7b09181)\n[acsam​i.7b091​81](https://doi.org/10.1021/acsami.7b09181)\n22 Hiesgen R, Sörgel S, Costa R, Carlé L, Galm I, Cañas N, Pascucci\nB, Friedrich KA (2013) AFM as an analysis tool for high-capacity\nsulfur cathodes for Li–S batteries Beilstein J Nanotechnol 4:611–\n[624 https​://doi.org/10.3762/bjnan​o.4.68](https://doi.org/10.3762/bjnano.4.68)\n23 Wu J, Yang S, Cai W, Bi Z, Shang G, Yao J (2017) Multi-characterization of ­LiCoO2 cathode films using advanced AFM-based\n[techniques with high resolution Sci Rep 7:11164 https​://doi.](https://doi.org/10.1038/s41598-017-11623-0)\n[org/10.1038/s4159​8-017-11623​-0](https://doi.org/10.1038/s41598-017-11623-0)\n24 Song H, Cao Z, Chen X, Lu H, Jia M, Zhang Z, Lai Y, Li J,\nLiu Y (2013) Capacity fade of ­LiFePO4/graphite cell at elevated\n[temperature J Solid State Electrochem 17:599–605 https​://doi.](https://doi.org/10.1007/s10008-012-1893-2)\n[org/10.1007/s1000​8-012-1893-2](https://doi.org/10.1007/s10008-012-1893-2)\n25 Zavalis TG, Klett M, Kjell MH, Behm M, Lindström RW, Lindbergh G (2013) Aging in lithium-ion batteries: model and experimental investigation of harvested LiFePO4 and mesocarbon\nmicrobead graphite electrodes Electrochim Acta 110:335–348.\n[https​://doi.org/10.1016/j.elect​acta.2013.05.081](https://doi.org/10.1016/j.electacta.2013.05.081)\n26",
      "page_num": 17,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 574
    },
    {
      "text": "Zavalis TG, Klett M, Kjell MH, Behm M, Lindström RW, Lindbergh G (2013) Aging in lithium-ion batteries: model and experimental investigation of harvested LiFePO4 and mesocarbon\nmicrobead graphite electrodes Electrochim Acta 110:335–348.\n[https​://doi.org/10.1016/j.elect​acta.2013.05.081](https://doi.org/10.1016/j.electacta.2013.05.081)\n26 Simolka M, Heger J-F, Traub N, Kaess H, Friedrich KA (2020)\nInfluence of cycling profile, depth of discharge and temperature\non commercial LFP/C cell ageing: cell level analysis with ICA,\nDVA and OCV measurements J Electrochem Soc 167:110502.\n[https​://doi.org/10.1149/1945-7111/ab9cd​1](https://doi.org/10.1149/1945-7111/ab9cd1)\n27 Yang F, Xie Y, Deng Y, Yuan C (2018) Predictive modeling of\nbattery degradation and greenhouse gas emissions from U.S.\n[state-level electric vehicle operation Nat Commun https​://doi.](https://doi.org/10.1038/s41467-018-04826-0)\n[org/10.1038/s4146​7-018-04826​-0](https://doi.org/10.1038/s41467-018-04826-0)\n28 Wang C, Appleby AJ, Little FE (2001) Electrochemical impedance study of initial lithium ion intercalation into graphite pow[ders Electrochim Acta 46:1793–1813 https​://doi.org/10.1016/](https://doi.org/10.1016/S0013-4686(00)00782-9)\n[S0013​-4686(00)00782​-9](https://doi.org/10.1016/S0013-4686(00)00782-9)\n29 Guo Z, Chen Z (2015) High-temperature capacity fading mechanism for LiFePO4/graphite soft-packed cell without Fe dissolu[tion J Electroanal Chem 754:148–153 https​://doi.org/10.1016/j.](https://doi.org/10.1016/j.jelechem.2015.07.009)\n[jelec​hem.2015.07.009](https://doi.org/10.1016/j.jelechem.2015.07.009)\n30 Andersson AM, Edström K, Rao N, Wendsjö Å (1999) Temperature dependence of the passivation layer on graphite",
      "page_num": 17,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 597
    },
    {
      "text": "https​://doi.org/10.1016/j.](https://doi.org/10.1016/j.jelechem.2015.07.009)\n[jelec​hem.2015.07.009](https://doi.org/10.1016/j.jelechem.2015.07.009)\n30 Andersson AM, Edström K, Rao N, Wendsjö Å (1999) Temperature dependence of the passivation layer on graphite J\n[Power Sources 81–82:286–290 https​://doi.org/10.1016/S0378​](https://doi.org/10.1016/S0378-7753(99)00202-5)\n[-7753(99)00202​-5](https://doi.org/10.1016/S0378-7753(99)00202-5)\n31 Andersson AM, Edström K (2001) Chemical composition and\nmorphology of the elevated temperature SEI on graphite J Elec[trochem Soc 148:A1100–A1109 https​://doi.org/10.1149/1.13977​](https://doi.org/10.1149/1.1397771)\n[71](https://doi.org/10.1149/1.1397771)\n32 Lu P, Li C, Schneider EW, Harris SJ (2014) Chemistry, impedance, and morphology evolution in solid electrolyte interphase\nfilms during formation in lithium ion batteries J Phys Chem C\n[118:896–903 https​://doi.org/10.1021/jp411​1019](https://doi.org/10.1021/jp4111019)\n33 Bhattacharya S, Riahi AR, Alpas AT (2014) Thermal cycling\ninduced capacity enhancement of graphite anodes in lithium[ion cells Carbon 67:592–606 https​://doi.org/10.1016/j.carbo​](https://doi.org/10.1016/j.carbon.2013.10.032)\n[n.2013.10.032](https://doi.org/10.1016/j.carbon.2013.10.032)\n34 Waldmann T, Wilka M, Kasper M, Fleischhammer M, WohlfahrtMehrens M (2014) Temperature dependent ageing mechanisms\nin Lithium-ion batteries—a Post-Mortem study J Power Sources\n[262:129–135 https​://doi.org/10.1016/j.jpows​our.2014.03.112](https://doi.org/10.1016/j.jpowsour.2014.03.112)\n35",
      "page_num": 17,
      "chunk_index": 2,
      "section_name": "Content",
      "token_count": 570
    },
    {
      "text": "J Power Sources\n[262:129–135 https​://doi.org/10.1016/j.jpows​our.2014.03.112](https://doi.org/10.1016/j.jpowsour.2014.03.112)\n35 Liu L, Park J, Lin X, Sastry AM, Lu W (2014) A thermalelectrochemical model that gives spatial-dependent growth of\nsolid electrolyte interphase in a Li-ion battery J Power Sources\n[268:482–490 https​://doi.org/10.1016/j.jpows​our.2014.06.050](https://doi.org/10.1016/j.jpowsour.2014.06.050)\n36 Lee S-B, Pyun S-I (2002) The effect of electrolyte temperature on\nthe passivity of solid electrolyte interphase formed on a graphite\n[electrode Carbon 40:2333–2339 https​://doi.org/10.1016/S0008​](https://doi.org/10.1016/S0008-6223(02)00144-6)\n[-6223(02)00144​-6](https://doi.org/10.1016/S0008-6223(02)00144-6)\n37 Anseán D, Dubarry M, Devie A, Liaw BY, García VM, Viera\nJC, González M (2016) Fast charging technique for high",
      "page_num": 17,
      "chunk_index": 3,
      "section_name": "Content",
      "token_count": 312
    },
    {
      "text": "power LiFePO 4 batteries: a mechanistic analysis of aging J\nPower Sources 321:201–209 [https​://doi.org/10.1016/j.jpows​](https://doi.org/10.1016/j.jpowsour.2016.04.140)\n[our.2016.04.140](https://doi.org/10.1016/j.jpowsour.2016.04.140)\n38 Leroy S, Blanchard F, Dedryvère R, Martinez H, Carré B, Lemordant D, Gonbeau D (2005) Surface film formation on a graphite\nelectrode in Li-ion batteries: AFM and XPS study Surf Interface\n[Anal 37:773–781 https​://doi.org/10.1002/sia.2072](https://doi.org/10.1002/sia.2072)\n39 Petzl M, Danzer MA (2014) Nondestructive detection, characterization, and quantification of lithium plating in commercial\n[lithium-ion batteries J Power Sources 254:80–87 https​://doi.](https://doi.org/10.1016/j.jpowsour.2013.12.060)\n[org/10.1016/j.jpows​our.2013.12.060](https://doi.org/10.1016/j.jpowsour.2013.12.060)\n40 Chen M, Shao L-L, Yang H-B, Ren T-Z, Du G, Yuan Z-Y (2015)\nVanadium-doping of LiFePO4/carbon composite cathode materials synthesized with organophosphorus source Electrochim Acta\n[167:278–286 https​://doi.org/10.1016/j.elect​acta.2015.03.185](https://doi.org/10.1016/j.electacta.2015.03.185)\n41 Wandt J, Freiberg A, Thomas R, Gorlin Y, Siebel A, Jung R,\nGasteiger HA, Tromp M (2016) Transition metal dissolution and\ndeposition in Li-ion batteries investigated by operando X-ray\n[absorption spectroscopy J Mater Chem A 4:18300–18305 https​](https://doi.org/10.1039/C6TA08865A)\n[://doi.org/10.1039/C6TA0​8865A​](https://doi.org/10.1039/C6TA08865A)\n42 Talyosef Y, Markovsky B, Salitra G, Aurbach D, Kim H-J, Choi\nS (2005) The study of LiNi0.5Mn1.5O4 5-V cathodes for Li-ion\n[batteries",
      "page_num": 17,
      "chunk_index": 4,
      "section_name": "1 3",
      "token_count": 596
    },
    {
      "text": "https​](https://doi.org/10.1039/C6TA08865A)\n[://doi.org/10.1039/C6TA0​8865A​](https://doi.org/10.1039/C6TA08865A)\n42 Talyosef Y, Markovsky B, Salitra G, Aurbach D, Kim H-J, Choi\nS (2005) The study of LiNi0.5Mn1.5O4 5-V cathodes for Li-ion\n[batteries J Power Sources 146:664–669 https​://doi.org/10.1016/j.](https://doi.org/10.1016/j.jpowsour.2005.03.064)\n[jpows​our.2005.03.064](https://doi.org/10.1016/j.jpowsour.2005.03.064)\n43 Li D, Danilov DL, Gao L, Yang Y, Notten PHL (2016) Degradation mechanisms of C6/LiFePO4 batteries: experimental analyses\n[of cycling-induced aging Electrochimica Acta 210:445–455 https​](https://doi.org/10.1016/j.electacta.2016.05.091)\n[://doi.org/10.1016/j.elect​acta.2016.05.091](https://doi.org/10.1016/j.electacta.2016.05.091)\n44 Lai Y, Cao Z, Song H, Zhang Z, Chen X, Lu H, Jia M, Li J\n(2012) Influence of Fe (II) species in electrolyte on performance\nof graphite anode for lithium-ion batteries J Electrochem Soc\n[159:A1961–A1966 https​://doi.org/10.1149/2.04421​2jes](https://doi.org/10.1149/2.044212jes)\n45 Xiao Y, Hao D, Chen H, Gong Z, Yang Y (2013) Economical\nsynthesis and promotion of the electrochemical performance of\nsilicon nanowires as anode material in Li-ion batteries ACS Appl\n[Mater Interfaces 5:1681–1687 https​://doi.org/10.1021/am302​](https://doi.org/10.1021/am302731y)\n[731y](https://doi.org/10.1021/am302731y)\n46 Sun H-H, Dolocan A, Weeks JA, Rodriguez R, Heller A, Mullins CB (2019) In situ formation of a multicomponent inorganicrich SEI layer provides a fast charging and high specific energy\n[Li-metal battery J Mater Chem A 7:17782–17789",
      "page_num": 17,
      "chunk_index": 5,
      "section_name": "1 3",
      "token_count": 591
    },
    {
      "text": "Sun H-H, Dolocan A, Weeks JA, Rodriguez R, Heller A, Mullins CB (2019) In situ formation of a multicomponent inorganicrich SEI layer provides a fast charging and high specific energy\n[Li-metal battery J Mater Chem A 7:17782–17789 https​://doi.](https://doi.org/10.1039/C9TA05063A)\n[org/10.1039/C9TA0​5063A​](https://doi.org/10.1039/C9TA05063A)\n47 Zhu J, Zeng K, Lu L (2012) Cycling effects on surface morphology, nanomechanical and interfacial reliability of LiMn2O4 cathode in thin film lithium ion batteries Electrochim Acta 68:52–59.\n[https​://doi.org/10.1016/j.elect​acta.2012.02.032](https://doi.org/10.1016/j.electacta.2012.02.032)\n48 Ramdon S, Bhushan B (2012) High resolution morphology\nand electrical characterization of aged Li-ion battery cathode.\n[J Colloid Interface Sci 380:187–191 https​://doi.org/10.1016/j.](https://doi.org/10.1016/j.jcis.2012.05.026)\n[jcis.2012.05.026](https://doi.org/10.1016/j.jcis.2012.05.026)\n49 Kostecki R, Zhang X, Ross Jr PN, Kong F, Sloop S, Kerr JB,\nStriebel K, Cairns E, McLarnon F (2001) Failure modes in highpower lithium-ion batteries for use inhybrid electric vehicles\n50 Demirocak DE, Bhushan B (2015) Probing the aging effects on\nnanomechanical properties of a ­LiFePO4 cathode in a large for[mat prismatic cell J Power Sources 280:256–262 https​://doi.](https://doi.org/10.1016/j.jpowsour.2015.01.114)\n[org/10.1016/j.jpows​our.2015.01.114](https://doi.org/10.1016/j.jpowsour.2015.01.114)\n51 Aurbach D (1996) A comparative study of synthetic graphite and\nLi electrodes in electrolyte solutions based on ethylene carbonate[dimethyl carbonate mixtures J Electrochem Soc 143:3809 https​](https://doi.org/10.1149/1.1837300)\n[://doi.org/10.1149/1.18373​00](https://doi.org/10.1149/1.1837300)\n52",
      "page_num": 17,
      "chunk_index": 6,
      "section_name": "1 3",
      "token_count": 599
    },
    {
      "text": "J Electrochem Soc 143:3809 https​](https://doi.org/10.1149/1.1837300)\n[://doi.org/10.1149/1.18373​00](https://doi.org/10.1149/1.1837300)\n52 Wang Y-S, Huang C-M, Hsieh H-W, Lin Y-F, Lin C-Y, Lee J-T\n(2014) Effect of temperature on the dissolution of solid electrolyte interface on mesocarbon microbeads electrodes in propylene\n[carbonate-based electrolytes Electrochim Acta 142:34–42 https​](https://doi.org/10.1016/j.electacta.2014.07.091)\n[://doi.org/10.1016/j.elect​acta.2014.07.091](https://doi.org/10.1016/j.electacta.2014.07.091)",
      "page_num": 17,
      "chunk_index": 7,
      "section_name": "1 3",
      "token_count": 204
    },
    {
      "text": "Journal of Applied Electrochemistry (2020) 50:1101–1117 1117 53. Klett M, Eriksson R, Groot J, Svens P, Ciosek Högström K,\nLindström RW, Berg H, Gustafson T, Lindbergh G, Edström\nK (2014) Non-uniform aging of cycled commercial LiFePO4//\ngraphite cylindrical cells revealed by post-mortem analysis. J\nPower Sources 257:126–137. [https​://doi.org/10.1016/j.jpows​](https://doi.org/10.1016/j.jpowsour.2014.01.105)\n[our.2014.01.105](https://doi.org/10.1016/j.jpowsour.2014.01.105)\n54. Hovington P, Lagacé M, Guerfi A, Bouchard P, Mauger A, Julien\nCM, Armand M, Zaghib K (2015) New lithium metal polymer\nsolid state battery for an ultrahigh energy: nano C-LiFePO4 versus\n[nano ­Li1.2V3O8. Nano Lett 15:2671–2678. https​://doi.org/10.1021/](https://doi.org/10.1021/acs.nanolett.5b00326)\n[acs.nanol​ett.5b003​26](https://doi.org/10.1021/acs.nanolett.5b00326) **Affiliations** 55. Lewerenz M, Marongiu A, Warnecke A, Sauer DU (2017) Differential voltage analysis as a tool for analyzing inhomogeneous aging: a case study for LiFePO4|Graphite cylindrical cells.\nJ Power Sources 368:57–67. [https​://doi.org/10.1016/j.jpows​](https://doi.org/10.1016/j.jpowsour.2017.09.059)\n[our.2017.09.059](https://doi.org/10.1016/j.jpowsour.2017.09.059) **Publisher’s Note** Springer Nature remains neutral with regard to\njurisdictional claims in published maps and institutional affiliations. **M. Simolka** **[1]** **[· J. ‑F. Heger](http://orcid.org/0000-0003-4613-1236)** **[1]** **· H. Kaess** **[1]** **· I. Biswas** **[2]** **· K. A. Friedrich** **[2,3]** 1 Faculty of Basic Sciences, University of Applied Sciences\nEsslingen, 73728 Esslingen, Germany",
      "page_num": 18,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 590
    },
    {
      "text": "1 Faculty of Basic Sciences, University of Applied Sciences\nEsslingen, 73728 Esslingen, Germany 2 Institute of Engineering Thermodynamics, German\nAerospace Center (DLR), Pfaffenwaldring 38‑40,\n70569 Stuttgart, Germany 3 Institute of Building Energetics, Thermal Engineering\nand Energy Storage (IGTE), University of Stuttgart,\nPfaffenwaldring 31, 70569 Stuttgart, Germany",
      "page_num": 18,
      "chunk_index": 1,
      "section_name": "Content",
      "token_count": 91
    }
  ],
  "total_chunks": 52,
  "created_at": "2026-02-04 15:53:43"
}