{
  "filename": "Severson_NatureEnergy_2019.pdf",
  "chunks": [
    {
      "text": "**[Kristen A. Severson](http://orcid.org/0000-0002-0412-4217)** **[1,5]** **[, Peter M. Attia](http://orcid.org/0000-0003-4745-5726)** **[2,5]** **[, Norman Jin](http://orcid.org/0000-0003-0624-1924)** **[2]** **[, Nicholas Perkins](http://orcid.org/0000-0002-0445-8436)** **[2]** **[, Benben Jiang](http://orcid.org/0000-0003-1288-3798)** **[1]** **,**\n**[Zi Yang](http://orcid.org/0000-0003-3741-5720)** **[2]** **[, Michael H. Chen](http://orcid.org/0000-0003-4273-5817)** **[2]** **[, Muratahan Aykol](http://orcid.org/0000-0001-6433-7217)** **[3]** **[, Patrick K. Herring](http://orcid.org/0000-0001-9922-1169)** **[3]** **[, Dimitrios Fraggedakis](http://orcid.org/0000-0003-3301-6255)** **[1]** **,**\n**[Martin Z. Bazant](http://orcid.org/0000-0002-8200-4501)** **[1]** **[, Stephen J. Harris](http://orcid.org/0000-0002-5211-3934)** **[2,4]** **[, William C. Chueh](http://orcid.org/0000-0002-7066-3470)** **[2]** **[* and Richard D. Braatz](http://orcid.org/0000-0003-4304-3484)** **[1]** *****",
      "page_num": 2,
      "chunk_index": 0,
      "section_name": "**Data-driven prediction of battery cycle life before** **capacity degradation**",
      "token_count": 425
    },
    {
      "text": "**Accurately predicting the lifetime of complex, nonlinear systems such as lithium-ion batteries is critical for accelerating tech-**\n**nology development. However, diverse aging mechanisms, significant device variability and dynamic operating conditions**\n**have remained major challenges. We generate a comprehensive dataset consisting of 124 commercial lithium iron phosphate/**\n**graphite cells cycled under fast-charging conditions, with widely varying cycle lives ranging from 150 to 2,300 cycles. Using**\n**discharge voltage curves from early cycles yet to exhibit capacity degradation, we apply machine-learning tools to both predict**\n**and classify cells by cycle life. Our best models achieve 9.1% test error for quantitatively predicting cycle life using the first 100**\n**cycles (exhibiting a median increase of 0.2% from initial capacity) and 4.9% test error using the first 5 cycles for classifying**\n**cycle life into two groups. This work highlights the promise of combining deliberate data generation with data-driven modelling**\n**to predict the behaviour of complex dynamical systems.**",
      "page_num": 2,
      "chunk_index": 1,
      "section_name": "**Data-driven prediction of battery cycle life before** **capacity degradation**",
      "token_count": 219
    },
    {
      "text": "ithium-ion batteries are deployed in a wide range of applications due to their low and falling costs, high energy densities\nand long lifetimes [1][–][3] . However, as is the case with many chemi# L\ncal, mechanical and electronic systems, long battery lifetime entails\ndelayed feedback of performance, often many months to years.\nAccurate prediction of lifetime using early-cycle data would unlock\nnew opportunities in battery production, use and optimization. For\nexample, manufacturers can accelerate the cell development cycle,\nperform rapid validation of new manufacturing processes and sort/\ngrade new cells by their expected lifetime. Likewise, end users could\nestimate their battery life expectancy [4][–][6] . One emerging application\nenabled by early prediction is high-throughput optimization of\nprocesses spanning large parameter spaces (Supplementary Figs. 1\nand 2), such as multistep fast charging and formation cycling, which\nare otherwise intractable due to the extraordinary time required.\nThe task of predicting lithium-ion battery lifetime is critically\nimportant given its broad utility but challenging due to nonlinear\ndegradation with cycling and wide variability, even when controlling for operating conditions [7][–][11] .\nMany previous studies have modelled lithium-ion battery lifetime. Bloom et al. [12] and Broussely et al. [13] performed early work that\nfitted semi-empirical models to predict power and capacity loss.\nSince then, many authors have proposed physical and semi-empirical models that account for diverse mechanisms such as growth of\nthe solid–electrolyte interphase [14][,][15], lithium plating [16][,][17], active material loss [18][,][19] and impedance increase [20][–][22] . Predictions of remaining\nuseful life in battery management systems, summarized in these\nreviews [5][,][6], often rely on these mechanistic and semi-empirical models for state estimation. Specialized diagnostic measurements such\nas coulombic efficiency [23][,][24] and impedance spectroscopy [25][–][27] can\nalso be used for lifetime estimation. While these chemistry and/or\nmechanism-specific models have shown predictive success, developing models that describe full cells cycled under relevant operating",
      "page_num": 2,
      "chunk_index": 2,
      "section_name": "**Data-driven prediction of battery cycle life before** **capacity degradation**",
      "token_count": 473
    },
    {
      "text": "conditions (for example, fast charging) remains challenging, given\nthe many degradation modes and their coupling to thermal [28][,][29] and\nmechanical [28][,][30] heterogeneities within a cell [30][–][32] .\nApproaches using statistical and machine-learning techniques\nto predict cycle life are attractive, mechanism-agnostic alternatives.\nRecently, advances in computational power and data generation\nhave enabled these techniques to accelerate progress for a variety\nof tasks, including prediction of material properties [33][,][34], identification of chemical synthesis routes [35] and material discovery for energy\nstorage [36][–][38] and catalysis [39] . A growing body of literature [6][,][40][,][41] applies\nmachine-learning techniques for predicting the remaining useful\nlife of batteries using data collected in both laboratory and online\nenvironments. Generally, these works make predictions after accumulating data corresponding to degradation of at least 25% along\nthe trajectory to failure [42][–][48] or using specialized measurements at\nthe beginning of life [11] . Accurate early prediction of cycle life with\nsignificantly less degradation is challenging because of the typically\nnonlinear degradation process (with negligible capacity degradation in early cycles) as well as the relatively small datasets used to\ndate that span a limited range of lifetimes [49] . For example, Harris\net al. [10] found a weak correlation ( _ρ_ = 0.1) between capacity values\nat cycle 80 and capacity values at cycle 500 for 24 cells exhibiting\nnonlinear degradation profiles, illustrating the difficulty of this task.\nMachine-learning approaches are especially attractive for high-rate\noperating conditions, where first-principles models of degradation\nare often unavailable. In short, opportunities for improving upon\nstate-of-the-art prediction models include higher accuracy, earlier\nprediction, greater interpretability and broader application to a\nwide range of cycling conditions.\nIn this work, we develop data-driven models that accurately\npredict the cycle life of commercial lithium iron phosphate (LFP)/\ngraphite cells using early-cycle data, with no prior knowledge of\ndegradation mechanisms. We generated a dataset of 124 cells with 1Department of Chemical Engineering, Massachusetts Institute of Technology, Cambridge, MA, USA. 2Department of Materials Science and Engineering,\nStanford University, Stanford, CA, USA. [3] Toyota Research Institute, Los Altos, CA, USA. [4] Materials Science Division, Lawrence Berkeley National Lab,\nBerkeley, CA, USA. [5] [These authors contributed equally: K. A. Severson, P. M. Attia. *e-mail: wchueh@stanford.edu; braatz@mit.edu](mailto:wchueh@stanford.edu)",
      "page_num": 2,
      "chunk_index": 3,
      "section_name": "**Data-driven prediction of battery cycle life before** **capacity degradation**",
      "token_count": 581
    },
    {
      "text": "**Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy) **383**",
      "page_num": 2,
      "chunk_index": 4,
      "section_name": "**Data-driven prediction of battery cycle life before** **capacity degradation**",
      "token_count": 40
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 3,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "**a** **b** 1.10 1.05 1.00 0.95 0.90 1.10 1.05 1.00 **c** 0 0 100 200 300 400 500 600 700 800 900 1,000 Cycle number 100 50 0 0.96 0.98 1.00 1.02 Capacity ratio, cycles 100:2 20 40 60 80 100 Cycle number 10 [3] 10 [2] 1 1.1 Discharge capacity at cycle 2 (Ah) 10 [3] 10 [3] 1 1.1 Discharge capacity at cycle 100 (Ah) 10 [2] 10 [2] –2 –1 0 Slope of discharge capacity\ncycles 95–100 (mAh per cycle) **Fig. 1 |** **Poor predictive performance of features based on discharge capacity in the first 100 cycles.** **a**, Discharge capacity for the first 1,000 cycles of LFP/\ngraphite cells. The colour of each curve is scaled by the battery’s cycle life, as is done throughout the manuscript. **b**, A detailed view of **a**, showing only the\nfirst 100 cycles. A clear ranking of cycle life has not emerged by cycle 100. **c**, Histogram of the ratio between the discharge capacity of cycle 100 and that\nof cycle 2. The cell with the highest degradation (90%) is excluded to show the detail of the rest of the distribution. The dotted line indicates a ratio of\n1.00. Most cells have a slightly higher capacity at cycle 100 relative to cycle 2. **d**, Cycle life as a function of discharge capacity at cycle 2. The correlation\ncoefficient of capacity at cycle 2 and log cycle life is −0.06 (remains unchanged on exclusion of the shortest-lived battery). **e**, Cycle life as a function of\ndischarge capacity at cycle 100. The correlation coefficient of capacity at cycle 100 and log cycle life is 0.27 (0.08 excluding the shortest-lived battery).\n**f**, Cycle life as a function of the slope of the discharge capacity curve for cycles 95–100. The correlation coefficient of this slope and log cycle life is 0.47\n(0.36 excluding the shortest-lived battery).",
      "page_num": 3,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 490
    },
    {
      "text": "cycle lives ranging from 150 to 2,300 using 72 different fast-charging conditions, with cycle life (or equivalently, end of life) defined\nas the number of cycles until 80% of nominal capacity. For quantitatively predicting cycle life, our feature-based models can achieve\nprediction errors of 9.1% using only data from the first 100 cycles, at\nwhich point most batteries have yet to exhibit capacity degradation.\nFurthermore, using data from the first 5 cycles, we demonstrate\nclassification into low- and high-lifetime groups and achieve a misclassification test error of 4.9%. These results illustrate the power of\ncombining data generation with data-driven modelling to predict\nthe behaviour of complex systems far into the future. **Data generation**\nWe expect the space that parameterizes capacity fade in lithiumion batteries to be high dimensional due to their many capacity fade mechanisms and manufacturing variability. To probe\nthis space, commercial LFP/graphite cells (A123 Systems, model APR18650M1A, 1.1 Ah nominal capacity) were cycled in a temperature-controlled environmental chamber (30 °C) under varied fast-charging conditions but identical discharging conditions\n(4 _C_ to 2.0 V, where 1 _C_ is 1.1 A; see Methods for details). Since the\ngraphite negative electrode dominates degradation in these cells,\nthese results could be useful for other lithium-ion batteries based\non graphite [32][,][50][–][54] . We probe average charging rates ranging from\n3.6 _C_, the manufacturer’s recommended fast-charging rate, to 6 _C_\nto probe the performance of current-generation power cells under\nextreme fast-charging conditions (~10 min charging), an area of\nsignificant commercial interest [55] . By deliberately varying the charging conditions, we generate a dataset that captures a wide range of\ncycle lives, from approximately 150 to 2,300 cycles (average cycle\nlife of 806 with a standard deviation of 377). While the chamber\ntemperature is controlled, the cell temperatures vary by up to 10 °C\nwithin a cycle due to the large amount of heat generated during\ncharge and discharge. This temperature variation is a function of **384** **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy)",
      "page_num": 3,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 511
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 4,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "**a** 3.5 3.0 2.5 2.0 3.5 3.0 2.5 2.0 0 0.5 1.0 Discharge capacity (Ah) **b** –0.1 0 Q100 – Q10 (Ah) **c** 10 [3] 2,300 1,860 1,420 980 540 100 10 [2] 10 [–6] 10 [–4] 10 [–2] Var(∆Q100–10(V)) **Fig. 2 |** **High performance of features based on voltage curves from the first 100 cycles.** **a**, Discharge capacity curves for 100th and 10th cycles for a\nrepresentative cell. **b**, Difference of the discharge capacity curves as a function of voltage between the 100th and 10th cycles, Δ _Q_ 100-10( _V_ ), for 124 cells.\n**c**, Cycle life plotted as a function of the variance of Δ _Q_ 100-10( _V_ ) on a log–log axis, with a correlation coefficient of −0.93. In all plots, the colours are\ndetermined based on the final cycle lifetime. In **c**, the colour is redundant with the _y_ -axis. In **b** and **c**, the shortest lived battery is excluded. 2,000 1,000 |Col1|Col2|b|Col4|Col5|c|Col7|\n|---|---|---|---|---|---|---|\n||20<br>10<br>0<br>–500 0 500|2,000<br>1,000<br>0<br>Predicted cycle life<br>||20<br>10<br>0<br>–500 0 500|2,000<br>1,000<br>0<br>Predicted cycle life<br>|20<br>10<br>0<br>–500 0 500|\n|||||||| 0 1,000 2,000 0 1,000 2,000 0 1,000 2,000 Observed cycle life Observed cycle life Observed cycle life",
      "page_num": 4,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 462
    },
    {
      "text": "Observed cycle life Observed cycle life Observed cycle life **Fig. 3 |** **Observed and predicted cycle lives for several implementations of the feature-based model.** The training data are used to learn the model\nstructure and coefficient values. The testing data are used to assess generalizability of the model. We differentiate the primary test and secondary test\ndatasets because the latter was generated after model development. The vertical dotted line indicates when the prediction is made in relation to the\nobserved cycle life. The inset shows the histogram of residuals (predicted – observed) for the primary and secondary test data. **a**, ‘Variance’ model using\nonly the log variance of Δ _Q_ 100-10( _V_ ). **b**, ‘Discharge’ model using six features based only on discharge cycle information, described in Supplementary Table\n1. **c**, ‘Full’ model using the nine features described in Supplementary Table 1. Because some temperature probes lost contact during experimentation, four\ncells are excluded from the full model analysis. internal impedance and charging policy (Supplementary Figs. 3\nand 4). Voltage, current, cell can temperature and internal resistance are continuously measured during cycling (see Methods for\nadditional experimental details). The dataset contains approximately 96,700 cycles; to the best of the authors’ knowledge, our\ndataset is the largest publicly available for nominally identical commercial lithium-ion batteries cycled under controlled conditions\n(see Data availability section for access information).\nFig. 1a,b shows the discharge capacity as a function of cycle\nnumber for the first 1,000 cycles, where the colour denotes cycle\nlife. The capacity fade is negligible in the first 100 cycles and accelerates near the end of life, as is often observed in lithium-ion batteries. The crossing of the capacity fade trajectories illustrates the\nweak relationship between initial capacity and lifetime; indeed,\nwe find weak correlations between the log of cycle life and the\ndischarge capacity at the second cycle ( _ρ_ = −0.06, Fig. 1d) and\nthe 100th cycle ( _ρ_ = 0.27, Fig. 1e), as well as between the log of cycle\nlife and the capacity fade rate near cycle 100 ( _ρ_ = 0.47, Fig. 1f).\nThese weak correlations are expected because capacity degradation in these early cycles is negligible; in fact, the capacities at cycle\n100 increased from the initial values for 81% of cells in our dataset\n(Fig. 1c). Small increases in capacity after a slow cycle or rest period\nare attributed to charge stored in the region of the negative electrode that extends beyond the positive electrode [56][,][57] . Given the limited predictive power of these correlations based on the capacity",
      "page_num": 4,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 580
    },
    {
      "text": "fade curves, we employ an alternative data-driven approach that\nconsiders a larger set of cycling data including the full voltage\ncurves of each cycle, as well as additional measurements including\ncell internal resistance and temperature. **Machine-learning approach**\nWe use a feature-based approach to build an early-prediction model.\nIn this paradigm, features, which are linear or nonlinear transformations of the raw data, are generated and used in a regularized linear\nframework, the elastic net [58] . The final model uses a linear combination of a subset of the proposed features to predict the logarithm\nof cycle life. Our choice of a regularized linear model allows us to\npropose domain-specific features of varying complexity while maintaining high interpretability. Linear models also have low computational cost; the model can be trained offline, and online prediction\nrequires only a single dot product after data preprocessing.\nWe propose features from domain knowledge of lithium-ion\nbatteries (though agnostic to chemistry and degradation mechanisms), such as initial discharge capacity, charge time and cell can\ntemperature. To capture the electrochemical evolution of individual cells during cycling, several features are calculated based on\nthe discharge voltage curve (Fig. 2a). Specifically, we consider the\ncycle-to-cycle evolution of _Q_ ( _V_ ), the discharge voltage curve as a\nfunction of voltage for a given cycle. As the voltage range is identical for every cycle, we consider capacity as a function of voltage, as **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy) **385**",
      "page_num": 4,
      "chunk_index": 3,
      "section_name": "Articles",
      "token_count": 340
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 5,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "opposed to voltage as a function of capacity, to maintain a uniform\nbasis for comparing cycles. For instance, we can consider the change\nin discharge voltage curves between cycles 20 and 30, denoted\nΔ _Q_ 30-20( _V_ ) = _Q_ 30( _V_ ) – _Q_ 20( _V_ ), where the subscripts indicate cycle\nnumber. This transformation, Δ _Q_ ( _V_ ), is of particular interest\nbecause voltage curves and their derivatives are a rich data source\nthat is effective in degradation diagnosis [50][,][51][,][53][,][59][–][64] .\nThe _ΔQ_ ( _V_ ) curves for our dataset are shown in Fig. 2b using the\n100th and 10th cycles, that is, Δ _Q_ 100-10( _V_ ). We discuss our selection of these cycle numbers at a later point. Summary statistics, for\nexample minimum, mean and variance, were then calculated for the\nΔ _Q_ ( _V_ ) curves of each cell. Each summary statistic is a scalar quantity that captures the change in voltage curves between two cycles.\nIn our data-driven approach, these summary statistics are selected\nfor their predictive ability, not their physical meaning. Immediately,\na clear trend emerges between cycle life and a summary statistic,\nspecifically variance, applied to Δ _Q_ 100-10( _V_ ) (Fig. 2c).\nBecause of the high predictive power of features based on\nΔ _Q_ 100-10( _V_ ), we investigate three different models using (1) only the\nvariance of Δ _Q_ 100-10( _V_ ), (2) additional candidate features obtained\nduring discharge and (3) features from additional data streams such\nas temperature and internal resistance. In all cases, data were taken\nonly from the first 100 cycles. These three models, each with progressively more candidate features, were chosen to evaluate both\nthe cost–benefit of acquiring additional data streams and the limits of prediction accuracy. The training data (41 cells) are used to\nselect the model features and set the values of the coefficients, and\nthe primary testing data (43 cells) are used to evaluate the model\nperformance. We then evaluate the model on a secondary testing\ndataset (40 cells) generated after model development. Two metrics,\ndefined in the ‘Machine-learning model development’ section, are\nused to evaluate our predictive performance: root-mean-squared\nerror (RMSE), with units of cycles, and average percentage error.",
      "page_num": 5,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 555
    },
    {
      "text": "**Performance of early prediction models**\nWe present three models to predict cycle life using increasing\ncandidate feature set sizes; the candidate features are detailed in\nSupplementary Table 1 and Supplementary Note 1. The first model,\ndenoted as the ‘variance’ model, does not consider subset selection and uses only the log variance of Δ _Q_ 100-10( _V_ ) for prediction.\nSurprisingly, using only this single feature results in a model with\napproximately 15% average percentage error on the primary test\ndataset and approximately 11% average percentage error on the secondary test dataset. We stress the error metrics of the secondary test\ndataset, as these data had not been generated at the time of model\ndevelopment and are thus a rigorous test of model performance. The\nsecond, ‘discharge’ model, considers additional information derived\nfrom measurements of voltage and current during discharge in the\nfirst 100 cycles (row blocks 1 and 2 of Supplementary Table 1).\nOf 13 features, 6 were selected. Finally, the third, ‘full’ model con­\nsi­ders all available features (all rows blocks of Supplementary\nTable 1). In this model, 9 out of 20 features were selected\n(Supplementary Fig. 5). As expected, by adding additional features,",
      "page_num": 5,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 273
    },
    {
      "text": "the primary test average percentage error decreases to 7.5% and\nthe secondary test average percentage error decreases slightly\nto 10.7%. The error for the secondary test set is slightly higher\nfor the full model when compared with the discharge model\n(Supplementary Note 2 and Supplementary Figs. 6–7). In all cases,\nthe average percentage error is less than 15% and decreases to as\nlittle as 7.5% in the full model, excluding an anomalous cell. Table 1\nand Fig. 3 display the performance of the ‘variance’, ‘discharge’ and\n‘full’ models applied to our three datasets.\nWe benchmark the performance of our cycle life prediction\nusing early-cycle data against both prior literature and naïve models. A relevant metric is the extent of degradation that has to occur\nbefore an accurate prediction can be made. In our work, accurate\nprediction was achieved using voltage curves from early cycles corresponding to a capacity increase of 0.2% (median) relative to initial values (with the first and third quartile percentiles being 0.06%\nand 0.34%, respectively; see Fig. 1c). We are unaware of previous\nearly-prediction demonstrations that do not require degradation\nin the battery capacity or specialized measurements. In fact, published models [42][–][48] generally require data corresponding to at least\n25% capacity degradation before making predictions at an accuracy\ncomparable to that of this work. We also benchmark our model\nperformance using naïve models, for example univariate models\nand/or models that only utilize information from the capacity\nfade curve (Supplementary Note 3, Supplementary Figs. 8–13 and\nSupplementary Tables 2–3). Notably, if the average cycle life of the\ntraining data is used for prediction, the average percentage error\nis approximately 30% and 36% for the primary and secondary test\nsets, respectively. Using data from the first 100 cycles, the most\ncomplex benchmark model using only features from the discharge\ncapacity fade curve has errors of 23% and 50% for the primary and\nsecondary test sets, respectively. In fact, a similar model that uses\ndischarge capacity fade curve data from the first 300 cycles achieves\ncomparable performance (27% and 46% for the primary and\nsecondary test data, respectively), highlighting the difficulty of\nprediction without using voltage features.\nWe also consider contexts in which predictions are required at\nvery low cycle number but the accuracy requirements are less stringent, such as sorting/grading and pack design applications. As an\nexample, we develop a logistic regression model to classify cells into **386** **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy)",
      "page_num": 5,
      "chunk_index": 3,
      "section_name": "Articles",
      "token_count": 599
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 6,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "0 –10 –20 –30 1.0 0.5 0 0 –2 –4 –6 –8 0.2 0 –0.2 –0.4 2.0 2.5 3.0 3.5 Voltage (V) 2.0 2.5 3.0 3.5 Voltage (V) 2.0 2.5 3.0 3.5 Voltage (V) Cycle 1/10 Cycle 100/101 End of life **Fig. 4 |** **Transformations of voltage–capacity discharge curves for three fast-charged cells that were tested with periodic slow diagnostic cycles.**\n**a** - **c**, d _Q_ /d _V_ at _C_ /10; **d** - **f**, d _V_ /d _Q_ at _C_ /10; **g** - **i**, d _Q_ /d _V_ at 4 _C_ ; **j** - **l**, Δ _Q_ ( _V_ ) at 4 _C_ . **a**, **d**, **g**, **j**, 4 _C_ /4 _C_ ; **b**, **e**, **h**, **k**, 6 _C_ /4 _C_ ; **c**, **f**, **i**, **l**, 8 _C_ /4 _C_ . The solid black line is the first\ncycle (cycle 10 for fast cycling), the dotted grey line is cycle 101 or 100 (fast and slow, respectively) and the coloured thick line is the end-of-life cycle\n(80% state-of-health). The colour of the end-of-life cycle is consistent with the colour scale in Figs. 1 and 2. For Δ _Q_ ( _V_ ), a thin dotted grey line is added\nevery 100 cycles. The patterns observed using slow cycling are consistent with LAMdeNE and loss of lithium inventory (Supplementary Fig. 18). The features\nare smeared during fast charging. The log variance Δ _Q_ ( _V_ ) model dataset predicts the lifetime of these cells within 15%.",
      "page_num": 6,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 459
    },
    {
      "text": "either a ‘low-lifetime’ or a ‘high-lifetime’ group, using only the first\nfive cycles for various cycle life thresholds. For the ‘variance classifier’, we use only the Δ _Q_ ( _V_ ) variance feature between the fourth\nand fifth cycles, var(Δ _Q_ 5-4( _V_ )), and attain a test classification accuracy of 88.8%. For the ‘full classifier’, we use regularized logistic\nregression with 18 candidate features to achieve a test classification\naccuracy of 95.1%. These results are summarized in Table 2 and\ndetailed in Supplementary Note 4, Supplementary Fig. 14–17 and\nSupplementary Tables 4–6. This approach illustrates the predictive\nability of Δ _Q_ ( _V_ ) even if data from the only first few cycles are used,\nand, more broadly, showcases our flexibility to tailor data-driven\nmodels to various use cases. **Rationalization of predictive performance**\nWhile models that include features from all available data streams\ngenerally have the lowest errors, our predictive ability primary\ncomes from features based on transformations of the voltage curves,\nas evidenced by the performance of the single-feature ‘variance’\nmodel. This feature is consistently selected in both models with feature selection (‘discharge’ and ‘full’). Other transformations of the\nvoltage curves can also be used to predict cycle life; for example, the\nfull model selects both the minimum and variance of Δ _Q_ 100-10( _V_ ).\nIn particular, the physical meaning of the variance feature is associated with the dependence of the discharged energy dissipation on\nvoltage, which is indicated by the grey region between the voltage **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy) **387**",
      "page_num": 6,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 402
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 7,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "**a** **b** 10 20 30 40 50 60 10 20 30 40 50 60 20 40 60 80 100 120 140 _i_ 400 350 300 250 200 150 100 50 400 350 300 250 200 150 100 50 **Fig. 5 |** **Prediction error as a function of cycle indices.** RMSE error, in units\nof cycles, is presented for training ( **a** ) and testing ( **b** ) datasets using only\nthe log variance of Δ _Qi_ - _j_ ( _V_ ), where indices _i_ and _j_ are varied. These errors\nare averaged over 20 random partitions of the data into equal training and\ntesting datasets. The errors are relatively flat after cycle 80. The increases\nin error around cycles _j_ = 55 and _i_ = 70 are due to temperature fluctuations\nof the environmental chamber (see Supplementary Fig. 25).",
      "page_num": 7,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 195
    },
    {
      "text": "curves in Fig. 2a. The integral of this region is the total change in\nenergy dissipation between cycles under galvanostatic conditions\nand is linearly related to the mean of Δ _Q_ ( _V_ ). Zero variance would\nindicate energy dissipations that are independent of voltage. Thus,\nthe variance of Δ _Q_ ( _V_ ) reflects the extent of non-uniformity in the\nenergy dissipation with voltage, due to either open-circuit or kinetic\nprocesses, a point that we return to later.\nWe observe that features derived from early-cycle discharge voltage curves have excellent predictive performance, even before the\nonset of capacity fade. We rationalize this observation by investigating degradation modes that do not immediately result in capacity\nfade yet still manifest in the discharge voltage curve and are also\nlinked to rapid capacity fade near the end of life.\nWhile our data-driven approach has successfully revealed predictive features from early-cycle discharge curves, identification\nof degradation modes using only high-rate data is challenging\nbecause of the convolution of kinetics with open-circuit behaviour.\nThus, we turn to established methods for mechanism identification\nusing low-rate cycling data. Dubarry et al. [61] mapped degradation\nmodes in LFP/graphite cells to their resultant shift in d _Q/_ d _V_ and\nd _V/_ d _Q_ derivatives for diagnostic cycles at _C_ /20. One degradation\nmode—loss of active material of the delithiated negative electrode\n(LAMdeNE)—results in a shift in discharge voltage with no change\nin capacity. This behaviour is observed when the negative electrode capacity is larger than that of the positive electrode, as is the\ncase in these LFP/graphite cells. Thus, a loss of delithiated negative electrode material changes the potentials at which lithium ions\nare stored without changing the overall capacity [50][,][61] . As proposed\nby Anséan et al. [50], at high rates of LAMdeNE, the negative electrode\ncapacity will eventually fall below the remaining lithium-ion inventory. At this point, the negative electrode will not have enough sites\nto accommodate lithium ions during charging, inducing lithium\nplating [50] . Since plating is an additional source of irreversibility, the\ncapacity loss accelerates. Thus, in early cycles, LAMdeNE shifts the\nvoltage curve without affecting the capacity fade curve and induces\nrapid capacity fade at high cycle number. This degradation mode, in conjunction with loss of lithium inventory, is widely observed\nin commercial LFP/graphite cells operated under similar conditions [32][,][50][–][54] ",
      "page_num": 7,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 551
    },
    {
      "text": "curves in Fig. 2a. The integral of this region is the total change in\nenergy dissipation between cycles under galvanostatic conditions\nand is linearly related to the mean of Δ _Q_ ( _V_ ). Zero variance would\nindicate energy dissipations that are independent of voltage. Thus,\nthe variance of Δ _Q_ ( _V_ ) reflects the extent of non-uniformity in the\nenergy dissipation with voltage, due to either open-circuit or kinetic\nprocesses, a point that we return to later.\nWe observe that features derived from early-cycle discharge voltage curves have excellent predictive performance, even before the\nonset of capacity fade. We rationalize this observation by investigating degradation modes that do not immediately result in capacity\nfade yet still manifest in the discharge voltage curve and are also\nlinked to rapid capacity fade near the end of life.\nWhile our data-driven approach has successfully revealed predictive features from early-cycle discharge curves, identification\nof degradation modes using only high-rate data is challenging\nbecause of the convolution of kinetics with open-circuit behaviour.\nThus, we turn to established methods for mechanism identification\nusing low-rate cycling data. Dubarry et al. [61] mapped degradation\nmodes in LFP/graphite cells to their resultant shift in d _Q/_ d _V_ and\nd _V/_ d _Q_ derivatives for diagnostic cycles at _C_ /20. One degradation\nmode—loss of active material of the delithiated negative electrode\n(LAMdeNE)—results in a shift in discharge voltage with no change\nin capacity. This behaviour is observed when the negative electrode capacity is larger than that of the positive electrode, as is the\ncase in these LFP/graphite cells. Thus, a loss of delithiated negative electrode material changes the potentials at which lithium ions\nare stored without changing the overall capacity [50][,][61] . As proposed\nby Anséan et al. [50], at high rates of LAMdeNE, the negative electrode\ncapacity will eventually fall below the remaining lithium-ion inventory. At this point, the negative electrode will not have enough sites\nto accommodate lithium ions during charging, inducing lithium\nplating [50] . Since plating is an additional source of irreversibility, the\ncapacity loss accelerates. Thus, in early cycles, LAMdeNE shifts the\nvoltage curve without affecting the capacity fade curve and induces\nrapid capacity fade at high cycle number. This degradation mode, in conjunction with loss of lithium inventory, is widely observed\nin commercial LFP/graphite cells operated under similar conditions [32][,][50][–][54]  We note that the graphitic negative electrode is common\nto nearly all commercial lithium-ion batteries in use today.\nTo investigate the contribution of LAMdeNE, we perform additional experiments for cells cycled with varied charging rates (4 _C_,\n6 _C_ and 8 _C_ ) and a constant discharge rate (4 _C_ ), incorporating slow\ncycling at the 1st, 100th and end-of-life cycles",
      "page_num": 7,
      "chunk_index": 3,
      "section_name": "Articles",
      "token_count": 641
    },
    {
      "text": "in conjunction with loss of lithium inventory, is widely observed\nin commercial LFP/graphite cells operated under similar conditions [32][,][50][–][54]  We note that the graphitic negative electrode is common\nto nearly all commercial lithium-ion batteries in use today.\nTo investigate the contribution of LAMdeNE, we perform additional experiments for cells cycled with varied charging rates (4 _C_,\n6 _C_ and 8 _C_ ) and a constant discharge rate (4 _C_ ), incorporating slow\ncycling at the 1st, 100th and end-of-life cycles Derivatives of diagnostic discharge curves at _C_ /10 (Fig 4, rows 1 and 2) are compared\nwith these, and Δ _Q_ ( _V_ ), at 4 _C_ at the 10th, 101st and end-of-life\ncycles (rows 3 and 4) The shifts in d _Q/_ d _V_ and d _V/_ d _Q_ observed in\ndiagnostic cycling correspond to a shift of the potentials at which\nlithium is stored in graphite during charging and are consistent\nwith LAMdeNE and loss of lithium inventory operating concurrently\n(Supplementary Fig 18) [50][,][51][,][61]  The magnitude of these shifts from\nthe 1st to 100th cycle increases with charging rate (Supplementary\nNote 5 and Supplementary Fig 19) These observations rationalize\nwhy models using features based on discharge curves have lower\nerrors than models using only features based on capacity fade\ncurves, since LAMdeNE does not manifest in capacity fade in early\ncycles We note that LAMdeNE alters a fraction of, rather than the\nentire, discharge voltage curve, consistent with the strong correlation between the variance of Δ _Q_ ( _V_ ) and cycle life (Fig 2c) In summary, we attribute the success of our predictive models to features\nthat capture changes in both the capacity fade curves and voltage\ncurves, since degradation may be silent in discharge capacity but\npresent in voltage curves.\nAs noted above, differential methods such as d _Q_ /d _V_ and d _V_ /d _Q_\nare used extensively to pinpoint degradation mechanisms [50][,][51][,][53][,][59][–][61] .\nThese approaches require low-rate diagnostic cycles, as higher\nrates smear out features due to heterogeneous de(intercalation) [32],\nas seen by comparing row 1 with row 3 in Fig 4 However, these\ndiagnostic cycles often induce a temporary capacity recovery,\ncommonly observed in cells when the geometric area of the negative electrode exceeds that of the positive electrode [56][,][57][.] As such,\nthey interrupt the trajectory of capacity fade (Supplementary\nFig 20)",
      "page_num": 7,
      "chunk_index": 4,
      "section_name": "Articles",
      "token_count": 597
    },
    {
      "text": "However, these\ndiagnostic cycles often induce a temporary capacity recovery,\ncommonly observed in cells when the geometric area of the negative electrode exceeds that of the positive electrode [56][,][57][.] As such,\nthey interrupt the trajectory of capacity fade (Supplementary\nFig 20) Therefore, by applying summary statistics to Δ _Q_ ( _V_ ) collected at high rate, we simultaneously avoid both low-rate diagnostic\ncycles and numerical differentiation, which decreases the signalto-noise ratio [65]  However, these high-rate discharge voltage curves\ncan additionally reflect both kinetic degradation modes and heterogeneities that are not observed in d _Q_ /d _V_ and d _V_ /d _Q_ curves at\n_C_ /10 We consider the influence of kinetic degradation modes in\nSupplementary Note 6, Supplementary Fig 21 and Supplementary\nTables 7–8); briefly, we estimate that low-rate modes such as\nLAMdeNE primarily contribute (50–80%) to Δ _Q_ ( _V_ ) We also mention that low-rate degradation modes such as LAMdeNE influence\nthe kinetics at high rate, in this case by increasing the local current\ndensity of the active regions.\nFinally, additional analysis was performed to understand the\nimpact of the cycle indices chosen for Δ _Q_ ( _V_ ) features in the regression setting Univariate linear models using only the variance of\n_Qi_ ( _V_ ) _– Qj_ ( _V_ ) for the training and primary testing datasets were\ninvestigated and are displayed in Fig 5 We find that the model is\nrelatively insensitive to the indexing scheme for _i_ _>_ 60, suggesting\nthat quantitative cycle life prediction using even earlier cycles is\npossible This trend is further validated by the model coefficients\nshown in Supplementary Fig 22 We hypothesize that the insensitivity of the model to the indexing scheme implies linear degradation with respect to cycle number, which is often assumed for LAM\nmodes [50][,][61]  Relative indexing schemes based on cycles in which a\nspecified capacity fade was achieved were also investigated and did\nnot result in improved predictions Furthermore, because the discharge capacity initially increases, specified decreases in capacity\nrequire more cycles to develop than fixed indexing (Supplementary\nNote 7 and Supplementary Figs 23–25). **388** **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy)",
      "page_num": 7,
      "chunk_index": 5,
      "section_name": "Articles",
      "token_count": 524
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 8,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "**Conclusions**\nData-driven modelling is a promising route for diagnostics and\nprognostics of lithium-ion batteries and enables emerging applications in their development, manufacturing and optimization. We\ndevelop cycle life prediction models using early-cycle discharge data\nyet to exhibit capacity degradation, generated from commercial\nLFP/graphite batteries cycled under fast-charging conditions. In the\nregression setting, we obtain a test error of 9.1% using only the first\n100 cycles; in the classification setting, we obtain a test error of 4.9%\nusing data from the first 5 cycles. This level of accuracy is achieved\nby extracting features from high-rate discharge voltage curves as\nopposed to only from the capacity fade curves, and without using\ndata from slow diagnostic cycles or assuming prior knowledge of\ncell chemistry and degradation mechanisms. The success of the\nmodel is rationalized by demonstrating consistency with degradation modes that do not manifest in capacity fade during early cycles\nbut impact the voltage curves. In general, our approach can complement approaches based on physical and semi-empirical models and\non specialized diagnostics. Broadly speaking, this work highlights\nthe promise of combining data generation and data-driven modelling for understanding and developing complex systems such as\nlithium-ion batteries.",
      "page_num": 8,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 259
    },
    {
      "text": "**Methods**\n**Cell cycling and data generation.** 124 commercial high-power LFP/graphite\nA123 APR18650M1A cells were used in this work. The cells have a nominal\ncapacity of 1.1 Ah and a nominal voltage of 3.3 V. The manufacturer’s\nrecommended fast-charging protocol is 3.6 _C_ constant current–constant voltage\n(CC-CV). The rate capability of these cells during charge and discharge is shown\nin Supplementary Fig. 27.\nAll cells were tested in cylindrical fixtures with four-point contacts on\na 48-channel Arbin LBT battery testing cycler. The tests were performed\nat a constant temperature of 30 °C in an environmental chamber (Amerex\nInstruments). Cell can temperatures were recorded by stripping a small section\nof the plastic insulation and contacting a type T thermocouple to the bare metal\ncasing using thermal epoxy (OMEGATHERM 201) and Kapton tape.\nThe cells were cycled with various candidate fast-charging policies\n(Supplementary Table 9) but identically discharged. Cells were charged from\n0% to 80% state-of-charge (SOC) with one of 72 different one-step and two-step\ncharging policies. Each step is a single _C_ rate applied over a given SOC range;\nfor example, a two-step policy could consist of a 6 _C_ charging step from 0% to\n50% SOC, followed by a 4 _C_ step from 50% to 80% SOC. The 72 charging polices\nrepresent different combinations of current steps within the 0% to 80% SOC range.\nThe charging time from 0% to 80% SOC ranged from 9 to 13.3 min. An internal\nresistance measurement was obtained during charging at 80% SOC by averaging 10\npulses of ±3.6 _C_ with a pulse width of 30 or 33 ms, where 1 _C_ is 1.1 A, or the current\nrequired to fully (dis)charge the nominal capacity (1.1 Ah) in 1 h. All cells then\ncharged from 80% to 100% SOC with a uniform 1 _C_ CC-CV charging step to 3.6 V\nand a current cutoff of _C_ /50. All cells were subsequently discharged with a CC-CV\ndischarge at 4 _C_ to 2.0 V with a current cutoff of _C_ /50. The voltage cutoffs used in\nthis work follow those recommended by the manufacturer.\nOur dataset is described in Supplementary Table 9. In total, our dataset\nconsists of three ‘batches’, or cells run in parallel. Each batch has slightly different\ntesting conditions. For the ‘2017-05-12’ batch, the rests after reaching 80% SOC\nduring charging and after discharging were 1 min and 1 s, respectively. For the\n‘2017-06-30’ batch, the rests after reaching 80% SOC during charging and after\ndischarging were both 5 min. For the ‘2018-04-12’ batch, 5 s rests were placed after\nreaching 80% SOC during charging, after the internal resistance test and before\nand after discharging.\nA histogram of cycle life for the three datasets is presented in Supplementary\nFig. 28. We note that four cells had unexpectedly high measurement noise and\nwere excluded from analysis.\nTo standardize the voltage–capacity data across cells and cycles, all 4 _C_\ndischarge curves were fitted to a spline function and linearly interpolated\n(Supplementary Fig. 29). Capacity was fitted as a function of voltage and evaluated\nat 1,000 linearly spaced voltage points from 3.5 V to 2.0 V. These uniformly sized\nvectors enabled straightforward data manipulations such as subtraction.",
      "page_num": 8,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 830
    },
    {
      "text": "**Machine-learning model development.** This study involved both model fitting\n(setting the coefficient values) and model selection (setting the model structure).\nTo perform these tasks simultaneously, a regularization technique was employed.\nA linear model of the form _ŷi_ = ̂ **w x** T _i_ (1) where all variables are defined as above.\nTo summarize our procedure, we first divide the data into training and test sets.\nWe then train the model on the training set using the elastic net, yielding a linear\nmodel with downselected features and coefficients. Finally, we apply the model to\nthe primary and secondary test sets.\nThe data processing and elastic net prediction is performed in MATLAB,\nwhile the classification is performed in Python using the NumPy, pandas and\nsklearn packages. **Data availability**\n[The datasets used in this study are available at https://data.matr.io/1.](https://data.matr.io/1) **Code availability**\n[Code for data processing is available at https://github.com/rdbraatz/data-driven-](https://github.com/rdbraatz/data-driven-prediction-of-battery-cycle-life-before-capacity-degradation)\n[prediction-of-battery-cycle-life-before-capacity-degradation. Code for the](https://github.com/rdbraatz/data-driven-prediction-of-battery-cycle-life-before-capacity-degradation)\nmodelling work is available from the corresponding authors upon request. Received: 2 October 2018; Accepted: 18 February 2019;\nPublished online: 25 March 2019 **References**\n1. Dunn, B., Kamath, H. & Tarascon, J.-M. Electrical energy storage for the grid:\na battery of choices. _Science_ **334**, 928–935 (2011).\n2. Nykvist, B. & Nilsson, M. Rapidly falling costs of battery packs for electric\nvehicles. _Nat. Clim. Change_ **5**, 329–332 (2015). was proposed, where _ŷi_ is the predicted number of cycles for battery _i_, **x** _i_ is a\n_p_ -dimensional feature vector for battery _i_ and **w** is a _p_ -dimensional model\ncoefficient vector. When applying regularization techniques, a penalty term is\nadded to the least-squares optimization formulation to avoid overfitting. Two\nregularization techniques, the lasso [66] and the elastic net [58], simultaneously perform\nmodel fitting and selection by finding sparse coefficient vectors. The formulation is **w** ̂ = argmin **w** ∥− **y Xw** ∥+22 _Pλ_ ( ) **w** (2)",
      "page_num": 8,
      "chunk_index": 3,
      "section_name": "Articles",
      "token_count": 571
    },
    {
      "text": "**w** ̂ = argmin **w** ∥− **y Xw** ∥+22 _Pλ_ ( ) **w** (2) where the argmin function represents finding the value of **w** that minimizes the\nargument, **y** is the _n_ -dimensional vector of observed battery lifetimes, **X** is the _n_ × _p_\nmatrix of features, and _λ_ is a non-negative scalar. The first term ∥− **y Xw** ∥ 22 (3) is found in ordinary least squares. The formulation of the second term, _P_ ( **w** ),\ndepends on the regularization technique being employed. For the lasso, _P_ **w** ( ) = ∥∥ **w** 1, (4) and for the elastic net, 1 _α_ 2\n_P_ **w** ( ) = [−] 2 ∥∥+ **w** 2 _α_ ∥∥ **w** 1 (5) where _α_ is a scalar between 0 and 1. Both formulations will result in sparse models.\nThe elastic net has been shown to perform better when _p » n_ [58], as is often the case in\nfeature engineering applications, but requires fitting an additional hyperparameter\n( _α_ and _λ_, as opposed to only _λ_ in the lasso). The elastic net is also preferred when\nthere are high correlations between the features, as is the case in this application. To\nchoose the values of the hyperparameters, we apply four-fold cross-validation and\nMonte Carlo sampling.\nThe model development dataset is divided into two equal sections, referred\nto as the training and primary testing sets. These two sections are chosen such\nthat each spans the range of cycle lives (see Supplementary Table 9). The training\ndata are used to choose the hyper-parameters _α_ and _λ_ and determine the values of\nthe coefficients, **w** . The training data are further subdivided into calibration and\nvalidation sets for cross-validation. The primary test set is then used as a measure of\ngeneralizability. The secondary test dataset was generated after model development.\nRMSE and average percentage error are chosen to evaluate model performance.\nRMSE is defined as where _yi_ is the observed cycle life, _ŷi_ is the predicted cycle life and _n_ is the total\nnumber of samples. The average percentage error is defined as = 1 ∑ _n_ ∣−∣ _yi_ _ŷi_ _n_ _i_ _i_ % err = 1 ∑ ∣−∣ _yi_ _ŷi_ × 100 (7) _n_ _y_ ∑",
      "page_num": 8,
      "chunk_index": 4,
      "section_name": "Articles",
      "token_count": 588
    },
    {
      "text": "∑ ∣−∣ _y_ _ŷi_ _y_ × _n_ _i_ = _i_ 1 _i_ **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy) **389**",
      "page_num": 8,
      "chunk_index": 5,
      "section_name": "Articles",
      "token_count": 70
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 9,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "3 Schmuch, R., Wagner, R., Hörpel, G., Placke, T & Winter, M Performance\nand cost of materials for lithium-based rechargeable automotive batteries.\n_Nat Energy_ **3**, 267–278 (2018).\n4 Peterson, S B., Apt, J & Whitacre, J F Lithium-ion battery cell degradation\nresulting from realistic vehicle and vehicle-to-grid utilization _J Power Sources_\n**195**, 2385–2392 (2010).\n5 Ramadesigan, V et al Modeling and simulation of lithium-ion batteries from\na systems engineering perspective _J Electrochem Soc._ **159**, R31–R45 (2012).\n6 Waag, W., Fleischer, C & Sauer, D U Critical review of the methods for\nmonitoring of lithium-ion batteries in electric and hybrid vehicles _J Power_\n_Sources_ **258**, 321–339 (2014).\n7 Paul, S., Diegelmann, C., Kabza, H & Tillmetz, W Analysis of ageing\ninhomogeneities in lithium-ion battery systems _J Power Sources_ **239**,\n642–650 (2013).\n8 Schuster, S F et al Nonlinear aging characteristics of lithium-ion cells under\ndifferent operational conditions _J Energy Storage_ **1**, 44–53 (2015).\n9 Schuster, S F., Brand, M J., Berg, P., Gleissenberger, M & Jossen, A.\nLithium-ion cell-to-cell variation during battery electric vehicle operation.\n_J Power Sources_ **297**, 242–251 (2015).\n10 Harris, S J., Harris, D J & Li, C Failure statistics for commercial lithium ion\nbatteries: a study of 24 pouch cells _J Power Sources_ **342**, 589–597 (2017).\n11 Baumhöfer, T., Brühl, M., Rothgang, S & Sauer, D U Production caused\nvariation in capacity aging trend and correlation to initial cell performance.\n_J Power Sources_ **247**, 332–338 (2014).\n12 Bloom, I et al An accelerated calendar and cycle life study of Li-ion cells.\n_J Power Sources_ **101**, 238–247 (2001).\n13 Broussely, M et al Aging mechanism in Li ion cells and calendar life\npredictions _J Power Sources_ **97–98**, 13–21 (2001).\n14 Christensen, J & Newman, J A mathematical model for the lithium-ion\nnegative electrode solid electrolyte interphase _J Electrochem Soc._ **151**,\nA1977 (2004).\n15 Pinson, M B & Bazant, M Z Theory of SEI formation in rechargeable\nbatteries: capacity fade, accelerated aging and lifetime prediction.\n_J Electrochem",
      "page_num": 9,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 593
    },
    {
      "text": "Theory of SEI formation in rechargeable\nbatteries: capacity fade, accelerated aging and lifetime prediction.\n_J Electrochem Soc._ **160**, A243–A250 (2012).\n16 Arora, P Mathematical modeling of the lithium deposition overcharge\nreaction in lithium-ion batteries using carbon-based negative electrodes.\n_J Electrochem Soc._ **146**, 3543 (1999).\n17 Yang, X.-G., Leng, Y., Zhang, G., Ge, S & Wang, C.-Y Modeling of lithium\nplating induced aging of lithium-ion batteries: transition from linear to\nnonlinear aging _J Power Sources_ **360**, 28–40 (2017).\n18 Christensen, J & Newman, J Cyclable lithium and capacity loss in Li-ion\ncells _J Electrochem Soc._ **152**, A818–A829 (2005).\n19 Zhang, Q & White, R E Capacity fade analysis of a lithium ion cell.\n_J Power Sources_ **179**, 793–798 (2008).\n20 Wright, R B et al Power fade and capacity fade resulting from cycle-life\ntesting of advanced technology development program lithium-ion batteries.\n_J Power Sources_ **119–121**, 865–869 (2003).\n21 Ramadesigan, V et al Parameter estimation and capacity fade analysis of\nlithium-ion batteries using reformulated models _J Electrochem Soc._ **158**,\nA1048–A1054 (2011).\n22 Cordoba-Arenas, A., Onori, S., Guezennec, Y & Rizzoni, G Capacity and\npower fade cycle-life model for plug-in hybrid electric vehicle lithium-ion\nbattery cells containing blended spinel and layered-oxide positive electrodes.\n_J Power Sources_ **278**, 473–483 (2015).\n23 Burns, J C et al Evaluation of effects of additives in wound Li-ion cells\nthrough high precision coulometry _J Electrochem Soc._ **158**, A255–A261 (2011).\n24 Burns, J C et al Predicting and extending the lifetime of Li-ion batteries.\n_J Electrochem Soc._ **160**, A1451–A1456 (2013).\n25 Chen, C H., Liu, J & Amine, K Symmetric cell approach and impedance\nspectroscopy of high power lithium-ion batteries _J Power Sources_ **96**,\n321–328 (2001).\n26 Tröltzsch, U., Kanoun, O & Tränkler, H.-R Characterizing aging effects of\nlithium-ion batteries by impedance spectroscopy _Electrochim Acta_ **51**,\n1664–1672 (2006).\n27 Love, C T., Virji, M B V., Rocheleau, R E & Swider-Lyons, K",
      "page_num": 9,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 600
    },
    {
      "text": "E & Swider-Lyons, K E.\nState-of-health monitoring of 18650 4S packs with a single-point impedance\ndiagnostic _J Power Sources_ **266**, 512–519 (2014).\n28 Waldmann, T et al A mechanical aging mechanism in lithium-ion batteries.\n_J Electrochem Soc._ **161**, A1742–A1747 (2014).\n29 Waldmann, T et al Influence of cell design on temperatures and temperature\ngradients in lithium-ion cells: an in operando study _J Electrochem Soc._ **162**,\nA921–A927 (2015).\n30 Bach, T C et al Nonlinear aging of cylindrical lithium-ion cells linked to\nheterogeneous compression _J Energy Storage_ **5**, 212–223 (2016).\n31 Harris, S J & Lu, P Effects of inhomogeneities—nanoscale to mesoscale—on\nthe durability of Li-ion batteries _J Phys Chem C_ **117**, 6481–6492 (2013).\n32 Lewerenz, M., Marongiu, A., Warnecke, A & Sauer, D U Differential voltage\nanalysis as a tool for analyzing inhomogeneous aging: a case study for\nLiFePO4|graphite cylindrical cells _J Power Sources_ **368**, 57–67 (2017). 33 Raccuglia, P et al Machine-learning-assisted materials discovery using failed\nexperiments _Nature_ **573**, 73–77 (2016).\n34 Ward, L., Agrawal, A., Choudhary, A & Wolverton, C A general-purpose\nmachine learning framework for predicting properties of inorganic materials.\n_NPJ Comput Mater._ **2**, 16028 (2016).\n35 Segler, M H S., Preuss, M & Waller, M P Planning chemical syntheses with\ndeep neural networks and symbolic AI _Nature_ **555**, 604–610 (2018).\n36 Jain, A et al Commentary: The Materials Project: a materials genome\napproach to accelerating materials innovation _APL Mater._ **1**, 011002 (2013).\n37 Aykol, M et al High-throughput computational design of cathode coatings\nfor Li-ion batteries _Nat Commun._ **7**, 13779 (2016).\n38 Sendek, A D et al Holistic computational structure screening of more than\n12000 candidates for solid lithium-ion conductor materials _Energy Environ._\n_Sci._ **10**, 306–320 (2017).\n39 Ulissi, Z W et al Machine-learning methods enable exhaustive searches\nfor active bimetallic facets and reveal active site motifs for CO2 reduction.\n_ACS Catal._ **7**, 6600–6608 (2017).\n40",
      "page_num": 9,
      "chunk_index": 3,
      "section_name": "Articles",
      "token_count": 594
    },
    {
      "text": "et al Machine-learning methods enable exhaustive searches\nfor active bimetallic facets and reveal active site motifs for CO2 reduction.\n_ACS Catal._ **7**, 6600–6608 (2017).\n40 Si, X.-S., Wang, W., Hu, C.-H & Zhou, D.-H Remaining useful life\nestimation—a review on the statistical data driven approaches _Eur J Oper._\n_Res._ **213**, 1–14 (2011).\n41 Wu, L., Fu, X & Guan, Y Review of the remaining useful life prognostics of\nvehicle lithium-ion batteries using data-driven methodologies _Appl Sci._ **6**,\n166 (2016).\n42 Saha, B., Goebel, K & Christophersen, J Comparison of prognostic\nalgorithms for estimating remaining useful life of batteries _Trans Inst Meas._\n_Control_ **31**, 293–308 (2009).\n43 Nuhic, A., Terzimehic, T., Soczka-Guth, T., Buchholz, M & Dietmayer, K.\nHealth diagnosis and remaining useful life prognostics of lithium-ion\nbatteries using data-driven methods _J Power Sources_ **239**, 680–688 (2013).\n44 Hu, C., Jain, G., Tamirisa, P & Gorka, T Method for estimating the capacity\nand predicting remaining useful life of lithium-ion battery _Appl Energy_ **126**,\n182–189 (2014).\n45 Miao, Q., Xie, L., Cui, H., Liang, W & Pecht, M Remaining useful life\nprediction of lithium-ion battery with unscented particle filter technique.\n_Microelectron Reliab._ **53**, 805–810 (2013).\n46 Hu, X.,  & Jiang, J & Cao, D & Egardt, B Battery health prognosis for\nelectric vehicles using sample entropy and sparse Bayesian predictive\nmodeling _IEEE Trans Ind Electron._ **63**, 2645–2656 (2016).\n47 Zhang, Y.,  & Xiong, R & He, H & Pecht, M Lithium-ion battery remaining\nuseful life prediction with Box–Cox transformation and Monte Carlo\nsimulation _IEEE Trans Ind Electron._ **66**, 1585–1597 (2019).\n48 Zhang, Y., & Xiong, R & He, H & Pecht, M Long short-term memory\nrecurrent neural network for remaining useful life prediction of lithium-ion\nbatteries _IEEE Trans Veh Technol._ **67**, 5695–5705 (2018).\n49 Saha, B & Goebel, K Battery data set _NASA Ames Progn Data Repos_  (2007).\n50 Anseán, D et al",
      "page_num": 9,
      "chunk_index": 4,
      "section_name": "Articles",
      "token_count": 596
    },
    {
      "text": "Anseán, D et al Fast charging technique for high power LiFePO4\nbatteries: a mechanistic analysis of aging _J Power Sources_ **321**,\n201–209 (2016).\n51 Anseán, D et al Operando lithium plating quantification and early detection\nof a commercial LiFePO4 cell cycles under dynamic driving schedule.\n_J Power Sources_ **356**, 36–46 (2017).\n52 Liu, P et al Aging mechanisms of LiFePO4 batteries deduced by\nelectrochemical and structural analyses _J Electrochem Soc._ **157**,\nA499–A507 (2010).\n53 Safari, M & Delacourt, C Aging of a commercial graphite/LiFePO4 cell.\n_J Electrochem Soc._ **158**, A1123–A1135 (2011).\n54 Sarasketa-Zabala, E et al Understanding lithium inventory loss and sudden\nperformance fade in cylindrical cells during cycling with deep-discharge\nsteps _J Phys Chem C_ **119**, 896–906 (2015).\n55 Ahmed, S et al Enabling fast charging—a battery technology gap assessment.\n_J Power Sources_ **367**, 250–262 (2017).\n56 Gyenes, B., Stevens, D A., Chevrier, V L & Dahn, J R Understanding\nanomalous behavior in Coulombic efficiency measurements on Li-ion\nbatteries _J Electrochem Soc._ **162**, A278–A283 (2015).\n57 Lewerenz, M et al Systematic aging of commercial LiFePO4|graphite\ncylindrical cells including a theory explaining rise of capacity during aging.\n_J Power Sources_ **345**, 254–263 (2017).\n58 Zou, H & Hastie, T Regularization and variable selection via the elastic net.\n_J R Stat Soc B_ **67**, 301–320 (2005).\n59 Bloom, I et al Differential voltage analyses of high-power, lithium-ion cells:\n1 Technique and application _J Power Sources_ **139**, 295–303 (2005).\n60 Smith, A J., Burns, J C & Dahn, J R High-precision differential capacity\nanalysis of LiMn2O4/graphite cells _Electrochem Solid-State Lett._ **14**,\nA39–A41 (2011).\n61 Dubarry, M., Truchot, C & Liaw, B Y Synthesize battery degradation\nmodes via a diagnostic and prognostic model _J Power Sources_ **219**,\n204–216 (2012).\n62 Berecibar, M et al Online state of health estimation on NMC cells based on\npredictive analytics _J Power Sources_ **320**, 239–250 (2016).",
      "page_num": 9,
      "chunk_index": 5,
      "section_name": "Articles",
      "token_count": 592
    },
    {
      "text": "Power Sources_ **320**, 239–250 (2016). **390** **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy)",
      "page_num": 9,
      "chunk_index": 6,
      "section_name": "Articles",
      "token_count": 54
    },
    {
      "text": "**NATUre Energy**",
      "page_num": 10,
      "chunk_index": 0,
      "section_name": "Content",
      "token_count": 7
    },
    {
      "text": "63. Berecibar, M., Garmendia, M., Gandiaga, I., Crego, J. & Villarreal, I. State of\nhealth estimation algorithm of LiFePO4 battery packs based on differential\nvoltage curves for battery management system application. _Energy_ **103**,\n784–796 (2016).\n64. Birkl, C. R., Roberts, M. R., McTurk, E., Bruce, P. G. & Howey, D. A. Degradation\ndiagnostics for lithium ion cells. _J. Power Sources_ **341**, 373–386 (2017).\n65. Richardson, R. R., Birkl, C. R., Osborne, M. A. & Howey, D. A. Gaussian\nprocess regression for in-situ capacity estimation of lithium-ion batteries.\n_IEEE Trans. Ind. Inform._ **15**, 127–138 (2019).\n66. Tibshirani, R. Regression shrinkage and selection via the lasso. _J. R. Stat. Soc._\n_B_ **58**, 267–288 (1996). **Acknowledgements**\nThis work was supported by Toyota Research Institute through the Accelerated Materials\nDesign and Discovery programme. P.M.A. was supported by the Thomas V. Jones\nStanford Graduate Fellowship and the National Science Foundation Graduate Research\nFellowship under Grant No. DGE-114747. N.P. was supported by SAIC Innovation\nCenter through Stanford Energy 3.0 industry affiliates programme. S.J.H. was supported\nby the Assistant Secretary for Energy Efficiency, Vehicle Technologies Office of the US\nDepartment of Energy under the Advanced Battery Materials Research Program. We\nthank E. Reed, S. Ermon, Y. Li, C. Bauemer, A. Grover, T. Markov, D. Deng, A. Baclig and\nH. Thaman for discussions. **Author contributions**\nP.M.A., N.J., N.P., M.H.C. and W.C.C. conceived of and conducted the experiments.\nK.A.S., Z.Y. and B.J. performed the modelling. M.A., Z.Y. and P.K.H. performed data\nmanagement. P.M.A., K.A.S., N.J., B.J., D.F., M.Z.B., S.J.H., W.C.C. and R.D.B. interpreted\nthe results. All authors edited and reviewed the manuscript. W.C.C. and R.D.B.\nsupervised the work. **Competing interests**\nK.A.S., R.D.B., W.C.C., P.M.A., N.J., S.J.H. and N.P. have filed a patent related to this\nwork: US Application No. 62/575,565, dated 16 October 2018.",
      "page_num": 10,
      "chunk_index": 1,
      "section_name": "Articles",
      "token_count": 589
    },
    {
      "text": "**Competing interests**\nK.A.S., R.D.B., W.C.C., P.M.A., N.J., S.J.H. and N.P. have filed a patent related to this\nwork: US Application No. 62/575,565, dated 16 October 2018. **Additional information**\n**Supplementary information** [is available for this paper at https://doi.org/10.1038/](https://doi.org/10.1038/s41560-019-0356-8)\n[s41560-019-0356-8.](https://doi.org/10.1038/s41560-019-0356-8) **Reprints and permissions information** [is available at www.nature.com/reprints.](http://www.nature.com/reprints) **Correspondence and requests for materials** should be addressed to W.C.C. or R.D.B. **Publisher’s note:** Springer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations. © The Author(s), under exclusive licence to Springer Nature Limited 2019 **Nature Energy** [| VOL 4 | MAY 2019 | 383–391 | www.nature.com/natureenergy](http://www.nature.com/natureenergy) **391**",
      "page_num": 10,
      "chunk_index": 2,
      "section_name": "Articles",
      "token_count": 269
    }
  ],
  "total_chunks": 41,
  "created_at": "2026-02-04 14:04:56"
}